[Killed] ArithmeticOperator
src/app/armor/script.tsx:16:41
             item.defenses.slash,
             item.defenses.pierce,
         ]
-            .reduce((total, defense) => total + defense, 0.0)
+            .reduce((total, defense) => total - defense, 0.0)
             .toFixed(1) + " Standard, ";
     let physical = item.defenses.physical.toFixed(1) + " Physical, ";
killedBy: Armor Optimizer Script converts item stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "10.0",
    "5",

[Killed] StringLiteral
src/app/armor/script.tsx:19:52
             .reduce((total, defense) => total + defense, 0.0)
             .toFixed(1) + " Standard, ";
     let physical = item.defenses.physical.toFixed(1) + " Physical, ";
-    let strike = item.defenses.strike.toFixed(1) + " Strike, ";
+    let strike = item.defenses.strike.toFixed(1) + "";
     let slash = item.defenses.slash.toFixed(1) + " Slash, ";
     let pierce = item.defenses.pierce.toFixed(1) + " Pierce, ";
killedBy: Armor Optimizer Script converts item stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "10.0",
    "5",

[Killed] StringLiteral
src/app/armor/script.tsx:32:48
             .reduce((total, defense) => total + defense, 0.0)
             .toFixed(1) + " Elemental, ";
     let magic = item.defenses.magic.toFixed(1) + " Magic, ";
-    let fire = item.defenses.fire.toFixed(1) + " Fire, ";
+    let fire = item.defenses.fire.toFixed(1) + "";
     let lightning = item.defenses.lightning.toFixed(1) + " Lightning, ";
     let holy = item.defenses.holy.toFixed(1) + " Holy, ";
killedBy: Armor Optimizer Script converts item stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "10.0",
    "5",

[Killed] StringLiteral
src/app/armor/script.tsx:37:9
     let holy = item.defenses.holy.toFixed(1) + " Holy, ";
     let resistances =
         item.resistances["scarlet-rot"] +
-        " Scarlet Rot, " +
+        "" +
         item.resistances.poison +
         " Poison, " +
killedBy: Armor Optimizer Script converts item stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "10.0",
    "5",

[Killed] StringLiteral
src/app/armor/script.tsx:39:9
         item.resistances["scarlet-rot"] +
         " Scarlet Rot, " +
         item.resistances.poison +
-        " Poison, " +
+        "" +
         item.resistances.hemorrhage +
         " Hemorrhage, " +
killedBy: Armor Optimizer Script converts item stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "10.0",
    "5",

[Killed] StringLiteral
src/app/armor/script.tsx:49:9
         item.resistances.madness +
         " Madness, " +
         item.resistances["death-blight"] +
-        " Death";
+        "";
 
     return [
killedBy: Armor Optimizer Script converts item stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "10.0",
    "5",

[Killed] ArrayDeclaration
src/app/armor/script.tsx:51:12
         item.resistances["death-blight"] +
         " Death";
 
-    return [
-        weight,
-        poise,
-        standard + physical + strike + slash + pierce,
-        elemental + magic + fire + lightning + holy,
-        resistances,
-    ];
+    return [];
 }
 
killedBy: Armor Optimizer Script converts item stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   "10.0",
-   "5",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:65:13
         id: "IMAGINARY",
         name: "IMAGINARY",
         weight:
-            set.helmet?.weight! +
-            set.chestpiece?.weight! +
+            set.helmet?.weight! - set.chestpiece?.weight! +
             set.gauntlets?.weight! +
             set.leggings?.weight!,
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "46.0",
+   "24.0",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:65:13
         id: "IMAGINARY",
         name: "IMAGINARY",
         weight:
-            set.helmet?.weight! +
-            set.chestpiece?.weight! +
-            set.gauntlets?.weight! +
+            set.helmet?.weight! + set.chestpiece?.weight! - set.gauntlets?.weight! +
             set.leggings?.weight!,
         poise:
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "46.0",
+   "22.0",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:70:13
             set.gauntlets?.weight! +
             set.leggings?.weight!,
         poise:
-            set.helmet?.poise! +
-            set.chestpiece?.poise! +
-            set.gauntlets?.poise! +
-            set.leggings?.poise!,
+            set.helmet?.poise! + set.chestpiece?.poise! + set.gauntlets?.poise! - set.leggings?.poise!,
         defenses: {
             physical:
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
-   "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:70:13
             set.gauntlets?.weight! +
             set.leggings?.weight!,
         poise:
-            set.helmet?.poise! +
-            set.chestpiece?.poise! +
+            set.helmet?.poise! - set.chestpiece?.poise! +
             set.gauntlets?.poise! +
             set.leggings?.poise!,
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
-   "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:76:17
             set.leggings?.poise!,
         defenses: {
             physical:
-                set.helmet?.defenses.physical! +
-                set.chestpiece?.defenses.physical! +
-                set.gauntlets?.defenses.physical! +
+                set.helmet?.defenses.physical! + set.chestpiece?.defenses.physical! - set.gauntlets?.defenses.physical! +
                 set.leggings?.defenses.physical!,
             strike:
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:76:17
             set.leggings?.poise!,
         defenses: {
             physical:
-                set.helmet?.defenses.physical! +
-                set.chestpiece?.defenses.physical! +
+                set.helmet?.defenses.physical! - set.chestpiece?.defenses.physical! +
                 set.gauntlets?.defenses.physical! +
                 set.leggings?.defenses.physical!,
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:81:17
                 set.gauntlets?.defenses.physical! +
                 set.leggings?.defenses.physical!,
             strike:
-                set.helmet?.defenses.strike! +
-                set.chestpiece?.defenses.strike! +
-                set.gauntlets?.defenses.strike! +
+                set.helmet?.defenses.strike! + set.chestpiece?.defenses.strike! - set.gauntlets?.defenses.strike! +
                 set.leggings?.defenses.strike!,
             slash:
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:81:17
                 set.gauntlets?.defenses.physical! +
                 set.leggings?.defenses.physical!,
             strike:
-                set.helmet?.defenses.strike! +
-                set.chestpiece?.defenses.strike! +
-                set.gauntlets?.defenses.strike! +
-                set.leggings?.defenses.strike!,
+                set.helmet?.defenses.strike! + set.chestpiece?.defenses.strike! + set.gauntlets?.defenses.strike! - set.leggings?.defenses.strike!,
             slash:
                 set.helmet?.defenses.slash! +
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:86:17
                 set.gauntlets?.defenses.strike! +
                 set.leggings?.defenses.strike!,
             slash:
-                set.helmet?.defenses.slash! +
-                set.chestpiece?.defenses.slash! +
-                set.gauntlets?.defenses.slash! +
+                set.helmet?.defenses.slash! + set.chestpiece?.defenses.slash! - set.gauntlets?.defenses.slash! +
                 set.leggings?.defenses.slash!,
             pierce:
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:86:17
                 set.gauntlets?.defenses.strike! +
                 set.leggings?.defenses.strike!,
             slash:
-                set.helmet?.defenses.slash! +
-                set.chestpiece?.defenses.slash! +
-                set.gauntlets?.defenses.slash! +
-                set.leggings?.defenses.slash!,
+                set.helmet?.defenses.slash! + set.chestpiece?.defenses.slash! + set.gauntlets?.defenses.slash! - set.leggings?.defenses.slash!,
             pierce:
                 set.helmet?.defenses.pierce! +
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:91:17
                 set.gauntlets?.defenses.slash! +
                 set.leggings?.defenses.slash!,
             pierce:
-                set.helmet?.defenses.pierce! +
-                set.chestpiece?.defenses.pierce! +
+                set.helmet?.defenses.pierce! - set.chestpiece?.defenses.pierce! +
                 set.gauntlets?.defenses.pierce! +
                 set.leggings?.defenses.pierce!,
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:91:17
                 set.gauntlets?.defenses.slash! +
                 set.leggings?.defenses.slash!,
             pierce:
-                set.helmet?.defenses.pierce! +
-                set.chestpiece?.defenses.pierce! +
-                set.gauntlets?.defenses.pierce! +
-                set.leggings?.defenses.pierce!,
+                set.helmet?.defenses.pierce! + set.chestpiece?.defenses.pierce! + set.gauntlets?.defenses.pierce! - set.leggings?.defenses.pierce!,
             magic:
                 set.helmet?.defenses.magic! +
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:96:17
                 set.gauntlets?.defenses.pierce! +
                 set.leggings?.defenses.pierce!,
             magic:
-                set.helmet?.defenses.magic! +
-                set.chestpiece?.defenses.magic! +
-                set.gauntlets?.defenses.magic! +
-                set.leggings?.defenses.magic!,
+                set.helmet?.defenses.magic! + set.chestpiece?.defenses.magic! + set.gauntlets?.defenses.magic! - set.leggings?.defenses.magic!,
             fire:
                 set.helmet?.defenses.fire! +
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:96:17
                 set.gauntlets?.defenses.pierce! +
                 set.leggings?.defenses.pierce!,
             magic:
-                set.helmet?.defenses.magic! +
-                set.chestpiece?.defenses.magic! +
-                set.gauntlets?.defenses.magic! +
+                set.helmet?.defenses.magic! + set.chestpiece?.defenses.magic! - set.gauntlets?.defenses.magic! +
                 set.leggings?.defenses.magic!,
             fire:
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:101:17
                 set.gauntlets?.defenses.magic! +
                 set.leggings?.defenses.magic!,
             fire:
-                set.helmet?.defenses.fire! +
-                set.chestpiece?.defenses.fire! +
-                set.gauntlets?.defenses.fire! +
+                set.helmet?.defenses.fire! + set.chestpiece?.defenses.fire! - set.gauntlets?.defenses.fire! +
                 set.leggings?.defenses.fire!,
             lightning:
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:101:17
                 set.gauntlets?.defenses.magic! +
                 set.leggings?.defenses.magic!,
             fire:
-                set.helmet?.defenses.fire! +
-                set.chestpiece?.defenses.fire! +
-                set.gauntlets?.defenses.fire! +
-                set.leggings?.defenses.fire!,
+                set.helmet?.defenses.fire! + set.chestpiece?.defenses.fire! + set.gauntlets?.defenses.fire! - set.leggings?.defenses.fire!,
             lightning:
                 set.helmet?.defenses.lightning! +
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:106:17
                 set.gauntlets?.defenses.fire! +
                 set.leggings?.defenses.fire!,
             lightning:
-                set.helmet?.defenses.lightning! +
-                set.chestpiece?.defenses.lightning! +
-                set.gauntlets?.defenses.lightning! +
+                set.helmet?.defenses.lightning! + set.chestpiece?.defenses.lightning! - set.gauntlets?.defenses.lightning! +
                 set.leggings?.defenses.lightning!,
             holy:
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:106:17
                 set.gauntlets?.defenses.fire! +
                 set.leggings?.defenses.fire!,
             lightning:
-                set.helmet?.defenses.lightning! +
-                set.chestpiece?.defenses.lightning! +
-                set.gauntlets?.defenses.lightning! +
-                set.leggings?.defenses.lightning!,
+                set.helmet?.defenses.lightning! + set.chestpiece?.defenses.lightning! + set.gauntlets?.defenses.lightning! - set.leggings?.defenses.lightning!,
             holy:
                 set.helmet?.defenses.holy! +
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:111:17
                 set.gauntlets?.defenses.lightning! +
                 set.leggings?.defenses.lightning!,
             holy:
-                set.helmet?.defenses.holy! +
-                set.chestpiece?.defenses.holy! +
+                set.helmet?.defenses.holy! - set.chestpiece?.defenses.holy! +
                 set.gauntlets?.defenses.holy! +
                 set.leggings?.defenses.holy!,
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:111:17
                 set.gauntlets?.defenses.lightning! +
                 set.leggings?.defenses.lightning!,
             holy:
-                set.helmet?.defenses.holy! +
-                set.chestpiece?.defenses.holy! +
-                set.gauntlets?.defenses.holy! +
-                set.leggings?.defenses.holy!,
+                set.helmet?.defenses.holy! + set.chestpiece?.defenses.holy! + set.gauntlets?.defenses.holy! - set.leggings?.defenses.holy!,
         },
         resistances: {
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:118:17
         },
         resistances: {
             "scarlet-rot":
-                set.helmet?.resistances["scarlet-rot"]! +
-                set.chestpiece?.resistances["scarlet-rot"]! +
-                set.gauntlets?.resistances["scarlet-rot"]! +
-                set.leggings?.resistances["scarlet-rot"]!,
+                set.helmet?.resistances["scarlet-rot"]! + set.chestpiece?.resistances["scarlet-rot"]! + set.gauntlets?.resistances["scarlet-rot"]! - set.leggings?.resistances["scarlet-rot"]!,
             poison:
                 set.helmet?.resistances.poison! +
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:118:17
         },
         resistances: {
             "scarlet-rot":
-                set.helmet?.resistances["scarlet-rot"]! +
-                set.chestpiece?.resistances["scarlet-rot"]! +
-                set.gauntlets?.resistances["scarlet-rot"]! +
+                set.helmet?.resistances["scarlet-rot"]! + set.chestpiece?.resistances["scarlet-rot"]! - set.gauntlets?.resistances["scarlet-rot"]! +
                 set.leggings?.resistances["scarlet-rot"]!,
             poison:
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:123:17
                 set.gauntlets?.resistances["scarlet-rot"]! +
                 set.leggings?.resistances["scarlet-rot"]!,
             poison:
-                set.helmet?.resistances.poison! +
-                set.chestpiece?.resistances.poison! +
+                set.helmet?.resistances.poison! - set.chestpiece?.resistances.poison! +
                 set.gauntlets?.resistances.poison! +
                 set.leggings?.resistances.poison!,
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:123:17
                 set.gauntlets?.resistances["scarlet-rot"]! +
                 set.leggings?.resistances["scarlet-rot"]!,
             poison:
-                set.helmet?.resistances.poison! +
-                set.chestpiece?.resistances.poison! +
-                set.gauntlets?.resistances.poison! +
-                set.leggings?.resistances.poison!,
+                set.helmet?.resistances.poison! + set.chestpiece?.resistances.poison! + set.gauntlets?.resistances.poison! - set.leggings?.resistances.poison!,
             hemorrhage:
                 set.helmet?.resistances.hemorrhage! +
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:128:17
                 set.gauntlets?.resistances.poison! +
                 set.leggings?.resistances.poison!,
             hemorrhage:
-                set.helmet?.resistances.hemorrhage! +
-                set.chestpiece?.resistances.hemorrhage! +
+                set.helmet?.resistances.hemorrhage! - set.chestpiece?.resistances.hemorrhage! +
                 set.gauntlets?.resistances.hemorrhage! +
                 set.leggings?.resistances.hemorrhage!,
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:128:17
                 set.gauntlets?.resistances.poison! +
                 set.leggings?.resistances.poison!,
             hemorrhage:
-                set.helmet?.resistances.hemorrhage! +
-                set.chestpiece?.resistances.hemorrhage! +
-                set.gauntlets?.resistances.hemorrhage! +
+                set.helmet?.resistances.hemorrhage! + set.chestpiece?.resistances.hemorrhage! - set.gauntlets?.resistances.hemorrhage! +
                 set.leggings?.resistances.hemorrhage!,
             frostbite:
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:133:17
                 set.gauntlets?.resistances.hemorrhage! +
                 set.leggings?.resistances.hemorrhage!,
             frostbite:
-                set.helmet?.resistances.frostbite! +
-                set.chestpiece?.resistances.frostbite! +
-                set.gauntlets?.resistances.frostbite! +
-                set.leggings?.resistances.frostbite!,
+                set.helmet?.resistances.frostbite! + set.chestpiece?.resistances.frostbite! + set.gauntlets?.resistances.frostbite! - set.leggings?.resistances.frostbite!,
             sleep:
                 set.helmet?.resistances.sleep! +
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:133:17
                 set.gauntlets?.resistances.hemorrhage! +
                 set.leggings?.resistances.hemorrhage!,
             frostbite:
-                set.helmet?.resistances.frostbite! +
-                set.chestpiece?.resistances.frostbite! +
-                set.gauntlets?.resistances.frostbite! +
+                set.helmet?.resistances.frostbite! + set.chestpiece?.resistances.frostbite! - set.gauntlets?.resistances.frostbite! +
                 set.leggings?.resistances.frostbite!,
             sleep:
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:138:17
                 set.gauntlets?.resistances.frostbite! +
                 set.leggings?.resistances.frostbite!,
             sleep:
-                set.helmet?.resistances.sleep! +
-                set.chestpiece?.resistances.sleep! +
-                set.gauntlets?.resistances.sleep! +
-                set.leggings?.resistances.sleep!,
+                set.helmet?.resistances.sleep! + set.chestpiece?.resistances.sleep! + set.gauntlets?.resistances.sleep! - set.leggings?.resistances.sleep!,
             madness:
                 set.helmet?.resistances.madness! +
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:138:17
                 set.gauntlets?.resistances.frostbite! +
                 set.leggings?.resistances.frostbite!,
             sleep:
-                set.helmet?.resistances.sleep! +
-                set.chestpiece?.resistances.sleep! +
-                set.gauntlets?.resistances.sleep! +
+                set.helmet?.resistances.sleep! + set.chestpiece?.resistances.sleep! - set.gauntlets?.resistances.sleep! +
                 set.leggings?.resistances.sleep!,
             madness:
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:143:17
                 set.gauntlets?.resistances.sleep! +
                 set.leggings?.resistances.sleep!,
             madness:
-                set.helmet?.resistances.madness! +
-                set.chestpiece?.resistances.madness! +
+                set.helmet?.resistances.madness! - set.chestpiece?.resistances.madness! +
                 set.gauntlets?.resistances.madness! +
                 set.leggings?.resistances.madness!,
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:143:17
                 set.gauntlets?.resistances.sleep! +
                 set.leggings?.resistances.sleep!,
             madness:
-                set.helmet?.resistances.madness! +
-                set.chestpiece?.resistances.madness! +
-                set.gauntlets?.resistances.madness! +
-                set.leggings?.resistances.madness!,
+                set.helmet?.resistances.madness! + set.chestpiece?.resistances.madness! + set.gauntlets?.resistances.madness! - set.leggings?.resistances.madness!,
             "death-blight":
                 set.helmet?.resistances["death-blight"]! +
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:148:17
                 set.gauntlets?.resistances.madness! +
                 set.leggings?.resistances.madness!,
             "death-blight":
-                set.helmet?.resistances["death-blight"]! +
-                set.chestpiece?.resistances["death-blight"]! +
+                set.helmet?.resistances["death-blight"]! - set.chestpiece?.resistances["death-blight"]! +
                 set.gauntlets?.resistances["death-blight"]! +
                 set.leggings?.resistances["death-blight"]!,
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ArithmeticOperator
src/app/armor/script.tsx:148:17
                 set.gauntlets?.resistances.madness! +
                 set.leggings?.resistances.madness!,
             "death-blight":
-                set.helmet?.resistances["death-blight"]! +
-                set.chestpiece?.resistances["death-blight"]! +
-                set.gauntlets?.resistances["death-blight"]! +
-                set.leggings?.resistances["death-blight"]!,
+                set.helmet?.resistances["death-blight"]! + set.chestpiece?.resistances["death-blight"]! + set.gauntlets?.resistances["death-blight"]! - set.leggings?.resistances["death-blight"]!,
         },
     };
killedBy: Armor Optimizer Script sets stats to string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "46.0",
    "26",

[Killed] ConditionalExpression
src/app/armor/script.tsx:160:9
 
 function armorSetContains(set: ArmorSet, item: Armor): boolean {
     return (
-        set.helmet?.id === item.id ||
-        set.chestpiece?.id === item.id ||
-        set.gauntlets?.id === item.id ||
-        set.leggings?.id === item.id
+        true
     );
 }
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] LogicalOperator
src/app/armor/script.tsx:160:9
 
 function armorSetContains(set: ArmorSet, item: Armor): boolean {
     return (
-        set.helmet?.id === item.id ||
-        set.chestpiece?.id === item.id ||
-        set.gauntlets?.id === item.id ||
+        (set.helmet?.id === item.id || set.chestpiece?.id === item.id) && set.gauntlets?.id === item.id ||
         set.leggings?.id === item.id
     );
killedBy: Armor Optimizer Script dominated with locked items
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 75

@@ -22,6 +22,81 @@
        "scarlet-rot": 5,
        "sleep": 5,
