[Killed] EqualityOperator
src/app/armor/script.tsx:161:9
 function armorSetContains(set: ArmorSet, item: Armor): boolean {
     return (
         set.helmet?.id === item.id ||
-        set.chestpiece?.id === item.id ||
+        set.chestpiece?.id !== item.id ||
         set.gauntlets?.id === item.id ||
         set.leggings?.id === item.id
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Survived] ConditionalExpression
src/app/armor/script.tsx:161:9
 function armorSetContains(set: ArmorSet, item: Armor): boolean {
     return (
         set.helmet?.id === item.id ||
-        set.chestpiece?.id === item.id ||
+        false ||
         set.gauntlets?.id === item.id ||
         set.leggings?.id === item.id

[Killed] EqualityOperator
src/app/armor/script.tsx:162:9
     return (
         set.helmet?.id === item.id ||
         set.chestpiece?.id === item.id ||
-        set.gauntlets?.id === item.id ||
+        set.gauntlets?.id !== item.id ||
         set.leggings?.id === item.id
     );
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Survived] ConditionalExpression
src/app/armor/script.tsx:162:9
     return (
         set.helmet?.id === item.id ||
         set.chestpiece?.id === item.id ||
-        set.gauntlets?.id === item.id ||
+        false ||
         set.leggings?.id === item.id
     );

[Killed] EqualityOperator
src/app/armor/script.tsx:163:9
         set.helmet?.id === item.id ||
         set.chestpiece?.id === item.id ||
         set.gauntlets?.id === item.id ||
-        set.leggings?.id === item.id
+        set.leggings?.id !== item.id
     );
 }
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Survived] ConditionalExpression
src/app/armor/script.tsx:163:9
         set.helmet?.id === item.id ||
         set.chestpiece?.id === item.id ||
         set.gauntlets?.id === item.id ||
-        set.leggings?.id === item.id
+        false
     );
 }

[Killed] ConditionalExpression
src/app/armor/script.tsx:173:9
     ignoredItems: Armor[],
     sortBy: SortByArmor
 ): Armor[] {
-    if (itemList.some((item: Armor) => armorSetContains(lockedItems, item))) {
+    if (true) {
         return [
             itemList.find((item: any) => armorSetContains(lockedItems, item))!,
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'weight')

[Killed] ConditionalExpression
src/app/armor/script.tsx:173:9
     ignoredItems: Armor[],
     sortBy: SortByArmor
 ): Armor[] {
-    if (itemList.some((item: Armor) => armorSetContains(lockedItems, item))) {
+    if (false) {
         return [
             itemList.find((item: any) => armorSetContains(lockedItems, item))!,
killedBy: Armor Optimizer Script dominated with locked items
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 75

@@ -22,6 +22,81 @@
        "scarlet-rot": 5,
        "sleep": 5,

[Killed] ArrowFunction
src/app/armor/script.tsx:175:27
 ): Armor[] {
     if (itemList.some((item: Armor) => armorSetContains(lockedItems, item))) {
         return [
-            itemList.find((item: any) => armorSetContains(lockedItems, item))!,
+            itemList.find(() => undefined)!,
         ];
     }
killedBy: Armor Optimizer Script dominated with locked items
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 25
+ Received  +  1

  Array [
-   Object {
-     "defenses": Object {

[Killed] MethodExpression
src/app/armor/script.tsx:180:16
     }
 
     // remove ignored items from itemList
-    itemList = itemList.filter(
-        (item: Armor) => !ignoredItems.some((i) => i.id === item.id)
-    );
+    itemList = itemList;
 
     let sorted = [...itemList];
killedBy: Armor Optimizer Script dominated with ignored items
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 25

@@ -1,8 +1,33 @@
  Array [
    Object {

[Killed] MethodExpression
src/app/armor/script.tsx:181:27
 
     // remove ignored items from itemList
     itemList = itemList.filter(
-        (item: Armor) => !ignoredItems.some((i) => i.id === item.id)
+        (item: Armor) => !ignoredItems.every(i => i.id === item.id)
     );
 
killedBy: Armor Optimizer Script dominated
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 102
+ Received  +   1

- Array [
-   Object {
-     "defenses": Object {

[Killed] ArrowFunction
src/app/armor/script.tsx:181:45
 
     // remove ignored items from itemList
     itemList = itemList.filter(
-        (item: Armor) => !ignoredItems.some((i) => i.id === item.id)
+        (item: Armor) => !ignoredItems.some(() => undefined)
     );
 
killedBy: Armor Optimizer Script dominated with ignored items
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 25

@@ -1,8 +1,33 @@
  Array [
    Object {

[Survived] ArithmeticOperator
src/app/armor/script.tsx:185:27
     );
 
     let sorted = [...itemList];
-    sorted.sort((a, b) => a.weight - b.weight);
+    sorted.sort((a, b) => a.weight + b.weight);
 
     let approved: Armor[] = [];

[Survived] MethodExpression
src/app/armor/script.tsx:185:5
     );
 
     let sorted = [...itemList];
-    sorted.sort((a, b) => a.weight - b.weight);
+    sorted;
 
     let approved: Armor[] = [];

[Killed] BlockStatement
src/app/armor/script.tsx:188:30
     sorted.sort((a, b) => a.weight - b.weight);
 
     let approved: Armor[] = [];
-    sorted.forEach((item) => {
-        if (
-            !approved.some(
-                (other) =>
-                    evaluateSortBy(sortBy, item!) <=
-                    evaluateSortBy(sortBy, other!)
-            )
-        ) {
-            approved.push(item);
-        }
-    });
+    sorted.forEach((item) => {});
 
     return approved;
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] BooleanLiteral
src/app/armor/script.tsx:190:13
     let approved: Armor[] = [];
     sorted.forEach((item) => {
         if (
-            !approved.some(
-                (other) =>
-                    evaluateSortBy(sortBy, item!) <=
-                    evaluateSortBy(sortBy, other!)
-            )
+            approved.some(other => evaluateSortBy(sortBy, item!) <= evaluateSortBy(sortBy, other!))
         ) {
             approved.push(item);
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] MethodExpression
src/app/armor/script.tsx:190:14
     let approved: Armor[] = [];
     sorted.forEach((item) => {
         if (
-            !approved.some(
-                (other) =>
-                    evaluateSortBy(sortBy, item!) <=
-                    evaluateSortBy(sortBy, other!)
-            )
+            !approved.every(other => evaluateSortBy(sortBy, item!) <= evaluateSortBy(sortBy, other!))
         ) {
             approved.push(item);
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Survived] ArrowFunction
src/app/armor/script.tsx:191:17
     sorted.forEach((item) => {
         if (
             !approved.some(
-                (other) =>
-                    evaluateSortBy(sortBy, item!) <=
-                    evaluateSortBy(sortBy, other!)
+                () => undefined
             )
         ) {

[Killed] ConditionalExpression
src/app/armor/script.tsx:192:21
         if (
             !approved.some(
                 (other) =>
-                    evaluateSortBy(sortBy, item!) <=
-                    evaluateSortBy(sortBy, other!)
+                    true
             )
         ) {
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] EqualityOperator
src/app/armor/script.tsx:192:21
         if (
             !approved.some(
                 (other) =>
-                    evaluateSortBy(sortBy, item!) <=
-                    evaluateSortBy(sortBy, other!)
+                    evaluateSortBy(sortBy, item!) > evaluateSortBy(sortBy, other!)
             )
         ) {
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] BlockStatement
src/app/armor/script.tsx:195:11
                     evaluateSortBy(sortBy, item!) <=
                     evaluateSortBy(sortBy, other!)
             )
-        ) {
-            approved.push(item);
-        }
+        ) {}
     });
 
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] ArithmeticOperator
src/app/armor/script.tsx:222:51
     sortBy: SortByArmor
 ): ArmorSet[] {
     // Convert max equip load to integer by multiplying by 10
-    const equipLoadBudgetInt: number = Math.floor(equipLoadBudget * 10);
+    const equipLoadBudgetInt: number = Math.floor(equipLoadBudget / 10);
 
     // Initialize Dynamic Programming table
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] ArithmeticOperator
src/app/armor/script.tsx:229:19
     const dp: ArmorSet[][] = Array(5)
         .fill(0)
         .map(() =>
-            Array(equipLoadBudgetInt + 1)
+            Array(equipLoadBudgetInt - 1)
                 .fill(null)
                 .map(() => {
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'fitness')

[Killed] ArrayDeclaration
src/app/armor/script.tsx:237:34
                 })
         );
 
-    const equipment: Armor[][] = [helmets, chestpieces, gauntlets, leggings];
+    const equipment: Armor[][] = [];
     // Fill dynamic programming table
     for (let i = 0; i < 4; i++) {
killedBy: Armor Page Renders
statusReason: TypeError: armorArr is not iterable

[Killed] ConditionalExpression
src/app/armor/script.tsx:239:21
 
     const equipment: Armor[][] = [helmets, chestpieces, gauntlets, leggings];
     // Fill dynamic programming table
-    for (let i = 0; i < 4; i++) {
+    for (let i = 0; false; i++) {
         const armorArr: Armor[] = equipment[i];
 
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] EqualityOperator
src/app/armor/script.tsx:239:21
 
     const equipment: Armor[][] = [helmets, chestpieces, gauntlets, leggings];
     // Fill dynamic programming table
-    for (let i = 0; i < 4; i++) {
+    for (let i = 0; i <= 4; i++) {
         const armorArr: Armor[] = equipment[i];
 
killedBy: Armor Page Renders
statusReason: TypeError: armorArr is not iterable

[Killed] ArithmeticOperator
src/app/armor/script.tsx:245:55
         for (const armor of armorArr) {
             // Convert piece weight to integer
             const armorWeight: number = armor.weight;
-            const armorWeightInt: number = Math.round(armorWeight * 10);
+            const armorWeightInt: number = Math.round(armorWeight / 10);
             const armorStat: number = evaluateSortBy(sortBy, armor!);
 
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 143
+ Received  +  39

@@ -127,11 +127,11 @@
          "scarlet-rot": 38,
          "sleep": 67,

[Killed] EqualityOperator
src/app/armor/script.tsx:250:17
 
             for (
                 let wInt = equipLoadBudgetInt;
-                wInt >= armorWeightInt;
+                wInt < armorWeightInt;
                 wInt--
             ) {
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'weight')

[Killed] ConditionalExpression
src/app/armor/script.tsx:250:17
 
             for (
                 let wInt = equipLoadBudgetInt;
-                wInt >= armorWeightInt;
+                false;
                 wInt--
             ) {
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] UpdateOperator
src/app/armor/script.tsx:251:17
             for (
                 let wInt = equipLoadBudgetInt;
                 wInt >= armorWeightInt;
-                wInt--
+                wInt++
             ) {
                 if (
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'weight')

[Killed] EqualityOperator
src/app/armor/script.tsx:254:21
                 wInt--
             ) {
                 if (
-                    dp[i][wInt - armorWeightInt].weight! + armorWeight <=
-                    equipLoadBudgetInt
+                    dp[i][wInt - armorWeightInt].weight! + armorWeight > equipLoadBudgetInt
                 ) {
                     const newFitness: number =
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] ArithmeticOperator
src/app/armor/script.tsx:254:27
                 wInt--
             ) {
                 if (
-                    dp[i][wInt - armorWeightInt].weight! + armorWeight <=
+                    dp[i][wInt + armorWeightInt].weight! + armorWeight <=
                     equipLoadBudgetInt
                 ) {
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'weight')

[Killed] ArithmeticOperator
src/app/armor/script.tsx:258:31
                     equipLoadBudgetInt
                 ) {
                     const newFitness: number =
-                        dp[i][wInt - armorWeightInt].fitness! + armorStat;
+                        dp[i][wInt + armorWeightInt].fitness! + armorStat;
                     if (newFitness > dp[i + 1][wInt].fitness!) {
                         // helmet
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'fitness')

[Killed] ArithmeticOperator
src/app/armor/script.tsx:258:25
                     equipLoadBudgetInt
                 ) {
                     const newFitness: number =
-                        dp[i][wInt - armorWeightInt].fitness! + armorStat;
+                        dp[i][wInt - armorWeightInt].fitness! - armorStat;
                     if (newFitness > dp[i + 1][wInt].fitness!) {
                         // helmet
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] ConditionalExpression
src/app/armor/script.tsx:259:25
                 ) {
                     const newFitness: number =
                         dp[i][wInt - armorWeightInt].fitness! + armorStat;
-                    if (newFitness > dp[i + 1][wInt].fitness!) {
+                    if (true) {
                         // helmet
                         dp[i + 1][wInt].helmet =
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 90
+ Received  + 90

@@ -23,11 +23,11 @@
          "scarlet-rot": 38,
          "sleep": 67,

[Killed] ArithmeticOperator
src/app/armor/script.tsx:259:41
                 ) {
                     const newFitness: number =
                         dp[i][wInt - armorWeightInt].fitness! + armorStat;
-                    if (newFitness > dp[i + 1][wInt].fitness!) {
+                    if (newFitness > dp[i - 1][wInt].fitness!) {
                         // helmet
                         dp[i + 1][wInt].helmet =
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading '210')

[Killed] ArithmeticOperator
src/app/armor/script.tsx:261:28
                         dp[i][wInt - armorWeightInt].fitness! + armorStat;
                     if (newFitness > dp[i + 1][wInt].fitness!) {
                         // helmet
-                        dp[i + 1][wInt].helmet =
+                        dp[i - 1][wInt].helmet =
                             i === 0
                                 ? armor
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading '210')

[Killed] EqualityOperator
src/app/armor/script.tsx:262:29
                     if (newFitness > dp[i + 1][wInt].fitness!) {
                         // helmet
                         dp[i + 1][wInt].helmet =
-                            i === 0
+                            i !== 0
                                 ? armor
                                 : dp[i][wInt - armorWeightInt].helmet ??
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 88
+ Received  + 88

@@ -51,32 +51,32 @@
        },
        "weight": 3.5,

[Killed] ConditionalExpression
src/app/armor/script.tsx:262:29
                     if (newFitness > dp[i + 1][wInt].fitness!) {
                         // helmet
                         dp[i + 1][wInt].helmet =
-                            i === 0
+                            true
                                 ? armor
                                 : dp[i][wInt - armorWeightInt].helmet ??
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 88
+ Received  + 88

@@ -51,32 +51,32 @@
        },
        "weight": 3.5,

[Killed] ArithmeticOperator
src/app/armor/script.tsx:264:41
                         dp[i + 1][wInt].helmet =
                             i === 0
                                 ? armor
-                                : dp[i][wInt - armorWeightInt].helmet ??
+                                : dp[i][wInt + armorWeightInt].helmet ??
                                   HELMETS[0];
                         // chestpiece
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'helmet')

[Killed] LogicalOperator
src/app/armor/script.tsx:264:35
                         dp[i + 1][wInt].helmet =
                             i === 0
                                 ? armor
-                                : dp[i][wInt - armorWeightInt].helmet ??
-                                  HELMETS[0];
+                                : dp[i][wInt - armorWeightInt].helmet && HELMETS[0];
                         // chestpiece
                         dp[i + 1][wInt].chestpiece =
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 67
+ Received  + 43

@@ -51,32 +51,32 @@
        },
        "weight": 3.5,

[Killed] ArithmeticOperator
src/app/armor/script.tsx:267:28
                                 : dp[i][wInt - armorWeightInt].helmet ??
                                   HELMETS[0];
                         // chestpiece
-                        dp[i + 1][wInt].chestpiece =
+                        dp[i - 1][wInt].chestpiece =
                             i === 1
                                 ? armor
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading '210')

[Killed] EqualityOperator
src/app/armor/script.tsx:268:29
                                   HELMETS[0];
                         // chestpiece
                         dp[i + 1][wInt].chestpiece =
-                            i === 1
+                            i !== 1
                                 ? armor
                                 : dp[i][wInt - armorWeightInt].chestpiece ??
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 57
+ Received  + 57

@@ -1,31 +1,31 @@
  Array [
    Object {

[Killed] ConditionalExpression
src/app/armor/script.tsx:268:29
                                   HELMETS[0];
                         // chestpiece
                         dp[i + 1][wInt].chestpiece =
-                            i === 1
+                            false
                                 ? armor
                                 : dp[i][wInt - armorWeightInt].chestpiece ??
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 57
+ Received  + 57

@@ -1,31 +1,31 @@
  Array [
    Object {

[Killed] LogicalOperator
src/app/armor/script.tsx:270:35
                         dp[i + 1][wInt].chestpiece =
                             i === 1
                                 ? armor
-                                : dp[i][wInt - armorWeightInt].chestpiece ??
-                                  CHESTPIECES[0];
+                                : dp[i][wInt - armorWeightInt].chestpiece && CHESTPIECES[0];
                         // gauntlets
                         dp[i + 1][wInt].gauntlets =
killedBy: Armor Page updates locked armor
statusReason: TypeError: Cannot read properties of undefined (reading 'weight')

[Killed] ArithmeticOperator
src/app/armor/script.tsx:270:41
                         dp[i + 1][wInt].chestpiece =
                             i === 1
                                 ? armor
-                                : dp[i][wInt - armorWeightInt].chestpiece ??
+                                : dp[i][wInt + armorWeightInt].chestpiece ??
                                   CHESTPIECES[0];
                         // gauntlets
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'chestpiece')

[Killed] ArithmeticOperator
src/app/armor/script.tsx:273:28
                                 : dp[i][wInt - armorWeightInt].chestpiece ??
                                   CHESTPIECES[0];
                         // gauntlets
-                        dp[i + 1][wInt].gauntlets =
+                        dp[i - 1][wInt].gauntlets =
                             i === 2
                                 ? armor
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading '210')

[Killed] EqualityOperator
src/app/armor/script.tsx:274:29
                                   CHESTPIECES[0];
                         // gauntlets
                         dp[i + 1][wInt].gauntlets =
-                            i === 2
+                            i !== 2
                                 ? armor
                                 : dp[i][wInt - armorWeightInt].gauntlets ??
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 57
+ Received  + 57

@@ -26,32 +26,32 @@
        "weight": 4.1,
      },

[Killed] ConditionalExpression
src/app/armor/script.tsx:274:29
                                   CHESTPIECES[0];
                         // gauntlets
                         dp[i + 1][wInt].gauntlets =
-                            i === 2
+                            true
                                 ? armor
                                 : dp[i][wInt - armorWeightInt].gauntlets ??
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 57
+ Received  + 57

@@ -26,32 +26,32 @@
        "weight": 4.1,
      },

[Killed] ArithmeticOperator
src/app/armor/script.tsx:276:41
                         dp[i + 1][wInt].gauntlets =
                             i === 2
                                 ? armor
-                                : dp[i][wInt - armorWeightInt].gauntlets ??
+                                : dp[i][wInt + armorWeightInt].gauntlets ??
                                   GAUNTLETS[0];
                         // leggings
killedBy: Armor Optimizer Script knapsack
statusReason: TypeError: Cannot read properties of undefined (reading 'gauntlets')

[Killed] LogicalOperator
src/app/armor/script.tsx:276:35
                         dp[i + 1][wInt].gauntlets =
                             i === 2
                                 ? armor
-                                : dp[i][wInt - armorWeightInt].gauntlets ??
-                                  GAUNTLETS[0];
+                                : dp[i][wInt - armorWeightInt].gauntlets && GAUNTLETS[0];
                         // leggings
                         dp[i + 1][wInt].leggings =
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 57
+ Received  + 57

@@ -26,32 +26,32 @@
        "weight": 4.1,
      },

[Killed] ArithmeticOperator
src/app/armor/script.tsx:279:28
                                 : dp[i][wInt - armorWeightInt].gauntlets ??
                                   GAUNTLETS[0];
                         // leggings
-                        dp[i + 1][wInt].leggings =
+                        dp[i - 1][wInt].leggings =
                             i === 3
                                 ? armor
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading '210')

[Killed] EqualityOperator
src/app/armor/script.tsx:280:29
                                   GAUNTLETS[0];
                         // leggings
                         dp[i + 1][wInt].leggings =
-                            i === 3
+                            i !== 3
                                 ? armor
                                 : dp[i][wInt - armorWeightInt].leggings ??
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 57
+ Received  + 57

@@ -76,32 +76,32 @@
        },
        "weight": 1.7,

[Killed] ConditionalExpression
src/app/armor/script.tsx:280:29
                                   GAUNTLETS[0];
                         // leggings
                         dp[i + 1][wInt].leggings =
-                            i === 3
+                            false
                                 ? armor
                                 : dp[i][wInt - armorWeightInt].leggings ??
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 57
+ Received  + 57

@@ -76,32 +76,32 @@
        },
        "weight": 1.7,

[Killed] ArithmeticOperator
src/app/armor/script.tsx:282:41
                         dp[i + 1][wInt].leggings =
                             i === 3
                                 ? armor
-                                : dp[i][wInt - armorWeightInt].leggings ??
+                                : dp[i][wInt + armorWeightInt].leggings ??
                                   LEGGINGS[0];
                         // fitness
killedBy: Armor Optimizer Script knapsack
statusReason: TypeError: Cannot read properties of undefined (reading 'leggings')

[Survived] LogicalOperator
src/app/armor/script.tsx:282:35
                         dp[i + 1][wInt].leggings =
                             i === 3
                                 ? armor
-                                : dp[i][wInt - armorWeightInt].leggings ??
-                                  LEGGINGS[0];
+                                : dp[i][wInt - armorWeightInt].leggings && LEGGINGS[0];
                         // fitness
                         dp[i + 1][wInt].fitness = newFitness;

[Killed] ArithmeticOperator
src/app/armor/script.tsx:285:28
                                 : dp[i][wInt - armorWeightInt].leggings ??
                                   LEGGINGS[0];
                         // fitness
-                        dp[i + 1][wInt].fitness = newFitness;
+                        dp[i - 1][wInt].fitness = newFitness;
                         // weight
                         dp[i + 1][wInt].weight =
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading '210')

[Killed] ArithmeticOperator
src/app/armor/script.tsx:287:28
                         // fitness
                         dp[i + 1][wInt].fitness = newFitness;
                         // weight
-                        dp[i + 1][wInt].weight =
+                        dp[i - 1][wInt].weight =
                             dp[i][wInt - armorWeightInt].weight! + armorWeight;
                     }
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading '210')

[Killed] ArithmeticOperator
src/app/armor/script.tsx:288:35
                         dp[i + 1][wInt].fitness = newFitness;
                         // weight
                         dp[i + 1][wInt].weight =
-                            dp[i][wInt - armorWeightInt].weight! + armorWeight;
+                            dp[i][wInt + armorWeightInt].weight! + armorWeight;
                     }
                 }
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'weight')

[Killed] ArithmeticOperator
src/app/armor/script.tsx:288:29
                         dp[i + 1][wInt].fitness = newFitness;
                         // weight
                         dp[i + 1][wInt].weight =
-                            dp[i][wInt - armorWeightInt].weight! + armorWeight;
+                            dp[i][wInt - armorWeightInt].weight! - armorWeight;
                     }
                 }
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

@@ -99,11 +99,11 @@
          "scarlet-rot": 17,
          "sleep": 13,
