[Killed] UpdateOperator
src/app/armor/script.tsx:295:50
         }
 
         // Carry forward the best set from the previous category without adding a new piece
-        for (let w = 0; w <= equipLoadBudgetInt; w++) {
+        for (let w = 0; w <= equipLoadBudgetInt; w--) {
             if (dp[i + 1][w].fitness! < dp[i][w].fitness!) {
                 dp[i + 1][w] = dp[i][w];
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'fitness')

[Survived] EqualityOperator
src/app/armor/script.tsx:295:25
         }
 
         // Carry forward the best set from the previous category without adding a new piece
-        for (let w = 0; w <= equipLoadBudgetInt; w++) {
+        for (let w = 0; w < equipLoadBudgetInt; w++) {
             if (dp[i + 1][w].fitness! < dp[i][w].fitness!) {
                 dp[i + 1][w] = dp[i][w];

[Killed] EqualityOperator
src/app/armor/script.tsx:296:17
 
         // Carry forward the best set from the previous category without adding a new piece
         for (let w = 0; w <= equipLoadBudgetInt; w++) {
-            if (dp[i + 1][w].fitness! < dp[i][w].fitness!) {
+            if (dp[i + 1][w].fitness! >= dp[i][w].fitness!) {
                 dp[i + 1][w] = dp[i][w];
             }
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] ArithmeticOperator
src/app/armor/script.tsx:296:20
 
         // Carry forward the best set from the previous category without adding a new piece
         for (let w = 0; w <= equipLoadBudgetInt; w++) {
-            if (dp[i + 1][w].fitness! < dp[i][w].fitness!) {
+            if (dp[i - 1][w].fitness! < dp[i][w].fitness!) {
                 dp[i + 1][w] = dp[i][w];
             }
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] ArithmeticOperator
src/app/armor/script.tsx:297:20
         // Carry forward the best set from the previous category without adding a new piece
         for (let w = 0; w <= equipLoadBudgetInt; w++) {
             if (dp[i + 1][w].fitness! < dp[i][w].fitness!) {
-                dp[i + 1][w] = dp[i][w];
+                dp[i - 1][w] = dp[i][w];
             }
         }

[Killed] EqualityOperator
src/app/armor/script.tsx:304:41
 
     // Extract top 3 sets
     const topSets: ArmorSet[] = [];
-    for (let wInt = equipLoadBudgetInt; wInt >= 0; wInt--) {
+    for (let wInt = equipLoadBudgetInt; wInt < 0; wInt--) {
         if (dp[4][wInt].fitness! > 0) {
             let duplicate = false;
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] UpdateOperator
src/app/armor/script.tsx:304:52
 
     // Extract top 3 sets
     const topSets: ArmorSet[] = [];
-    for (let wInt = equipLoadBudgetInt; wInt >= 0; wInt--) {
+    for (let wInt = equipLoadBudgetInt; wInt >= 0; wInt++) {
         if (dp[4][wInt].fitness! > 0) {
             let duplicate = false;
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'fitness')

[Killed] EqualityOperator
src/app/armor/script.tsx:305:13
     // Extract top 3 sets
     const topSets: ArmorSet[] = [];
     for (let wInt = equipLoadBudgetInt; wInt >= 0; wInt--) {
-        if (dp[4][wInt].fitness! > 0) {
+        if (dp[4][wInt].fitness! <= 0) {
             let duplicate = false;
             for (const set of topSets) {
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'weight')

[Killed] ConditionalExpression
src/app/armor/script.tsx:305:13
     // Extract top 3 sets
     const topSets: ArmorSet[] = [];
     for (let wInt = equipLoadBudgetInt; wInt >= 0; wInt--) {
-        if (dp[4][wInt].fitness! > 0) {
+        if (true) {
             let duplicate = false;
             for (const set of topSets) {
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'weight')

[Killed] BooleanLiteral
src/app/armor/script.tsx:306:29
     const topSets: ArmorSet[] = [];
     for (let wInt = equipLoadBudgetInt; wInt >= 0; wInt--) {
         if (dp[4][wInt].fitness! > 0) {
-            let duplicate = false;
+            let duplicate = true;
             for (const set of topSets) {
                 if (
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] BlockStatement
src/app/armor/script.tsx:307:40
     for (let wInt = equipLoadBudgetInt; wInt >= 0; wInt--) {
         if (dp[4][wInt].fitness! > 0) {
             let duplicate = false;
-            for (const set of topSets) {
-                if (
-                    dp[4][wInt].helmet === set.helmet &&
-                    dp[4][wInt].chestpiece === set.chestpiece &&
-                    dp[4][wInt].gauntlets === set.gauntlets &&
-                    dp[4][wInt].leggings === set.leggings
-                ) {
-                    duplicate = true;
-                    break;
-                }
-            }
+            for (const set of topSets) {}
             if (duplicate) continue;
             topSets.push(dp[4][wInt]);
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 42
+ Received  + 42

@@ -127,11 +127,11 @@
          "scarlet-rot": 38,
          "sleep": 67,

[Killed] ConditionalExpression
src/app/armor/script.tsx:309:21
             let duplicate = false;
             for (const set of topSets) {
                 if (
-                    dp[4][wInt].helmet === set.helmet &&
-                    dp[4][wInt].chestpiece === set.chestpiece &&
-                    dp[4][wInt].gauntlets === set.gauntlets &&
-                    dp[4][wInt].leggings === set.leggings
+                    true
                 ) {
                     duplicate = true;
killedBy: Armor Page ignores single armor using keyboard
statusReason: TypeError: Cannot read properties of undefined (reading 'helmet')

[Killed] ConditionalExpression
src/app/armor/script.tsx:309:21
             let duplicate = false;
             for (const set of topSets) {
                 if (
-                    dp[4][wInt].helmet === set.helmet &&
-                    dp[4][wInt].chestpiece === set.chestpiece &&
-                    dp[4][wInt].gauntlets === set.gauntlets &&
+                    true &&
                     dp[4][wInt].leggings === set.leggings
                 ) {
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 88
+ Received  + 88

@@ -127,11 +127,11 @@
          "scarlet-rot": 38,
          "sleep": 67,

[Killed] EqualityOperator
src/app/armor/script.tsx:310:21
             for (const set of topSets) {
                 if (
                     dp[4][wInt].helmet === set.helmet &&
-                    dp[4][wInt].chestpiece === set.chestpiece &&
+                    dp[4][wInt].chestpiece !== set.chestpiece &&
                     dp[4][wInt].gauntlets === set.gauntlets &&
                     dp[4][wInt].leggings === set.leggings
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 42
+ Received  + 42

@@ -127,11 +127,11 @@
          "scarlet-rot": 38,
          "sleep": 67,

[Survived] ConditionalExpression
src/app/armor/script.tsx:310:21
             for (const set of topSets) {
                 if (
                     dp[4][wInt].helmet === set.helmet &&
-                    dp[4][wInt].chestpiece === set.chestpiece &&
+                    true &&
                     dp[4][wInt].gauntlets === set.gauntlets &&
                     dp[4][wInt].leggings === set.leggings

[Killed] EqualityOperator
src/app/armor/script.tsx:311:21
                 if (
                     dp[4][wInt].helmet === set.helmet &&
                     dp[4][wInt].chestpiece === set.chestpiece &&
-                    dp[4][wInt].gauntlets === set.gauntlets &&
+                    dp[4][wInt].gauntlets !== set.gauntlets &&
                     dp[4][wInt].leggings === set.leggings
                 ) {
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 42
+ Received  + 42

@@ -127,11 +127,11 @@
          "scarlet-rot": 38,
          "sleep": 67,

[Survived] ConditionalExpression
src/app/armor/script.tsx:311:21
                 if (
                     dp[4][wInt].helmet === set.helmet &&
                     dp[4][wInt].chestpiece === set.chestpiece &&
-                    dp[4][wInt].gauntlets === set.gauntlets &&
+                    true &&
                     dp[4][wInt].leggings === set.leggings
                 ) {

[Killed] EqualityOperator
src/app/armor/script.tsx:312:21
                     dp[4][wInt].helmet === set.helmet &&
                     dp[4][wInt].chestpiece === set.chestpiece &&
                     dp[4][wInt].gauntlets === set.gauntlets &&
-                    dp[4][wInt].leggings === set.leggings
+                    dp[4][wInt].leggings !== set.leggings
                 ) {
                     duplicate = true;
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 42
+ Received  + 42

@@ -127,11 +127,11 @@
          "scarlet-rot": 38,
          "sleep": 67,

[Survived] ConditionalExpression
src/app/armor/script.tsx:312:21
                     dp[4][wInt].helmet === set.helmet &&
                     dp[4][wInt].chestpiece === set.chestpiece &&
                     dp[4][wInt].gauntlets === set.gauntlets &&
-                    dp[4][wInt].leggings === set.leggings
+                    true
                 ) {
                     duplicate = true;

[Killed] BlockStatement
src/app/armor/script.tsx:313:19
                     dp[4][wInt].chestpiece === set.chestpiece &&
                     dp[4][wInt].gauntlets === set.gauntlets &&
                     dp[4][wInt].leggings === set.leggings
-                ) {
-                    duplicate = true;
-                    break;
-                }
+                ) {}
             }
             if (duplicate) continue;
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 42
+ Received  + 42

@@ -127,11 +127,11 @@
          "scarlet-rot": 38,
          "sleep": 67,

[Killed] BooleanLiteral
src/app/armor/script.tsx:314:33
                     dp[4][wInt].gauntlets === set.gauntlets &&
                     dp[4][wInt].leggings === set.leggings
                 ) {
-                    duplicate = true;
+                    duplicate = false;
                     break;
                 }
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 42
+ Received  + 42

@@ -127,11 +127,11 @@
          "scarlet-rot": 38,
          "sleep": 67,

[Killed] ConditionalExpression
src/app/armor/script.tsx:318:17
                     break;
                 }
             }
-            if (duplicate) continue;
+            if (false) continue;
             topSets.push(dp[4][wInt]);
             if (topSets.length === 3) break;
killedBy: Armor Optimizer Script knapsack
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 42
+ Received  + 42

@@ -127,11 +127,11 @@
          "scarlet-rot": 38,
          "sleep": 67,

[Killed] ConditionalExpression
src/app/armor/script.tsx:318:17
                     break;
                 }
             }
-            if (duplicate) continue;
+            if (true) continue;
             topSets.push(dp[4][wInt]);
             if (topSets.length === 3) break;
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] ConditionalExpression
src/app/armor/script.tsx:320:17
             }
             if (duplicate) continue;
             topSets.push(dp[4][wInt]);
-            if (topSets.length === 3) break;
+            if (true) break;
         }
     }
killedBy: Armor Page ignores single armor using keyboard
statusReason: TypeError: Cannot read properties of undefined (reading 'helmet')

[Killed] ConditionalExpression
src/app/armor/script.tsx:320:17
             }
             if (duplicate) continue;
             topSets.push(dp[4][wInt]);
-            if (topSets.length === 3) break;
+            if (false) break;
         }
     }
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading '0')
