[Survived] StringLiteral
armor/components/armorResult/ArmorResultRow.tsx:15:52
                 <a
                     href={
                         "https://eldenring.wiki.fextralife.com/" +
-                        props.name.replaceAll(" ", "+")
+                        props.name.replaceAll(" ", "")
                     }
                     target="_blank"

[Survived] StringLiteral
armor/components/armorResult/ArmorResultRow.tsx:19:41
                     }
                     target="_blank"
                     rel="noopener noreferrer"
-                    style={{ minHeight: "24px", minWidth: "24px" }}
+                    style={{ minHeight: "", minWidth: "24px" }}
                 >
                     {props.name}

[Killed] ArrowFunction
armor/components/armorResult/ArmorResultRow.tsx:25:30
                 </a>
                 <button
                     name="ignore-button"
-                    onClick={() => props.addIgnoredItem(props.armorId)}
+                    onClick={() => undefined}
                     // add hint on hover
                     title={"Ignore this armor (CTRL+i+" + props.hotkey + ")"}
killedBy: Armor Page ignores/restores single armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] StringLiteral
armor/components/armorResult/ArmorResultRow.tsx:27:74
                     name="ignore-button"
                     onClick={() => props.addIgnoredItem(props.armorId)}
                     // add hint on hover
-                    title={"Ignore this armor (CTRL+i+" + props.hotkey + ")"}
+                    title={"Ignore this armor (CTRL+i+" + props.hotkey + ""}
                     style={{
                         marginLeft: "5px",

[Survived] StringLiteral
armor/components/armorResult/ArmorResultRow.tsx:27:28
                     name="ignore-button"
                     onClick={() => props.addIgnoredItem(props.armorId)}
                     // add hint on hover
-                    title={"Ignore this armor (CTRL+i+" + props.hotkey + ")"}
+                    title={"" + props.hotkey + ")"}
                     style={{
                         marginLeft: "5px",

[Survived] ObjectLiteral
armor/components/armorResult/ArmorResultRow.tsx:28:28
                     onClick={() => props.addIgnoredItem(props.armorId)}
                     // add hint on hover
                     title={"Ignore this armor (CTRL+i+" + props.hotkey + ")"}
-                    style={{
-                        marginLeft: "5px",
-                        backgroundColor: "transparent",
-                        border: "none",
-                        minWidth: "24px",
-                        minHeight: "24px",
-                    }}
+                    style={{}}
                 >
                     {" "}

[Survived] StringLiteral
armor/components/armorResult/ArmorResultRow.tsx:29:37
                     // add hint on hover
                     title={"Ignore this armor (CTRL+i+" + props.hotkey + ")"}
                     style={{
-                        marginLeft: "5px",
+                        marginLeft: "",
                         backgroundColor: "transparent",
                         border: "none",

[Survived] StringLiteral
armor/components/armorResult/ArmorResultRow.tsx:36:22
                         minHeight: "24px",
                     }}
                 >
-                    {" "}
+                    {""}
                     ❌
                 </button>
