[Killed] BooleanLiteral
armor/components/customSortBy/CustomizeSortBy.tsx:11:27
     sortBy: SortByArmor;
 }) {
     const [descriptionIsExpanded, setDescriptionIsExpanded] =
-        useState<boolean>(true);
+        useState<boolean>(false);
 
     const submitFormula = () => {
killedBy: CustomizeSortBy Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'innerHTML')

[Killed] BlockStatement
armor/components/customSortBy/CustomizeSortBy.tsx:13:33
     const [descriptionIsExpanded, setDescriptionIsExpanded] =
         useState<boolean>(true);
 
-    const submitFormula = () => {
-        let submittedSortBy: SortByArmor;
-        try {
-            const formula = (
-                document.getElementById("formula") as HTMLTextAreaElement
-            ).value;
-            submittedSortBy = unmarshallSortBy(formula);
-        } catch (error) {
-            console.error("error: ", error);
-            return;
-        }
-        submittedSortBy.label = "Custom";
-        props.setCustomSortBy(submittedSortBy);
-        props.closePopUp();
-    };
+    const submitFormula = () => {};
 
     const cancelFormula = () => {
killedBy: CustomizeSortBy submits formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "setCustomSortBy",
-   "closePopUp",

[Killed] BlockStatement
armor/components/customSortBy/CustomizeSortBy.tsx:29:33
         props.closePopUp();
     };
 
-    const cancelFormula = () => {
-        props.closePopUp();
-    };
+    const cancelFormula = () => {};
 
     return (
killedBy: Armor Page opens and closes the customize sort modal
statusReason: Error: expect(received).toBeNull()

Received: <h2>Custom Sort</h2>

[Survived] ObjectLiteral
armor/components/customSortBy/CustomizeSortBy.tsx:35:20
 
     return (
         <div
-            style={{
-                position: "fixed",
-                flex: "1 1 100%",
-                inset: 100,
-                padding: "10px",
-                backgroundColor: "var(--primary)",
-                border: "1px solid #ccc",
-                borderRadius: "5px",
-                boxShadow: "0 4px 8px rgba(0, 0, 0, 0.1)",
-                zIndex: 1000,
-                overflow: "auto",
-            }}
+            style={{}}
         >
             <div>

[Survived] StringLiteral
armor/components/customSortBy/CustomizeSortBy.tsx:37:23
         <div
             style={{
                 position: "fixed",
-                flex: "1 1 100%",
+                flex: "",
                 inset: 100,
                 padding: "10px",

[Survived] StringLiteral
armor/components/customSortBy/CustomizeSortBy.tsx:39:26
                 position: "fixed",
                 flex: "1 1 100%",
                 inset: 100,
-                padding: "10px",
+                padding: "",
                 backgroundColor: "var(--primary)",
                 border: "1px solid #ccc",

[Killed] ArrowFunction
armor/components/customSortBy/CustomizeSortBy.tsx:60:34
                 <div>
                     <button
                         id="descriptionToggle"
-                        onClick={() =>
-                            setDescriptionIsExpanded(!descriptionIsExpanded)
+                        onClick={() => undefined
                         }
                     >
killedBy: CustomizeSortBy toggles description
statusReason: Error: expect(element).not.toBeVisible()

Received element is visible:
  <div id="description" style="visibility: visible;" />

[Killed] BooleanLiteral
armor/components/customSortBy/CustomizeSortBy.tsx:61:54
                     <button
                         id="descriptionToggle"
                         onClick={() =>
-                            setDescriptionIsExpanded(!descriptionIsExpanded)
+                            setDescriptionIsExpanded(descriptionIsExpanded)
                         }
                     >
killedBy: CustomizeSortBy toggles description
statusReason: Error: expect(element).not.toBeVisible()

Received element is visible:
  <div id="description" style="visibility: visible;" />

[Survived] StringLiteral
armor/components/customSortBy/CustomizeSortBy.tsx:66:31
                     >
                         {descriptionIsExpanded
                             ? "Hide Description"
-                            : "Show Description"}
+                            : ""}
                     </button>
                     <div
