[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:16:49
     | ResistancesMapKey
     | "poise";
 export const SORTBYARMOR_MODES: { [K in SortByArmorModeKey]: SortByArmor } = {
-    total: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Total of All Absorptions and Resistances" },
-        { operation: "sum" },
-        { physical: true },
-        { strike: true },
-        { slash: true },
-        { pierce: true },
-        { magic: true },
-        { fire: true },
-        { lightning: true },
-        { holy: true },
-        { poison: true },
-        { "scarlet-rot": true },
-        { hemorrhage: true },
-        { frostbite: true },
-        { sleep: true },
-        { madness: true },
-        { "death-blight": true },
-    ]),
+    total: deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "total-absorption": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Total of All Absorptions" },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:19:21
     total: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Total of All Absorptions and Resistances" },
         { operation: "sum" },
-        { physical: true },
+        { physical: false },
         { strike: true },
         { slash: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:20:19
         { label: "Total of All Absorptions and Resistances" },
         { operation: "sum" },
         { physical: true },
-        { strike: true },
+        { strike: false },
         { slash: true },
         { pierce: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:21:18
         { operation: "sum" },
         { physical: true },
         { strike: true },
-        { slash: true },
+        { slash: false },
         { pierce: true },
         { magic: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:21:9
         { operation: "sum" },
         { physical: true },
         { strike: true },
-        { slash: true },
+        {},
         { pierce: true },
         { magic: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:22:19
         { physical: true },
         { strike: true },
         { slash: true },
-        { pierce: true },
+        { pierce: false },
         { magic: true },
         { fire: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:22:9
         { physical: true },
         { strike: true },
         { slash: true },
-        { pierce: true },
+        {},
         { magic: true },
         { fire: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:23:18
         { strike: true },
         { slash: true },
         { pierce: true },
-        { magic: true },
+        { magic: false },
         { fire: true },
         { lightning: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:24:17
         { slash: true },
         { pierce: true },
         { magic: true },
-        { fire: true },
+        { fire: false },
         { lightning: true },
         { holy: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:25:22
         { pierce: true },
         { magic: true },
         { fire: true },
-        { lightning: true },
+        { lightning: false },
         { holy: true },
         { poison: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:26:17
         { magic: true },
         { fire: true },
         { lightning: true },
-        { holy: true },
+        { holy: false },
         { poison: true },
         { "scarlet-rot": true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:27:19
         { fire: true },
         { lightning: true },
         { holy: true },
-        { poison: true },
+        { poison: false },
         { "scarlet-rot": true },
         { hemorrhage: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:27:9
         { fire: true },
         { lightning: true },
         { holy: true },
-        { poison: true },
+        {},
         { "scarlet-rot": true },
         { hemorrhage: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:28:26
         { lightning: true },
         { holy: true },
         { poison: true },
-        { "scarlet-rot": true },
+        { "scarlet-rot": false },
         { hemorrhage: true },
         { frostbite: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:28:9
         { lightning: true },
         { holy: true },
         { poison: true },
-        { "scarlet-rot": true },
+        {},
         { hemorrhage: true },
         { frostbite: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:29:23
         { holy: true },
         { poison: true },
         { "scarlet-rot": true },
-        { hemorrhage: true },
+        { hemorrhage: false },
         { frostbite: true },
         { sleep: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:29:9
         { holy: true },
         { poison: true },
         { "scarlet-rot": true },
-        { hemorrhage: true },
+        {},
         { frostbite: true },
         { sleep: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:30:22
         { poison: true },
         { "scarlet-rot": true },
         { hemorrhage: true },
-        { frostbite: true },
+        { frostbite: false },
         { sleep: true },
         { madness: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:30:9
         { poison: true },
         { "scarlet-rot": true },
         { hemorrhage: true },
-        { frostbite: true },
+        {},
         { sleep: true },
         { madness: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:31:18
         { "scarlet-rot": true },
         { hemorrhage: true },
         { frostbite: true },
-        { sleep: true },
+        { sleep: false },
         { madness: true },
         { "death-blight": true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:32:20
         { hemorrhage: true },
         { frostbite: true },
         { sleep: true },
-        { madness: true },
+        { madness: false },
         { "death-blight": true },
     ]),

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:32:9
         { hemorrhage: true },
         { frostbite: true },
         { sleep: true },
-        { madness: true },
+        {},
         { "death-blight": true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:33:27
         { frostbite: true },
         { sleep: true },
         { madness: true },
-        { "death-blight": true },
+        { "death-blight": false },
     ]),
     "total-absorption": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:33:9
         { frostbite: true },
         { sleep: true },
         { madness: true },
-        { "death-blight": true },
+        {},
     ]),
     "total-absorption": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:36:18
         { "death-blight": true },
     ]),
     "total-absorption": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Total of All Absorptions" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:38:9
     "total-absorption": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Total of All Absorptions" },
         { operation: "sum" },
-        { physical: true },
+        {},
         { strike: true },
         { slash: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:39:9
         { label: "Total of All Absorptions" },
         { operation: "sum" },
         { physical: true },
-        { strike: true },
+        {},
         { slash: true },
         { pierce: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:43:9
         { slash: true },
         { pierce: true },
         { magic: true },
-        { fire: true },
+        {},
         { lightning: true },
         { holy: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:55:52
         { slash: true },
         { pierce: true },
     ]),
-    physical: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Physical Absorption" },
-        { physical: true },
-    ]),
+    physical: deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     strike: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Strike Absorption" },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:57:21
     ]),
     physical: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Physical Absorption" },
-        { physical: true },
+        { physical: false },
     ]),
     strike: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:57:9
     ]),
     physical: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Physical Absorption" },
-        { physical: true },
+        {},
     ]),
     strike: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:60:9
         { physical: true },
     ]),
     strike: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Strike Absorption" },
+        {},
         { strike: true },
     ]),

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:60:18
         { physical: true },
     ]),
     strike: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Strike Absorption" },
+        { label: "" },
         { strike: true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:61:19
     ]),
     strike: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Strike Absorption" },
-        { strike: true },
+        { strike: false },
     ]),
     slash: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:61:9
     ]),
     strike: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Strike Absorption" },
-        { strike: true },
+        {},
     ]),
     slash: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:65:18
     ]),
     slash: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Slash Absorption" },
-        { slash: true },
+        { slash: false },
     ]),
     pierce: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:67:50
         { label: "Slash Absorption" },
         { slash: true },
     ]),
-    pierce: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Pierce Absorption" },
-        { pierce: true },
-    ]),
+    pierce: deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "total-elemental": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Total of All Elemental Absorptions" },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:69:19
     ]),
     pierce: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Pierce Absorption" },
-        { pierce: true },
+        { pierce: false },
     ]),
     "total-elemental": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:74:18
     "total-elemental": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Total of All Elemental Absorptions" },
         { operation: "sum" },
-        { magic: true },
+        { magic: false },
         { fire: true },
         { lightning: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:79:49
         { lightning: true },
         { holy: true },
     ]),
-    magic: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Magic Absorption" },
-        { magic: true },
-    ]),
+    magic: deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     fire: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Fire Absorption" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:80:9
         { holy: true },
     ]),
     magic: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Magic Absorption" },
+        {},
         { magic: true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:81:18
     ]),
     magic: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Magic Absorption" },
-        { magic: true },
+        { magic: false },
     ]),
     fire: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:83:48
         { label: "Magic Absorption" },
         { magic: true },
     ]),
-    fire: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Fire Absorption" },
-        { fire: true },
-    ]),
+    fire: deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     lightning: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Lightning Absorption" },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:85:17
     ]),
     fire: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Fire Absorption" },
-        { fire: true },
+        { fire: false },
     ]),
     lightning: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:85:9
     ]),
     fire: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Fire Absorption" },
-        { fire: true },
+        {},
     ]),
     lightning: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:88:18
         { fire: true },
     ]),
     lightning: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Lightning Absorption" },
+        { label: "" },
         { lightning: true },
     ]),

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:88:9
         { fire: true },
     ]),
     lightning: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Lightning Absorption" },
+        {},
         { lightning: true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:89:22
     ]),
     lightning: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Lightning Absorption" },
-        { lightning: true },
+        { lightning: false },
     ]),
     holy: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:91:48
         { label: "Lightning Absorption" },
         { lightning: true },
     ]),
-    holy: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Holy Absorption" },
-        { holy: true },
-    ]),
+    holy: deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "total-resistance": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Total of All Resistances" },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:93:17
     ]),
     holy: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Holy Absorption" },
-        { holy: true },
+        { holy: false },
     ]),
     "total-resistance": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:96:18
         { holy: true },
     ]),
     "total-resistance": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Total of All Resistances" },
+        { label: "" },
         { operation: "sum" },
         { poison: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:98:19
     "total-resistance": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Total of All Resistances" },
         { operation: "sum" },
-        { poison: true },
+        { poison: false },
         { "scarlet-rot": true },
         { hemorrhage: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:98:9
     "total-resistance": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Total of All Resistances" },
         { operation: "sum" },
-        { poison: true },
+        {},
         { "scarlet-rot": true },
         { hemorrhage: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:102:9
         { "scarlet-rot": true },
         { hemorrhage: true },
         { frostbite: true },
-        { sleep: true },
+        {},
         { madness: true },
         { "death-blight": true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:108:19
     ]),
     poison: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Poison Resistance" },
-        { poison: true },
+        { poison: false },
     ]),
     "scarlet-rot": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:112:26
     ]),
     "scarlet-rot": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Scarlet Rot Resistance" },
-        { "scarlet-rot": true },
+        { "scarlet-rot": false },
     ]),
     hemorrhage: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:115:9
         { "scarlet-rot": true },
     ]),
     hemorrhage: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Hemorrhage Resistance" },
+        {},
         { hemorrhage: true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:116:23
     ]),
     hemorrhage: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Hemorrhage Resistance" },
-        { hemorrhage: true },
+        { hemorrhage: false },
     ]),
     frostbite: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:119:18
         { hemorrhage: true },
     ]),
     frostbite: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Frostbite Resistance" },
+        { label: "" },
         { frostbite: true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:120:22
     ]),
     frostbite: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Frostbite Resistance" },
-        { frostbite: true },
+        { frostbite: false },
     ]),
     sleep: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:120:9
     ]),
     frostbite: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Frostbite Resistance" },
-        { frostbite: true },
+        {},
     ]),
     sleep: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:123:9
         { frostbite: true },
     ]),
     sleep: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Sleep Resistance" },
+        {},
         { sleep: true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:124:18
     ]),
     sleep: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Sleep Resistance" },
-        { sleep: true },
+        { sleep: false },
     ]),
     madness: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:128:20
     ]),
     madness: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Madness Resistance" },
-        { madness: true },
+        { madness: false },
     ]),
     "death-blight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:128:9
     ]),
     madness: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Madness Resistance" },
-        { madness: true },
+        {},
     ]),
     "death-blight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:130:58
         { label: "Madness Resistance" },
         { madness: true },
     ]),
-    "death-blight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Death Blight Resistance" },
-        { "death-blight": true },
-    ]),
+    "death-blight": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     poise: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Poise" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:131:9
         { madness: true },
     ]),
     "death-blight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Death Blight Resistance" },
+        {},
         { "death-blight": true },
     ]),

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:131:18
         { madness: true },
     ]),
     "death-blight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Death Blight Resistance" },
+        { label: "" },
         { "death-blight": true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:132:27
     ]),
     "death-blight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Death Blight Resistance" },
-        { "death-blight": true },
+        { "death-blight": false },
     ]),
     poise: deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:135:9
         { "death-blight": true },
     ]),
     poise: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Poise" },
+        {},
         { poise: true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:136:18
     ]),
     poise: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Poise" },
-        { poise: true },
+        { poise: false },
     ]),
 };

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:313:13
     { label: "Ancient Dragon" },
     { operation: "sum" },
     { physical: true },
-    { fire: true },
+    { fire: false },
     { lightning: true },
 ]);

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:313:5
     { label: "Ancient Dragon" },
     { operation: "sum" },
     { physical: true },
-    { fire: true },
+    {},
     { lightning: true },
 ]);

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:318:5
 ]);
 const ASTEL_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Astel" },
-    { operation: "sum" },
+    {},
     { physical: true },
     { magic: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:320:14
     { label: "Astel" },
     { operation: "sum" },
     { physical: true },
-    { magic: true },
+    { magic: false },
 ]);
 const BLACKKNIFE_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:320:5
     { label: "Astel" },
     { operation: "sum" },
     { physical: true },
-    { magic: true },
+    {},
 ]);
 const BLACKKNIFE_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:324:5
 ]);
 const BLACKKNIFE_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Black Knife" },
-    { operation: "sum" },
+    {},
     { physical: true },
     { slash: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:326:14
     { label: "Black Knife" },
     { operation: "sum" },
     { physical: true },
-    { slash: true },
+    { slash: false },
     { pierce: true },
     { holy: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:328:13
     { physical: true },
     { slash: true },
     { pierce: true },
-    { holy: true },
+    { holy: false },
 ]);
 const BLOODHOUND_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:331:14
     { holy: true },
 ]);
 const BLOODHOUND_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Bloodhound" },
+    { label: "" },
     { operation: "sum" },
     { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:335:19
     { operation: "sum" },
     { physical: true },
     { slash: true },
-    { hemorrhage: true },
+    { hemorrhage: false },
 ]);
 const CRUCIBLEKNIGHT_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:335:5
     { operation: "sum" },
     { physical: true },
     { slash: true },
-    { hemorrhage: true },
+    {},
 ]);
 const CRUCIBLEKNIGHT_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:337:73
     { slash: true },
     { hemorrhage: true },
 ]);
-const CRUCIBLEKNIGHT_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Crucible" },
-    { operation: "sum" },
-    { physical: true },
-    { strike: true },
-    { pierce: true },
-    { holy: true },
-]);
+const CRUCIBLEKNIGHT_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, []);
 const CRYSTALIAN_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Crystalian" },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:342:15
     { operation: "sum" },
     { physical: true },
     { strike: true },
-    { pierce: true },
+    { pierce: false },
     { holy: true },
 ]);

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:342:5
     { operation: "sum" },
     { physical: true },
     { strike: true },
-    { pierce: true },
+    {},
     { holy: true },
 ]);

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:346:5
     { holy: true },
 ]);
 const CRYSTALIAN_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Crystalian" },
+    {},
     { operation: "sum" },
     { physical: true },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:346:14
     { holy: true },
 ]);
 const CRYSTALIAN_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Crystalian" },
+    { label: "" },
     { operation: "sum" },
     { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:352:5
     { strike: true },
 ]);
 const DEATHBIRD_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Deathbird" },
+    {},
     { operation: "sum" },
     { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:355:15
     { label: "Deathbird" },
     { operation: "sum" },
     { physical: true },
-    { pierce: true },
+    { pierce: false },
     { magic: true },
     { "death-blight": true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:357:23
     { physical: true },
     { pierce: true },
     { magic: true },
-    { "death-blight": true },
+    { "death-blight": false },
 ]);
 const DEMIHUMANQUEEN_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:364:14
     { operation: "sum" },
     { physical: true },
     { strike: true },
-    { magic: true },
+    { magic: false },
 ]);
 const GIDEON_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:367:5
     { magic: true },
 ]);
 const GIDEON_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Gideon" },
+    {},
     { operation: "sum" },
     { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:373:13
     { strike: true },
     { magic: true },
     { fire: true },
-    { holy: true },
+    { holy: false },
 ]);
 const FREYJA_MODIFICATIONS = [{ slash: true }];

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:373:5
     { strike: true },
     { magic: true },
     { fire: true },
-    { holy: true },
+    {},
 ]);
 const FREYJA_MODIFICATIONS = [{ slash: true }];

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:375:40
     { fire: true },
     { holy: true },
 ]);
-const FREYJA_MODIFICATIONS = [{ slash: true }];
+const FREYJA_MODIFICATIONS = [{ slash: false }];
 const HORNSENT_MODIFICATIONS = [
     { slash: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:377:14
 ]);
 const FREYJA_MODIFICATIONS = [{ slash: true }];
 const HORNSENT_MODIFICATIONS = [
-    { slash: true },
+    { slash: false },
     { hemorrhage: true },
     { holy: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:379:13
 const HORNSENT_MODIFICATIONS = [
     { slash: true },
     { hemorrhage: true },
-    { holy: true },
+    { holy: false },
 ];
 const MOORE_MODIFICATIONS = [{ strike: true }, { "scarlet-rot": true }];

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:381:40
     { hemorrhage: true },
     { holy: true },
 ];
-const MOORE_MODIFICATIONS = [{ strike: true }, { "scarlet-rot": true }];
+const MOORE_MODIFICATIONS = [{ strike: false }, { "scarlet-rot": true }];
 const PHYSICALMAGIC_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Physical and Magic" },
