[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:381:65
     { hemorrhage: true },
     { holy: true },
 ];
-const MOORE_MODIFICATIONS = [{ strike: true }, { "scarlet-rot": true }];
+const MOORE_MODIFICATIONS = [{ strike: true }, { "scarlet-rot": false }];
 const PHYSICALMAGIC_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Physical and Magic" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:383:5
 ];
 const MOORE_MODIFICATIONS = [{ strike: true }, { "scarlet-rot": true }];
 const PHYSICALMAGIC_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Physical and Magic" },
+    {},
     { operation: "sum" },
     { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:384:5
 const MOORE_MODIFICATIONS = [{ strike: true }, { "scarlet-rot": true }];
 const PHYSICALMAGIC_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Physical and Magic" },
-    { operation: "sum" },
+    {},
     { physical: true },
     { magic: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:394:9
         { label: "Physical, Slash, Pierce, and Fire" },
         { operation: "sum" },
         { physical: true },
-        { slash: true },
+        {},
         { pierce: true },
         { fire: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:396:17
         { physical: true },
         { slash: true },
         { pierce: true },
-        { fire: true },
+        { fire: false },
     ]
 );

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:402:15
 const BATTLEMAGE_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Battle Mage" },
     { operation: "sum" },
-    { strike: true },
+    { strike: false },
     { magic: true },
 ]);

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:406:5
     { magic: true },
 ]);
 const BEAST_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Beast" },
+    {},
     { operation: "sum" },
     { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:412:5
     { slash: true },
 ]);
 const SPELLSWORD_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Spellsword" },
+    {},
     { operation: "sum" },
     { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:417:5
     { physical: true },
     { strike: true },
     { pierce: true },
-    { magic: true },
+    {},
 ]);
 const KINDRED_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:420:14
     { magic: true },
 ]);
 const KINDRED_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Kindred" },
+    { label: "" },
     { operation: "sum" },
     { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:421:5
 ]);
 const KINDRED_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Kindred" },
-    { operation: "sum" },
+    {},
     { physical: true },
     { pierce: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:425:71
     { physical: true },
     { pierce: true },
 ]);
-const TREEGUARDIAN_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Tree Guardian" },
-    { operation: "sum" },
-    { physical: true },
-    { strike: true },
-    { holy: true },
-]);
+const TREEGUARDIAN_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, []);
 const PHYSICALSLASHPIERCEMAGIC_SORTBYARMOR = deepCloneAndMap(
     DEFAULT_SORTBYARMOR,

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:426:14
     { pierce: true },
 ]);
 const TREEGUARDIAN_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Tree Guardian" },
+    { label: "" },
     { operation: "sum" },
     { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:430:13
     { operation: "sum" },
     { physical: true },
     { strike: true },
-    { holy: true },
+    { holy: false },
 ]);
 const PHYSICALSLASHPIERCEMAGIC_SORTBYARMOR = deepCloneAndMap(

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:434:5
 ]);
 const PHYSICALSLASHPIERCEMAGIC_SORTBYARMOR = deepCloneAndMap(
     DEFAULT_SORTBYARMOR,
-    [
-        { label: "Physical, Slash, Pierce, and Magic" },
-        { operation: "sum" },
-        { physical: true },
-        { slash: true },
-        { pierce: true },
-        { magic: true },
-    ]
+    []
 );
 const BLOODLETTER_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:435:9
 const PHYSICALSLASHPIERCEMAGIC_SORTBYARMOR = deepCloneAndMap(
     DEFAULT_SORTBYARMOR,
     [
-        { label: "Physical, Slash, Pierce, and Magic" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:446:14
 const BLOODLETTER_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Bloodletter" },
     { operation: "sum" },
-    { slash: true },
+    { slash: false },
     { pierce: true },
     { hemorrhage: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:448:19
     { operation: "sum" },
     { slash: true },
     { pierce: true },
-    { hemorrhage: true },
+    { hemorrhage: false },
 ]);
 const HOLYKNIGHT_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:450:69
     { pierce: true },
     { hemorrhage: true },
 ]);
-const HOLYKNIGHT_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Holy Knight" },
-    { operation: "sum" },
-    { physical: true },
-    { pierce: true },
-    { holy: true },
-]);
+const HOLYKNIGHT_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, []);
 const GREATREDBEAR_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Great Red Bear" },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:462:15
     { operation: "sum" },
     { physical: true },
     { slash: true },
-    { strike: true },
+    { strike: false },
 ]);
 const DRACONIC_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:469:13
     { operation: "sum" },
     { physical: true },
     { strike: true },
-    { fire: true },
+    { fire: false },
     { lightning: true },
 ]);

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:469:5
     { operation: "sum" },
     { physical: true },
     { strike: true },
-    { fire: true },
+    {},
     { lightning: true },
 ]);

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:470:5
     { physical: true },
     { strike: true },
     { fire: true },
-    { lightning: true },
+    {},
 ]);
 const ERDTREEBURIAL_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:477:14
     { operation: "sum" },
     { physical: true },
     { slash: true },
-    { magic: true },
+    { magic: false },
     { fire: true },
 ]);

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:477:5
     { operation: "sum" },
     { physical: true },
     { slash: true },
-    { magic: true },
+    {},
     { fire: true },
 ]);

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:480:76
     { magic: true },
     { fire: true },
 ]);
-const PHYSICALSLASHFIRE_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Physical, Slash, and Fire" },
-    { operation: "sum" },
-    { physical: true },
-    { slash: true },
-    { fire: true },
-]);
+const PHYSICALSLASHFIRE_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, []);
 const FALLINGSTAR_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Fallingstar" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:481:5
     { fire: true },
 ]);
 const PHYSICALSLASHFIRE_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Physical, Slash, and Fire" },
+    {},
     { operation: "sum" },
     { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:485:13
     { operation: "sum" },
     { physical: true },
     { slash: true },
-    { fire: true },
+    { fire: false },
 ]);
 const FALLINGSTAR_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:487:70
     { slash: true },
     { fire: true },
 ]);
-const FALLINGSTAR_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Fallingstar" },
-    { operation: "sum" },
-    { physical: true },
-    { strike: true },
-    { pierce: true },
-    { magic: true },
-    { hemorrhage: true },
-]);
+const FALLINGSTAR_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, []);
 const PHYSICALSTRIKEFIRE_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Physical, Strike, and Fire" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:488:14
     { fire: true },
 ]);
 const FALLINGSTAR_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Fallingstar" },
+    { label: "" },
     { operation: "sum" },
     { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:494:19
     { strike: true },
     { pierce: true },
     { magic: true },
-    { hemorrhage: true },
+    { hemorrhage: false },
 ]);
 const PHYSICALSTRIKEFIRE_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:494:5
     { strike: true },
     { pierce: true },
     { magic: true },
-    { hemorrhage: true },
+    {},
 ]);
 const PHYSICALSTRIKEFIRE_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:498:5
 ]);
 const PHYSICALSTRIKEFIRE_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Physical, Strike, and Fire" },
-    { operation: "sum" },
+    {},
     { physical: true },
     { strike: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:503:71
     { strike: true },
     { fire: true },
 ]);
-const FLYINGDRAGON_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Flying Dragon" },
-    { operation: "sum" },
-    { physical: true },
-    { fire: true },
-]);
+const FLYINGDRAGON_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, []);
 const MAGMAWYRM_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Wyrm" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:504:5
     { fire: true },
 ]);
 const FLYINGDRAGON_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Flying Dragon" },
+    {},
     { operation: "sum" },
     { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:505:5
 ]);
 const FLYINGDRAGON_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Flying Dragon" },
-    { operation: "sum" },
+    {},
     { physical: true },
     { fire: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:510:5
     { fire: true },
 ]);
 const MAGMAWYRM_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Wyrm" },
+    {},
     { operation: "sum" },
     { slash: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:512:5
 const MAGMAWYRM_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Wyrm" },
     { operation: "sum" },
-    { slash: true },
+    {},
     { strike: true },
     { fire: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:517:5
     { fire: true },
 ]);
 const PUMPKINHEAD_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Pumpkin Head" },
+    {},
     { operation: "sum" },
     { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:518:5
 ]);
 const PUMPKINHEAD_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Pumpkin Head" },
-    { operation: "sum" },
+    {},
     { physical: true },
     { strike: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:521:19
     { operation: "sum" },
     { physical: true },
     { strike: true },
-    { hemorrhage: true },
+    { hemorrhage: false },
 ]);
 const MOHG_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:521:5
     { operation: "sum" },
     { physical: true },
     { strike: true },
-    { hemorrhage: true },
+    {},
 ]);
 const MOHG_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:523:63
     { strike: true },
     { hemorrhage: true },
 ]);
-const MOHG_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Mohg" },
-    { operation: "sum" },
-    { physical: true },
-    { pierce: true },
-    { fire: true },
-    { hemorrhage: true },
-]);
+const MOHG_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, []);
 const PUTRID_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
     { label: "Putrid" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:524:5
     { hemorrhage: true },
 ]);
 const MOHG_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Mohg" },
+    {},
     { operation: "sum" },
     { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:527:5
     { label: "Mohg" },
     { operation: "sum" },
     { physical: true },
-    { pierce: true },
+    {},
     { fire: true },
     { hemorrhage: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:528:5
     { operation: "sum" },
     { physical: true },
     { pierce: true },
-    { fire: true },
+    {},
     { hemorrhage: true },
 ]);

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:529:19
     { physical: true },
     { pierce: true },
     { fire: true },
-    { hemorrhage: true },
+    { hemorrhage: false },
 ]);
 const PUTRID_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:529:5
     { physical: true },
     { pierce: true },
     { fire: true },
-    { hemorrhage: true },
+    {},
 ]);
 const PUTRID_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:532:5
     { hemorrhage: true },
 ]);
 const PUTRID_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Putrid" },
+    {},
     { operation: "sum" },
     { physical: true },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:532:14
     { hemorrhage: true },
 ]);
 const PUTRID_SORTBYARMOR = deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-    { label: "Putrid" },
+    { label: "" },
     { operation: "sum" },
     { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:537:22
     { physical: true },
     { strike: true },
     { holy: true },
-    { "scarlet-rot": true },
+    { "scarlet-rot": false },
 ]);
 

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:551:18
         { fire: true },
     ]),
     "alecto-black-knife-ringleader": deepCloneAndMap(BLACKKNIFE_SORTBYARMOR, [
-        { label: "Alecto, Black Knife Ringleader" },
+        { label: "" },
     ]),
     "ancestor-spirit": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:551:9
         { fire: true },
     ]),
     "alecto-black-knife-ringleader": deepCloneAndMap(BLACKKNIFE_SORTBYARMOR, [
-        { label: "Alecto, Black Knife Ringleader" },
+        {},
     ]),
     "ancestor-spirit": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:553:67
     "alecto-black-knife-ringleader": deepCloneAndMap(BLACKKNIFE_SORTBYARMOR, [
         { label: "Alecto, Black Knife Ringleader" },
     ]),
-    "ancestor-spirit": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
-        { label: "Ancestor Spirit" },
-    ]),
+    "ancestor-spirit": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, []),
     "ancient-dragon-lansseax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [
         { label: "Ancient Dragon Lansseax" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:554:18
         { label: "Alecto, Black Knife Ringleader" },
     ]),
     "ancestor-spirit": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
-        { label: "Ancestor Spirit" },
+        { label: "" },
     ]),
     "ancient-dragon-lansseax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:554:9
         { label: "Alecto, Black Knife Ringleader" },
     ]),
     "ancestor-spirit": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
-        { label: "Ancestor Spirit" },
+        {},
     ]),
     "ancient-dragon-lansseax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:556:75
     "ancestor-spirit": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
         { label: "Ancestor Spirit" },
     ]),
-    "ancient-dragon-lansseax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [
-        { label: "Ancient Dragon Lansseax" },
-    ]),
+    "ancient-dragon-lansseax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, []),
     "ancient-dragon-man": deepCloneAndMap(PHYSICALSLASHPIERCEFIRE_SORTBYARMOR, [
         { label: "Ancient Dragon Man" },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:559:80
     "ancient-dragon-lansseax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [
         { label: "Ancient Dragon Lansseax" },
     ]),
-    "ancient-dragon-man": deepCloneAndMap(PHYSICALSLASHPIERCEFIRE_SORTBYARMOR, [
-        { label: "Ancient Dragon Man" },
-    ]),
+    "ancient-dragon-man": deepCloneAndMap(PHYSICALSLASHPIERCEFIRE_SORTBYARMOR, []),
     "ancient-dragon-senessax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [
         { label: "Ancient Dragon Senessax" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:560:18
         { label: "Ancient Dragon Lansseax" },
     ]),
     "ancient-dragon-man": deepCloneAndMap(PHYSICALSLASHPIERCEFIRE_SORTBYARMOR, [
-        { label: "Ancient Dragon Man" },
+        { label: "" },
     ]),
     "ancient-dragon-senessax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:562:75
     "ancient-dragon-man": deepCloneAndMap(PHYSICALSLASHPIERCEFIRE_SORTBYARMOR, [
         { label: "Ancient Dragon Man" },
     ]),
-    "ancient-dragon-senessax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [
-        { label: "Ancient Dragon Senessax" },
-    ]),
+    "ancient-dragon-senessax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, []),
     "ancient-hero-of-zamor": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Ancient Hero of Zamor" },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:565:67
     "ancient-dragon-senessax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [
         { label: "Ancient Dragon Senessax" },
     ]),
-    "ancient-hero-of-zamor": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Ancient Hero of Zamor" },
-        { operation: "sum" },
-        { slash: true },
-        { magic: true },
-        { frostbite: true },
-    ]),
+    "ancient-hero-of-zamor": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "astel-naturalborn-of-the-void": deepCloneAndMap(
         PHYSICALMAGIC_SORTBYARMOR,

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:570:22
         { operation: "sum" },
         { slash: true },
         { magic: true },
-        { frostbite: true },
+        { frostbite: false },
     ]),
     "astel-naturalborn-of-the-void": deepCloneAndMap(

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:583:18
         { label: "Battlemage Hugues" },
     ]),
     "bayle-the-dread": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [
-        { label: "Bayle the Dread" },
+        { label: "" },
     ]),
     "beastman-of-farum-azula": deepCloneAndMap(SORTBYARMOR_MODES.slash, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:586:18
         { label: "Bayle the Dread" },
     ]),
     "beastman-of-farum-azula": deepCloneAndMap(SORTBYARMOR_MODES.slash, [
-        { label: "Beastman of Farum Azula" },
+        { label: "" },
     ]),
     "beastman-of-farum-azula-duo": deepCloneAndMap(BEAST_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:589:9
         { label: "Beastman of Farum Azula" },
     ]),
     "beastman-of-farum-azula-duo": deepCloneAndMap(BEAST_SORTBYARMOR, [
-        { label: "Beastman of Farum Azula Duo" },
+        {},
     ]),
     "bell-bearing-hunter": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:591:68
     "beastman-of-farum-azula-duo": deepCloneAndMap(BEAST_SORTBYARMOR, [
         { label: "Beastman of Farum Azula Duo" },
     ]),
-    "bell-bearing-hunter": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [
-        { label: "Bell Bearing Hunter" },
-    ]),
+    "bell-bearing-hunter": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, []),
     "black-blade-kindred-axe-and-twinblades": deepCloneAndMap(
         KINDRED_SORTBYARMOR,

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:592:9
         { label: "Beastman of Farum Azula Duo" },
     ]),
     "bell-bearing-hunter": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [
-        { label: "Bell Bearing Hunter" },
+        {},
     ]),
     "black-blade-kindred-axe-and-twinblades": deepCloneAndMap(

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:596:9
     ]),
     "black-blade-kindred-axe-and-twinblades": deepCloneAndMap(
         KINDRED_SORTBYARMOR,
-        [{ label: "Black Blade Kindred (Axe and Twinblades)" }]
+        []
     ),
     "black-blade-kindred-sword-and-halberd": deepCloneAndMap(

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:596:19
     ]),
     "black-blade-kindred-axe-and-twinblades": deepCloneAndMap(
         KINDRED_SORTBYARMOR,
-        [{ label: "Black Blade Kindred (Axe and Twinblades)" }]
+        [{ label: "" }]
     ),
     "black-blade-kindred-sword-and-halberd": deepCloneAndMap(

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:605:21
             { operation: "sum" },
             { physical: true },
             { slash: true },
-            { holy: true },
+            { holy: false },
         ]
     ),

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:609:9
         ]
     ),
     "black-knife-assassin": deepCloneAndMap(BLACKKNIFE_SORTBYARMOR, [
-        { label: "Black Knife Assassin" },
+        {},
     ]),
     "black-knight-edredd": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:611:65
     "black-knife-assassin": deepCloneAndMap(BLACKKNIFE_SORTBYARMOR, [
         { label: "Black Knife Assassin" },
     ]),
-    "black-knight-edredd": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Black Knight Edredd" },
-        { operation: "sum" },
-        { physical: true },
-        { pierce: true },
-        { lightning: true },
-        { holy: true },
-    ]),
+    "black-knight-edredd": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "black-knight-garrew": deepCloneAndMap(TREEGUARDIAN_SORTBYARMOR, [
         { label: "Black Knight Garrew" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:612:9
         { label: "Black Knife Assassin" },
     ]),
     "black-knight-edredd": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Black Knight Edredd" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:616:22
         { operation: "sum" },
         { physical: true },
         { pierce: true },
-        { lightning: true },
+        { lightning: false },
         { holy: true },
     ]),

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:617:9
         { physical: true },
         { pierce: true },
         { lightning: true },
-        { holy: true },
+        {},
     ]),
     "black-knight-garrew": deepCloneAndMap(TREEGUARDIAN_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:619:70
         { lightning: true },
         { holy: true },
     ]),
-    "black-knight-garrew": deepCloneAndMap(TREEGUARDIAN_SORTBYARMOR, [
-        { label: "Black Knight Garrew" },
-    ]),
+    "black-knight-garrew": deepCloneAndMap(TREEGUARDIAN_SORTBYARMOR, []),
     "blackgaol-knight": deepCloneAndMap(KINDRED_SORTBYARMOR, [
         { label: "Blackgaol Knight" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:623:9
         { label: "Black Knight Garrew" },
     ]),
     "blackgaol-knight": deepCloneAndMap(KINDRED_SORTBYARMOR, [
-        { label: "Blackgaol Knight" },
+        {},
     ]),
     "bloodhound-knight": deepCloneAndMap(BLOODHOUND_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:628:75
     "bloodhound-knight": deepCloneAndMap(BLOODHOUND_SORTBYARMOR, [
         { label: "Bloodhound Knight" },
     ]),
-    "bloodhound-knight-darriwil": deepCloneAndMap(BLOODHOUND_SORTBYARMOR, [
-        { label: "Bloodhound Knight Darriwil" },
-    ]),
+    "bloodhound-knight-darriwil": deepCloneAndMap(BLOODHOUND_SORTBYARMOR, []),
     "bols-carian-knight": deepCloneAndMap(
         PHYSICALSLASHPIERCEMAGIC_SORTBYARMOR,

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:629:9
         { label: "Bloodhound Knight" },
     ]),
     "bloodhound-knight-darriwil": deepCloneAndMap(BLOODHOUND_SORTBYARMOR, [
-        { label: "Bloodhound Knight Darriwil" },
+        {},
     ]),
     "bols-carian-knight": deepCloneAndMap(

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:633:19
     ]),
     "bols-carian-knight": deepCloneAndMap(
         PHYSICALSLASHPIERCEMAGIC_SORTBYARMOR,
-        [{ label: "Bols Carian Knight" }]
+        [{ label: "" }]
     ),
     "borealis-the-freezing-fog": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:642:64
         { magic: true },
         { frostbite: true },
     ]),
-    "cemetery-shade": deepCloneAndMap(BLOODLETTER_SORTBYARMOR, [
-        { label: "Cemetery Shade" },
-    ]),
+    "cemetery-shade": deepCloneAndMap(BLOODLETTER_SORTBYARMOR, []),
     "chief-bloodfiend": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Chief Bloodfiend" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:643:9
         { frostbite: true },
     ]),
     "cemetery-shade": deepCloneAndMap(BLOODLETTER_SORTBYARMOR, [
-        { label: "Cemetery Shade" },
+        {},
     ]),
     "chief-bloodfiend": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:654:9
         { hemorrhage: true },
     ]),
     "cleanrot-knights": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Cleanrot Knight(s)" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:658:9
         { operation: "sum" },
         { physical: true },
         { pierce: true },
-        { holy: true },
+        {},
         { "scarlet-rot": true },
     ]),

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:661:77
         { holy: true },
         { "scarlet-rot": true },
     ]),
-    "commander-gaius": deepCloneAndMap(SORTBYARMOR_MODES["total-standard"], [
-        { label: "Commander Gaius" },
-        { magic: true },
-    ]),
+    "commander-gaius": deepCloneAndMap(SORTBYARMOR_MODES["total-standard"], []),
     "commander-niall": deepCloneAndMap(SORTBYARMOR_MODES["total-standard"], [
         { label: "Commander Niall" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:662:9
         { "scarlet-rot": true },
     ]),
     "commander-gaius": deepCloneAndMap(SORTBYARMOR_MODES["total-standard"], [
-        { label: "Commander Gaius" },
+        {},
         { magic: true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:663:18
     ]),
     "commander-gaius": deepCloneAndMap(SORTBYARMOR_MODES["total-standard"], [
         { label: "Commander Gaius" },
-        { magic: true },
+        { magic: false },
     ]),
     "commander-niall": deepCloneAndMap(SORTBYARMOR_MODES["total-standard"], [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:663:9
     ]),
     "commander-gaius": deepCloneAndMap(SORTBYARMOR_MODES["total-standard"], [
         { label: "Commander Gaius" },
-        { magic: true },
+        {},
     ]),
     "commander-niall": deepCloneAndMap(SORTBYARMOR_MODES["total-standard"], [
