[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:665:77
         { label: "Commander Gaius" },
         { magic: true },
     ]),
-    "commander-niall": deepCloneAndMap(SORTBYARMOR_MODES["total-standard"], [
-        { label: "Commander Niall" },
-        { lightning: true },
-    ]),
+    "commander-niall": deepCloneAndMap(SORTBYARMOR_MODES["total-standard"], []),
     "commander-oneil": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Commander O'Neil" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:666:9
         { magic: true },
     ]),
     "commander-niall": deepCloneAndMap(SORTBYARMOR_MODES["total-standard"], [
-        { label: "Commander Niall" },
+        {},
         { lightning: true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:667:22
     ]),
     "commander-niall": deepCloneAndMap(SORTBYARMOR_MODES["total-standard"], [
         { label: "Commander Niall" },
-        { lightning: true },
+        { lightning: false },
     ]),
     "commander-oneil": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:671:9
     ]),
     "commander-oneil": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Commander O'Neil" },
-        { operation: "sum" },
+        {},
         { physical: true },
         { strike: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:675:26
         { physical: true },
         { strike: true },
         { pierce: true },
-        { "scarlet-rot": true },
+        { "scarlet-rot": false },
     ]),
     "crucible-knight": deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:677:68
         { pierce: true },
         { "scarlet-rot": true },
     ]),
-    "crucible-knight": deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [
-        { label: "Crucible Knight" },
-    ]),
+    "crucible-knight": deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, []),
     "crucible-knight-and-crucible-knight-ordovis": deepCloneAndMap(
         CRUCIBLEKNIGHT_SORTBYARMOR,

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:682:10
     ]),
     "crucible-knight-and-crucible-knight-ordovis": deepCloneAndMap(
         CRUCIBLEKNIGHT_SORTBYARMOR,
-        [{ label: "Crucible Knight and Crucible Knight Ordovis" }]
+        [{}]
     ),
     "crucible-knight-and-misbegotten-warrior": deepCloneAndMap(

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:686:10
     ),
     "crucible-knight-and-misbegotten-warrior": deepCloneAndMap(
         CRUCIBLEKNIGHT_SORTBYARMOR,
-        [{ label: "Crucible Knight and Misbegotten Warrior" }]
+        [{}]
     ),
     "crucible-knight-siluria": deepCloneAndMap(HOLYKNIGHT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:689:9
         [{ label: "Crucible Knight and Misbegotten Warrior" }]
     ),
     "crucible-knight-siluria": deepCloneAndMap(HOLYKNIGHT_SORTBYARMOR, [
-        { label: "Crucible Knight Siluria" },
+        {},
     ]),
     crystalian: deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:696:71
     ]),
     "crystalian-duo-spear-and-ringblade": deepCloneAndMap(
         CRYSTALIAN_SORTBYARMOR,
-        [{ label: "Crystalian Duo (Spear and Ringblade)" }, { pierce: true }]
+        [{ label: "Crystalian Duo (Spear and Ringblade)" }, { pierce: false }]
     ),
     "crystalian-duo-spear-and-staff": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:696:10
     ]),
     "crystalian-duo-spear-and-ringblade": deepCloneAndMap(
         CRYSTALIAN_SORTBYARMOR,
-        [{ label: "Crystalian Duo (Spear and Ringblade)" }, { pierce: true }]
+        [{}, { pierce: true }]
     ),
     "crystalian-duo-spear-and-staff": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:698:79
         CRYSTALIAN_SORTBYARMOR,
         [{ label: "Crystalian Duo (Spear and Ringblade)" }, { pierce: true }]
     ),
-    "crystalian-duo-spear-and-staff": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [
-        { label: "Crystalian Duo (Spear and Staff)" },
-        { pierce: true },
-        { magic: true },
-    ]),
+    "crystalian-duo-spear-and-staff": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, []),
     "curseblade-labirith": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [
         { label: "Curseblade Labirith" },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:700:19
     ),
     "crystalian-duo-spear-and-staff": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [
         { label: "Crystalian Duo (Spear and Staff)" },
-        { pierce: true },
+        { pierce: false },
         { magic: true },
     ]),

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:703:70
         { pierce: true },
         { magic: true },
     ]),
-    "curseblade-labirith": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [
-        { label: "Curseblade Labirith" },
-    ]),
+    "curseblade-labirith": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, []),
     "dancer-of-ranah": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Dancer of Ranah" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:704:9
         { magic: true },
     ]),
     "curseblade-labirith": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [
-        { label: "Curseblade Labirith" },
+        {},
     ]),
     "dancer-of-ranah": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:706:61
     "curseblade-labirith": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [
         { label: "Curseblade Labirith" },
     ]),
-    "dancer-of-ranah": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Dancer of Ranah" },
-        { operation: "sum" },
-        { slash: true },
-        { fire: true },
-    ]),
+    "dancer-of-ranah": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "death-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Death Knight" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:707:9
         { label: "Curseblade Labirith" },
     ]),
     "dancer-of-ranah": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Dancer of Ranah" },
+        {},
         { operation: "sum" },
         { slash: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:708:9
     ]),
     "dancer-of-ranah": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Dancer of Ranah" },
-        { operation: "sum" },
+        {},
         { slash: true },
         { fire: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:710:9
         { label: "Dancer of Ranah" },
         { operation: "sum" },
         { slash: true },
-        { fire: true },
+        {},
     ]),
     "death-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:712:58
         { slash: true },
         { fire: true },
     ]),
-    "death-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Death Knight" },
-        { operation: "sum" },
-        { physical: true },
-        { lightning: true },
-    ]),
+    "death-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "death-rite-bird": deepCloneAndMap(DEATHBIRD_SORTBYARMOR, [
         { label: "Death Rite Bird" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:713:18
         { fire: true },
     ]),
     "death-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Death Knight" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:714:9
     ]),
     "death-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Death Knight" },
-        { operation: "sum" },
+        {},
         { physical: true },
         { lightning: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:716:22
         { label: "Death Knight" },
         { operation: "sum" },
         { physical: true },
-        { lightning: true },
+        { lightning: false },
     ]),
     "death-rite-bird": deepCloneAndMap(DEATHBIRD_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:716:9
         { label: "Death Knight" },
         { operation: "sum" },
         { physical: true },
-        { lightning: true },
+        {},
     ]),
     "death-rite-bird": deepCloneAndMap(DEATHBIRD_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:718:63
         { physical: true },
         { lightning: true },
     ]),
-    "death-rite-bird": deepCloneAndMap(DEATHBIRD_SORTBYARMOR, [
-        { label: "Death Rite Bird" },
-        { frostbite: true },
-    ]),
+    "death-rite-bird": deepCloneAndMap(DEATHBIRD_SORTBYARMOR, []),
     deathbird: deepCloneAndMap(DEATHBIRD_SORTBYARMOR, [{ label: "Deathbird" }]),
     "decaying-ekzykes": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:720:22
     ]),
     "death-rite-bird": deepCloneAndMap(DEATHBIRD_SORTBYARMOR, [
         { label: "Death Rite Bird" },
-        { frostbite: true },
+        { frostbite: false },
     ]),
     deathbird: deepCloneAndMap(DEATHBIRD_SORTBYARMOR, [{ label: "Deathbird" }]),

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:724:18
     ]),
     deathbird: deepCloneAndMap(DEATHBIRD_SORTBYARMOR, [{ label: "Deathbird" }]),
     "decaying-ekzykes": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Decaying Ekzykes" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:727:26
         { label: "Decaying Ekzykes" },
         { operation: "sum" },
         { physical: true },
-        { "scarlet-rot": true },
+        { "scarlet-rot": false },
     ]),
     "demi-human-chief": deepCloneAndMap(SORTBYARMOR_MODES.slash, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:730:9
         { "scarlet-rot": true },
     ]),
     "demi-human-chief": deepCloneAndMap(SORTBYARMOR_MODES.slash, [
-        { label: "Demi-Human Chief" },
+        {},
     ]),
     "demi-human-queen-gilika": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:732:76
     "demi-human-chief": deepCloneAndMap(SORTBYARMOR_MODES.slash, [
         { label: "Demi-Human Chief" },
     ]),
-    "demi-human-queen-gilika": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [
-        { label: "Demi-Human Queen Gilika" },
-    ]),
+    "demi-human-queen-gilika": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, []),
     "demi-human-queen-maggie": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [
         { label: "Demi-Human Queen Maggie" },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:735:76
     "demi-human-queen-gilika": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [
         { label: "Demi-Human Queen Gilika" },
     ]),
-    "demi-human-queen-maggie": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [
-        { label: "Demi-Human Queen Maggie" },
-    ]),
+    "demi-human-queen-maggie": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, []),
     "demi-human-queen-margot": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [
         { label: "Demi-Human Queen Margot" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:736:18
         { label: "Demi-Human Queen Gilika" },
     ]),
     "demi-human-queen-maggie": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [
-        { label: "Demi-Human Queen Maggie" },
+        { label: "" },
     ]),
     "demi-human-queen-margot": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:738:76
     "demi-human-queen-maggie": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [
         { label: "Demi-Human Queen Maggie" },
     ]),
-    "demi-human-queen-margot": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [
-        { label: "Demi-Human Queen Margot" },
-    ]),
+    "demi-human-queen-margot": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, []),
     "demi-human-queen-marigga": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [
         { label: "Demi-Human Queen Marigga" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:739:9
         { label: "Demi-Human Queen Maggie" },
     ]),
     "demi-human-queen-margot": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [
-        { label: "Demi-Human Queen Margot" },
+        {},
     ]),
     "demi-human-queen-marigga": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:744:73
     "demi-human-queen-marigga": deepCloneAndMap(DEMIHUMANQUEEN_SORTBYARMOR, [
         { label: "Demi-Human Queen Marigga" },
     ]),
-    "demi-human-swordmaster-onze": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Demi-Human Swordmaster Onze" },
-        { operation: "sum" },
-        { slash: true },
-        { pierce: true },
-        { magic: true },
-        { frostbite: true },
-    ]),
+    "demi-human-swordmaster-onze": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "divine-beast-dancing-lion": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Divine Beast Dancing Lion" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:745:9
         { label: "Demi-Human Queen Marigga" },
     ]),
     "demi-human-swordmaster-onze": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Demi-Human Swordmaster Onze" },
+        {},
         { operation: "sum" },
         { slash: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:746:9
     ]),
     "demi-human-swordmaster-onze": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Demi-Human Swordmaster Onze" },
-        { operation: "sum" },
+        {},
         { slash: true },
         { pierce: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:752:71
         { magic: true },
         { frostbite: true },
     ]),
-    "divine-beast-dancing-lion": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Divine Beast Dancing Lion" },
-        { operation: "sum" },
-        { physical: true },
-        { strike: true },
-        { magic: true },
-        { lightning: true },
-        { frostbite: true },
-    ]),
+    "divine-beast-dancing-lion": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "draconic-tree-sentinel": deepCloneAndMap(DRACONIC_SORTBYARMOR, [
         { label: "Draconic Tree Sentinel" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:753:9
         { frostbite: true },
     ]),
     "divine-beast-dancing-lion": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Divine Beast Dancing Lion" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:758:22
         { physical: true },
         { strike: true },
         { magic: true },
-        { lightning: true },
+        { lightning: false },
         { frostbite: true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:759:22
         { strike: true },
         { magic: true },
         { lightning: true },
-        { frostbite: true },
+        { frostbite: false },
     ]),
     "draconic-tree-sentinel": deepCloneAndMap(DRACONIC_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:761:69
         { lightning: true },
         { frostbite: true },
     ]),
-    "draconic-tree-sentinel": deepCloneAndMap(DRACONIC_SORTBYARMOR, [
-        { label: "Draconic Tree Sentinel" },
-    ]),
+    "draconic-tree-sentinel": deepCloneAndMap(DRACONIC_SORTBYARMOR, []),
     "dragonkin-soldier": deepCloneAndMap(SORTBYARMOR_MODES.physical, [
         { label: "Dragonkin Soldier" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:765:18
         { label: "Draconic Tree Sentinel" },
     ]),
     "dragonkin-soldier": deepCloneAndMap(SORTBYARMOR_MODES.physical, [
-        { label: "Dragonkin Soldier" },
+        { label: "" },
     ]),
     "dragonkin-soldier-of-nokstella": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:768:9
         { label: "Dragonkin Soldier" },
     ]),
     "dragonkin-soldier-of-nokstella": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Dragonkin Soldier of Nokstella" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:775:9
         { frostbite: true },
     ]),
     "dragonlord-placidusax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [
-        { label: "Dragonlord Placidusax" },
+        {},
     ]),
     "dryleaf-dane": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:778:18
         { label: "Dragonlord Placidusax" },
     ]),
     "dryleaf-dane": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Dryleaf Dane" },
+        { label: "" },
         { operation: "sum" },
         { strike: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:780:9
     "dryleaf-dane": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Dryleaf Dane" },
         { operation: "sum" },
-        { strike: true },
+        {},
         { holy: true },
     ]),

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:783:68
         { strike: true },
         { holy: true },
     ]),
-    "elemer-of-the-briar": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [
-        { label: "Elemer of the Briar" },
-    ]),
+    "elemer-of-the-briar": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, []),
     "erdtree-avatar": deepCloneAndMap(TREEGUARDIAN_SORTBYARMOR, [
         { label: "Erdtree Avatar" },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:786:65
     "elemer-of-the-briar": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [
         { label: "Elemer of the Briar" },
     ]),
-    "erdtree-avatar": deepCloneAndMap(TREEGUARDIAN_SORTBYARMOR, [
-        { label: "Erdtree Avatar" },
-    ]),
+    "erdtree-avatar": deepCloneAndMap(TREEGUARDIAN_SORTBYARMOR, []),
     "erdtree-burial-watchdog-duo": deepCloneAndMap(ERDTREEBURIAL_SORTBYARMOR, [
         { label: "Erdtree Burial Watchdog Duo" },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:789:79
     "erdtree-avatar": deepCloneAndMap(TREEGUARDIAN_SORTBYARMOR, [
         { label: "Erdtree Avatar" },
     ]),
-    "erdtree-burial-watchdog-duo": deepCloneAndMap(ERDTREEBURIAL_SORTBYARMOR, [
-        { label: "Erdtree Burial Watchdog Duo" },
-    ]),
+    "erdtree-burial-watchdog-duo": deepCloneAndMap(ERDTREEBURIAL_SORTBYARMOR, []),
     "erdtree-burial-watchdog-staff": deepCloneAndMap(
         ERDTREEBURIAL_SORTBYARMOR,

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:790:9
         { label: "Erdtree Avatar" },
     ]),
     "erdtree-burial-watchdog-duo": deepCloneAndMap(ERDTREEBURIAL_SORTBYARMOR, [
-        { label: "Erdtree Burial Watchdog Duo" },
+        {},
     ]),
     "erdtree-burial-watchdog-staff": deepCloneAndMap(

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:794:10
     ]),
     "erdtree-burial-watchdog-staff": deepCloneAndMap(
         ERDTREEBURIAL_SORTBYARMOR,
-        [{ label: "Erdtree Burial Watchdog Staff" }]
+        [{}]
     ),
     "erdtree-burial-watchdog-sword-fire": deepCloneAndMap(

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:802:9
     ),
     "erdtree-burial-watchdog-sword-lightning": deepCloneAndMap(
         DEFAULT_SORTBYARMOR,
-        [
-            { label: "Erdtree Burial Watchdog Sword (Lightning)" },
-            { operation: "sum" },
-            { physical: true },
-            { slash: true },
-            { lightning: true },
-        ]
+        []
     ),
     "esgar-priest-of-blood": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:803:13
     "erdtree-burial-watchdog-sword-lightning": deepCloneAndMap(
         DEFAULT_SORTBYARMOR,
         [
-            { label: "Erdtree Burial Watchdog Sword (Lightning)" },
+            {},
             { operation: "sum" },
             { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:807:26
             { operation: "sum" },
             { physical: true },
             { slash: true },
-            { lightning: true },
+            { lightning: false },
         ]
     ),

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:811:9
         ]
     ),
     "esgar-priest-of-blood": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Esgar, Priest of Blood" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:827:9
         { label: "Fell Twins" },
         { operation: "sum" },
         { slash: true },
-        { strike: true },
+        {},
         { holy: true },
         { hemorrhage: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:828:9
         { operation: "sum" },
         { slash: true },
         { strike: true },
-        { holy: true },
+        {},
         { hemorrhage: true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:829:23
         { slash: true },
         { strike: true },
         { holy: true },
-        { hemorrhage: true },
+        { hemorrhage: false },
     ]),
     "fias-champions": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:838:26
         { pierce: true },
         { magic: true },
         { "death-blight": true },
-        { "scarlet-rot": true },
+        { "scarlet-rot": false },
     ]),
     "fire-giant": deepCloneAndMap(PHYSICALSTRIKEFIRE_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:840:67
         { "death-blight": true },
         { "scarlet-rot": true },
     ]),
-    "fire-giant": deepCloneAndMap(PHYSICALSTRIKEFIRE_SORTBYARMOR, [
-        { label: "Fire Giant" },
-    ]),
+    "fire-giant": deepCloneAndMap(PHYSICALSTRIKEFIRE_SORTBYARMOR, []),
     "flying-dragon-agheel": deepCloneAndMap(FLYINGDRAGON_SORTBYARMOR, [
         { label: "Flying Dragon Agheel" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:841:18
         { "scarlet-rot": true },
     ]),
     "fire-giant": deepCloneAndMap(PHYSICALSTRIKEFIRE_SORTBYARMOR, [
-        { label: "Fire Giant" },
+        { label: "" },
     ]),
     "flying-dragon-agheel": deepCloneAndMap(FLYINGDRAGON_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:844:18
         { label: "Fire Giant" },
     ]),
     "flying-dragon-agheel": deepCloneAndMap(FLYINGDRAGON_SORTBYARMOR, [
-        { label: "Flying Dragon Agheel" },
+        { label: "" },
     ]),
     "flying-dragon-greyll": deepCloneAndMap(FLYINGDRAGON_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:847:9
         { label: "Flying Dragon Agheel" },
     ]),
     "flying-dragon-greyll": deepCloneAndMap(FLYINGDRAGON_SORTBYARMOR, [
-        { label: "Flying Dragon Greyll" },
+        {},
     ]),
     "frenzied-duelist": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:855:63
     "full-grown-fallingstar-beast": deepCloneAndMap(FALLINGSTAR_SORTBYARMOR, [
         { label: "Full-Grown Fallingstar Beast" },
     ]),
-    "ghostflame-dragon": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Ghostflame Dragon" },
-        { operation: "sum" },
-        { physical: true },
-        { strike: true },
-        { magic: true },
-        { frostbite: true },
-    ]),
+    "ghostflame-dragon": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "glintstone-dragon-adula": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
         { label: "Glintstone Dragon Adula" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:856:18
         { label: "Full-Grown Fallingstar Beast" },
     ]),
     "ghostflame-dragon": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Ghostflame Dragon" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:856:9
         { label: "Full-Grown Fallingstar Beast" },
     ]),
     "ghostflame-dragon": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Ghostflame Dragon" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:860:9
         { operation: "sum" },
         { physical: true },
         { strike: true },
-        { magic: true },
+        {},
         { frostbite: true },
     ]),

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:864:9
         { frostbite: true },
     ]),
     "glintstone-dragon-adula": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
-        { label: "Glintstone Dragon Adula" },
+        {},
     ]),
     "glintstone-dragon-smarag": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:870:18
         { label: "Glintstone Dragon Smarag" },
     ]),
     "godefroy-the-grafted": deepCloneAndMap(SORTBYARMOR_MODES.physical, [
-        { label: "Godefroy the Grafted" },
+        { label: "" },
     ]),
     "godfrey-first-elden-lord": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:875:76
     "godfrey-first-elden-lord": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [
         { label: "Godfrey, First Elden Lord" },
     ]),
-    "godrick-the-grafted": deepCloneAndMap(PHYSICALSTRIKEFIRE_SORTBYARMOR, [
-        { label: "Godrick the Grafted" },
-    ]),
+    "godrick-the-grafted": deepCloneAndMap(PHYSICALSTRIKEFIRE_SORTBYARMOR, []),
     "godskin-apostle": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Godskin Apostle" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:876:18
         { label: "Godfrey, First Elden Lord" },
     ]),
     "godrick-the-grafted": deepCloneAndMap(PHYSICALSTRIKEFIRE_SORTBYARMOR, [
-        { label: "Godrick the Grafted" },
+        { label: "" },
     ]),
     "godskin-apostle": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:878:61
     "godrick-the-grafted": deepCloneAndMap(PHYSICALSTRIKEFIRE_SORTBYARMOR, [
         { label: "Godrick the Grafted" },
     ]),
-    "godskin-apostle": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Godskin Apostle" },
-        { operation: "sum" },
-        { slash: true },
-        { pierce: true },
-        { fire: true },
-    ]),
+    "godskin-apostle": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "godskin-duo": deepCloneAndMap(PHYSICALSLASHPIERCEFIRE_SORTBYARMOR, [
         { label: "Godskin Duo" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:879:9
         { label: "Godrick the Grafted" },
     ]),
     "godskin-apostle": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Godskin Apostle" },
+        {},
         { operation: "sum" },
         { slash: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:880:9
     ]),
     "godskin-apostle": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Godskin Apostle" },
-        { operation: "sum" },
+        {},
         { slash: true },
         { pierce: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:888:59
     "godskin-duo": deepCloneAndMap(PHYSICALSLASHPIERCEFIRE_SORTBYARMOR, [
         { label: "Godskin Duo" },
     ]),
-    "godskin-noble": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Godskin Noble" },
-        { operation: "sum" },
-        { physical: true },
-        { pierce: true },
-        { fire: true },
-    ]),
+    "godskin-noble": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "golden-hippopotamus": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Golden Hippopotamus" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:889:9
         { label: "Godskin Duo" },
     ]),
     "godskin-noble": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Godskin Noble" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:896:9
         { fire: true },
     ]),
     "golden-hippopotamus": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Golden Hippopotamus" },
+        {},
         { operation: "sum" },
         { slash: true },
