[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:896:18
         { fire: true },
     ]),
     "golden-hippopotamus": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Golden Hippopotamus" },
+        { label: "" },
         { operation: "sum" },
         { slash: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:903:66
         { pierce: true },
         { holy: true },
     ]),
-    "grafted-scion": deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [
-        { label: "Grafted Scion" },
-    ]),
+    "grafted-scion": deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, []),
     "grave-warden-duelist": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [
         { label: "Grave Warden Duelist" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:913:18
         { label: "Great Wyrm Theodorix" },
     ]),
     "guardian-golem": deepCloneAndMap(FLYINGDRAGON_SORTBYARMOR, [
-        { label: "Guardian Golem" },
+        { label: "" },
     ]),
     "hoarah-loux": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:916:18
         { label: "Guardian Golem" },
     ]),
     "hoarah-loux": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [
-        { label: "Hoarah Loux" },
+        { label: "" },
     ]),
     "jagged-peak-drake": deepCloneAndMap(DRACONIC_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:916:9
         { label: "Guardian Golem" },
     ]),
     "hoarah-loux": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [
-        { label: "Hoarah Loux" },
+        {},
     ]),
     "jagged-peak-drake": deepCloneAndMap(DRACONIC_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:919:9
         { label: "Hoarah Loux" },
     ]),
     "jagged-peak-drake": deepCloneAndMap(DRACONIC_SORTBYARMOR, [
-        { label: "Jagged Peak Drake" },
+        {},
     ]),
     "jori-elder-inquisitor": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:922:18
         { label: "Jagged Peak Drake" },
     ]),
     "jori-elder-inquisitor": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Jori, Elder Inquisitor" },
+        { label: "" },
         { operation: "sum" },
         { slash: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:931:60
         { fire: true },
         { holy: true },
     ]),
-    "kindred-of-rot": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Kindred of Rot" },
-        { operation: "sum" },
-        { physical: true },
-        { pierce: true },
-    ]),
+    "kindred-of-rot": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     lamenter: deepCloneAndMap(SORTBYARMOR_MODES.strike, [
         { label: "Lamenter" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:932:18
         { holy: true },
     ]),
     "kindred-of-rot": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Kindred of Rot" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:933:9
     ]),
     "kindred-of-rot": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Kindred of Rot" },
-        { operation: "sum" },
+        {},
         { physical: true },
         { pierce: true },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:938:18
         { pierce: true },
     ]),
     lamenter: deepCloneAndMap(SORTBYARMOR_MODES.strike, [
-        { label: "Lamenter" },
+        { label: "" },
     ]),
     "leonine-misbegotten": deepCloneAndMap(SORTBYARMOR_MODES.physical, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:941:9
         { label: "Lamenter" },
     ]),
     "leonine-misbegotten": deepCloneAndMap(SORTBYARMOR_MODES.physical, [
-        { label: "Leonine Misbegotten" },
+        {},
     ]),
     "lichdragon-fortissax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:941:18
         { label: "Lamenter" },
     ]),
     "leonine-misbegotten": deepCloneAndMap(SORTBYARMOR_MODES.physical, [
-        { label: "Leonine Misbegotten" },
+        { label: "" },
     ]),
     "lichdragon-fortissax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:945:27
     ]),
     "lichdragon-fortissax": deepCloneAndMap(ANCIENTDRAGON_SORTBYARMOR, [
         { label: "Lichdragon Fortissax" },
-        { "death-blight": true },
+        { "death-blight": false },
     ]),
     "loretta-knight-of-the-haligtree": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:947:80
         { label: "Lichdragon Fortissax" },
         { "death-blight": true },
     ]),
-    "loretta-knight-of-the-haligtree": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [
-        { label: "Loretta, Knight of the Haligtree" },
-    ]),
+    "loretta-knight-of-the-haligtree": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, []),
     "mad-pumpkin-head": deepCloneAndMap(PUMPKINHEAD_SORTBYARMOR, [
         { label: "Mad Pumpkin Head" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:948:18
         { "death-blight": true },
     ]),
     "loretta-knight-of-the-haligtree": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [
-        { label: "Loretta, Knight of the Haligtree" },
+        { label: "" },
     ]),
     "mad-pumpkin-head": deepCloneAndMap(PUMPKINHEAD_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:951:9
         { label: "Loretta, Knight of the Haligtree" },
     ]),
     "mad-pumpkin-head": deepCloneAndMap(PUMPKINHEAD_SORTBYARMOR, [
-        { label: "Mad Pumpkin Head" },
+        {},
     ]),
     "mad-pumpkin-head-duo": deepCloneAndMap(PUMPKINHEAD_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:951:18
         { label: "Loretta, Knight of the Haligtree" },
     ]),
     "mad-pumpkin-head": deepCloneAndMap(PUMPKINHEAD_SORTBYARMOR, [
-        { label: "Mad Pumpkin Head" },
+        { label: "" },
     ]),
     "mad-pumpkin-head-duo": deepCloneAndMap(PUMPKINHEAD_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:956:58
     "mad-pumpkin-head-duo": deepCloneAndMap(PUMPKINHEAD_SORTBYARMOR, [
         { label: "Mad Pumpkin Head Duo" },
     ]),
-    "magma-wyrm": deepCloneAndMap(MAGMAWYRM_SORTBYARMOR, [
-        { label: "Magma Wyrm" },
-    ]),
+    "magma-wyrm": deepCloneAndMap(MAGMAWYRM_SORTBYARMOR, []),
     "magma-wyrm-makar": deepCloneAndMap(MAGMAWYRM_SORTBYARMOR, [
         { label: "Magma Wyrm Makar" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:957:9
         { label: "Mad Pumpkin Head Duo" },
     ]),
     "magma-wyrm": deepCloneAndMap(MAGMAWYRM_SORTBYARMOR, [
-        { label: "Magma Wyrm" },
+        {},
     ]),
     "magma-wyrm-makar": deepCloneAndMap(MAGMAWYRM_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:959:64
     "magma-wyrm": deepCloneAndMap(MAGMAWYRM_SORTBYARMOR, [
         { label: "Magma Wyrm" },
     ]),
-    "magma-wyrm-makar": deepCloneAndMap(MAGMAWYRM_SORTBYARMOR, [
-        { label: "Magma Wyrm Makar" },
-    ]),
+    "magma-wyrm-makar": deepCloneAndMap(MAGMAWYRM_SORTBYARMOR, []),
     "malenia-blade-of-miquella": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Malenia, Blade of Miquella" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:960:9
         { label: "Magma Wyrm" },
     ]),
     "magma-wyrm-makar": deepCloneAndMap(MAGMAWYRM_SORTBYARMOR, [
-        { label: "Magma Wyrm Makar" },
+        {},
     ]),
     "malenia-blade-of-miquella": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:962:71
     "magma-wyrm-makar": deepCloneAndMap(MAGMAWYRM_SORTBYARMOR, [
         { label: "Magma Wyrm Makar" },
     ]),
-    "malenia-blade-of-miquella": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Malenia, Blade of Miquella" },
-        { operation: "sum" },
-        { physical: true },
-        { slash: true },
-        { pierce: true },
-        { holy: true },
-        { "scarlet-rot": true },
-    ]),
+    "malenia-blade-of-miquella": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "maliketh-the-black-blade": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Maliketh, the Black Blade" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:963:18
         { label: "Magma Wyrm Makar" },
     ]),
     "malenia-blade-of-miquella": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Malenia, Blade of Miquella" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:972:18
         { "scarlet-rot": true },
     ]),
     "maliketh-the-black-blade": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Maliketh, the Black Blade" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:972:9
         { "scarlet-rot": true },
     ]),
     "maliketh-the-black-blade": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Maliketh, the Black Blade" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:978:17
         { slash: true },
         { pierce: true },
         { magic: true },
-        { holy: true },
+        { holy: false },
     ]),
     "margit-the-fell-omen": deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:978:9
         { slash: true },
         { pierce: true },
         { magic: true },
-        { holy: true },
+        {},
     ]),
     "margit-the-fell-omen": deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:980:73
         { magic: true },
         { holy: true },
     ]),
-    "margit-the-fell-omen": deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [
-        { label: "Margit, the Fell Omen" },
-    ]),
+    "margit-the-fell-omen": deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, []),
     "messmer-the-impaler": deepCloneAndMap(
         SORTBYARMOR_MODES["total-standard"],

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:981:18
         { holy: true },
     ]),
     "margit-the-fell-omen": deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [
-        { label: "Margit, the Fell Omen" },
+        { label: "" },
     ]),
     "messmer-the-impaler": deepCloneAndMap(

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:981:9
         { holy: true },
     ]),
     "margit-the-fell-omen": deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [
-        { label: "Margit, the Fell Omen" },
+        {},
     ]),
     "messmer-the-impaler": deepCloneAndMap(

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:985:53
     ]),
     "messmer-the-impaler": deepCloneAndMap(
         SORTBYARMOR_MODES["total-standard"],
-        [{ label: "Messmer, the Impaler" }, { fire: true }]
+        [{ label: "Messmer, the Impaler" }, { fire: false }]
     ),
     "metyr-mother-of-fingers": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:985:19
     ]),
     "messmer-the-impaler": deepCloneAndMap(
         SORTBYARMOR_MODES["total-standard"],
-        [{ label: "Messmer, the Impaler" }, { fire: true }]
+        [{ label: "" }, { fire: true }]
     ),
     "metyr-mother-of-fingers": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:988:18
         [{ label: "Messmer, the Impaler" }, { fire: true }]
     ),
     "metyr-mother-of-fingers": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Metyr, Mother of Fingers" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:997:18
         { holy: true },
     ]),
     "midra-lord-of-frenzied-flame": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Midra, Lord of Frenzied Flame" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1003:20
         { pierce: true },
         { fire: true },
         { holy: true },
-        { madness: true },
+        { madness: false },
     ]),
     "miranda-the-blighted-bloom": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1003:9
         { pierce: true },
         { fire: true },
         { holy: true },
-        { madness: true },
+        {},
     ]),
     "miranda-the-blighted-bloom": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1007:9
     ]),
     "miranda-the-blighted-bloom": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Miranda the Blighted Bloom" },
-        { operation: "sum" },
+        {},
         { physical: true },
         { strike: true },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1017:18
         { label: "Misbegotten Crusader" },
     ]),
     "mohg-lord-of-blood": deepCloneAndMap(MOHG_SORTBYARMOR, [
-        { label: "Mohg, Lord of Blood" },
+        { label: "" },
     ]),
     "mohg-the-omen": deepCloneAndMap(MOHG_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1019:56
     "mohg-lord-of-blood": deepCloneAndMap(MOHG_SORTBYARMOR, [
         { label: "Mohg, Lord of Blood" },
     ]),
-    "mohg-the-omen": deepCloneAndMap(MOHG_SORTBYARMOR, [
-        { label: "Mohg, the Omen" },
-    ]),
+    "mohg-the-omen": deepCloneAndMap(MOHG_SORTBYARMOR, []),
     "morgott-the-omen-king": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Morgott, the Omen King" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1020:18
         { label: "Mohg, Lord of Blood" },
     ]),
     "mohg-the-omen": deepCloneAndMap(MOHG_SORTBYARMOR, [
-        { label: "Mohg, the Omen" },
+        { label: "" },
     ]),
     "morgott-the-omen-king": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1028:17
         { slash: true },
         { pierce: true },
         { holy: true },
-        { fire: true },
+        { fire: false },
         { hemorrhage: true },
     ]),

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1031:67
         { fire: true },
         { hemorrhage: true },
     ]),
-    "necromancer-garris": deepCloneAndMap(BATTLEMAGE_SORTBYARMOR, [
-        { label: "Necromancer Garris" },
-    ]),
+    "necromancer-garris": deepCloneAndMap(BATTLEMAGE_SORTBYARMOR, []),
     "needle-knight-leda-and-dryleaf-dane": deepCloneAndMap(
         CRUCIBLEKNIGHT_SORTBYARMOR,

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1032:18
         { hemorrhage: true },
     ]),
     "necromancer-garris": deepCloneAndMap(BATTLEMAGE_SORTBYARMOR, [
-        { label: "Necromancer Garris" },
+        { label: "" },
     ]),
     "needle-knight-leda-and-dryleaf-dane": deepCloneAndMap(

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1040:9
     ),
     "needle-knight-leda-and-dryleaf-dane-and-hornsent": deepCloneAndMap(
         CRUCIBLEKNIGHT_SORTBYARMOR,
-        [
-            { label: "Needle Knight Leda & Dryleaf Dane & Hornsent" },
-            ...HORNSENT_MODIFICATIONS,
-        ]
+        []
     ),
     "needle-knight-leda-and-dryleaf-dane-and-hornsent-and-moore":

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1041:22
     "needle-knight-leda-and-dryleaf-dane-and-hornsent": deepCloneAndMap(
         CRUCIBLEKNIGHT_SORTBYARMOR,
         [
-            { label: "Needle Knight Leda & Dryleaf Dane & Hornsent" },
+            { label: "" },
             ...HORNSENT_MODIFICATIONS,
         ]

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1061:22
     "needle-knight-leda-and-dryleaf-dane-and-redmane-freyja": deepCloneAndMap(
         CRUCIBLEKNIGHT_SORTBYARMOR,
         [
-            { label: "Needle Knight Leda & Dryleaf Dane & Redmane Freyja" },
+            { label: "" },
             ...FREYJA_MODIFICATIONS,
         ]

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1067:13
     ),
     "needle-knight-leda-and-dryleaf-dane-and-redmane-freyja-and-hornsent":
         deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [
-            {
-                label: "Needle Knight Leda & Dryleaf Dane & Redmane Freyja & Hornsent",
-            },
+            {},
             ...HORNSENT_MODIFICATIONS,
             ...FREYJA_MODIFICATIONS,

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1074:53
             ...FREYJA_MODIFICATIONS,
         ]),
     "needle-knight-leda-and-dryleaf-dane-and-redmane-freyja-and-hornsent-and-moore":
-        deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [
-            {
-                label: "Needle Knight Leda & Dryleaf Dane & Redmane Freyja & Hornsent & Moore",
-            },
-            ...HORNSENT_MODIFICATIONS,
-            ...MOORE_MODIFICATIONS,
-            ...FREYJA_MODIFICATIONS,
-        ]),
+        deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, []),
     "needle-knight-leda-and-dryleaf-dane-and-redmane-freyja-and-moore":
         deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1083:53
             ...FREYJA_MODIFICATIONS,
         ]),
     "needle-knight-leda-and-dryleaf-dane-and-redmane-freyja-and-moore":
-        deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [
-            {
-                label: "Needle Knight Leda & Dryleaf Dane & Redmane Freyja & Moore",
-            },
-            ...MOORE_MODIFICATIONS,
-            ...FREYJA_MODIFICATIONS,
-        ]),
+        deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, []),
     "nights-cavalry-flail": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Night's Cavalry (Flail)" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1084:13
         ]),
     "needle-knight-leda-and-dryleaf-dane-and-redmane-freyja-and-moore":
         deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [
-            {
-                label: "Needle Knight Leda & Dryleaf Dane & Redmane Freyja & Moore",
-            },
+            {},
             ...MOORE_MODIFICATIONS,
             ...FREYJA_MODIFICATIONS,

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1085:24
     "needle-knight-leda-and-dryleaf-dane-and-redmane-freyja-and-moore":
         deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [
             {
-                label: "Needle Knight Leda & Dryleaf Dane & Redmane Freyja & Moore",
+                label: "",
             },
             ...MOORE_MODIFICATIONS,

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1092:9
         ]),
     "nights-cavalry-flail": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Night's Cavalry (Flail)" },
-        { operation: "sum" },
+        {},
         { strike: true },
         { hemorrhage: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1096:67
         { strike: true },
         { hemorrhage: true },
     ]),
-    "nights-cavalry-glaive": deepCloneAndMap(KINDRED_SORTBYARMOR, [
-        { label: "Night's Cavalry (Glaive)" },
-    ]),
+    "nights-cavalry-glaive": deepCloneAndMap(KINDRED_SORTBYARMOR, []),
     "nox-swordstress-and-nox-priest": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [
         { label: "Nox Swordstress & Nox Priest" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1097:9
         { hemorrhage: true },
     ]),
     "nights-cavalry-glaive": deepCloneAndMap(KINDRED_SORTBYARMOR, [
-        { label: "Night's Cavalry (Glaive)" },
+        {},
     ]),
     "nox-swordstress-and-nox-priest": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1100:9
         { label: "Night's Cavalry (Glaive)" },
     ]),
     "nox-swordstress-and-nox-priest": deepCloneAndMap(CRYSTALIAN_SORTBYARMOR, [
-        { label: "Nox Swordstress & Nox Priest" },
+        {},
     ]),
     "omenkiller-and-miranda-the-blighted-bloom": deepCloneAndMap(

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1110:23
             { physical: true },
             { fire: true },
             { hemorrhage: true },
-            { strike: true },
+            { strike: false },
             { holy: true },
             { poison: true },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1123:18
         { hemorrhage: true },
     ]),
     "onyx-lord": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Onyx Lord" },
+        { label: "" },
         { operation: "sum" },
         { slash: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1123:9
         { hemorrhage: true },
     ]),
     "onyx-lord": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Onyx Lord" },
+        {},
         { operation: "sum" },
         { slash: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1130:51
         { pierce: true },
         { magic: true },
     ]),
-    patches: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Patches" },
-        { operation: "sum" },
-        { strike: true },
-        { pierce: true },
-    ]),
+    patches: deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "perfumer-tricia-and-misbegotten-warrior": deepCloneAndMap(
         PHYSICALSLASHFIRE_SORTBYARMOR,

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1131:9
         { magic: true },
     ]),
     patches: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Patches" },
+        {},
         { operation: "sum" },
         { strike: true },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1131:18
         { magic: true },
     ]),
     patches: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Patches" },
+        { label: "" },
         { operation: "sum" },
         { strike: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1132:9
     ]),
     patches: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Patches" },
-        { operation: "sum" },
+        {},
         { strike: true },
         { pierce: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1154:63
         { holy: true },
         { hemorrhage: true },
     ]),
-    "putrescent-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Putrescent Knight" },
-        { operation: "sum" },
-        { physical: true },
-        { slash: true },
-        { magic: true },
-        { frostbite: true },
-    ]),
+    "putrescent-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "putrid-avatar": deepCloneAndMap(PUTRID_SORTBYARMOR, [
         { label: "Putrid Avatar" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1155:9
         { hemorrhage: true },
     ]),
     "putrescent-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Putrescent Knight" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1156:9
     ]),
     "putrescent-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Putrescent Knight" },
-        { operation: "sum" },
+        {},
         { physical: true },
         { slash: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1163:9
         { frostbite: true },
     ]),
     "putrid-avatar": deepCloneAndMap(PUTRID_SORTBYARMOR, [
-        { label: "Putrid Avatar" },
+        {},
     ]),
     "putrid-crystalian-trio": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1165:68
     "putrid-avatar": deepCloneAndMap(PUTRID_SORTBYARMOR, [
         { label: "Putrid Avatar" },
     ]),
-    "putrid-crystalian-trio": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Putrid Crystalian Trio" },
-        { operation: "sum" },
-        { physical: true },
-        { pierce: true },
-        { strike: true },
-        { magic: true },
-        { "scarlet-rot": true },
-    ]),
+    "putrid-crystalian-trio": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "putrid-grave-warden-duelist": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Putrid Grave Warden Duelist" },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1170:19
         { operation: "sum" },
         { physical: true },
         { pierce: true },
-        { strike: true },
+        { strike: false },
         { magic: true },
         { "scarlet-rot": true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1170:9
         { operation: "sum" },
         { physical: true },
         { pierce: true },
-        { strike: true },
+        {},
         { magic: true },
         { "scarlet-rot": true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1172:26
         { pierce: true },
         { strike: true },
         { magic: true },
-        { "scarlet-rot": true },
+        { "scarlet-rot": false },
     ]),
     "putrid-grave-warden-duelist": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1175:18
         { "scarlet-rot": true },
     ]),
     "putrid-grave-warden-duelist": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Putrid Grave Warden Duelist" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1176:9
     ]),
     "putrid-grave-warden-duelist": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Putrid Grave Warden Duelist" },
-        { operation: "sum" },
+        {},
         { physical: true },
         { strike: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1179:26
         { operation: "sum" },
         { physical: true },
         { strike: true },
-        { "scarlet-rot": true },
+        { "scarlet-rot": false },
     ]),
     "putrid-tree-spirit": deepCloneAndMap(PUTRID_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1186:9
     ]),
     "radagon-of-the-golden-order-and-elden-beast": deepCloneAndMap(
         DEFAULT_SORTBYARMOR,
-        [
-            { label: "Radagon of the Golden Order & Elden Beast" },
-            { operation: "sum" },
-            { physical: true },
-            { slash: true },
-            { strike: true },
-            { holy: true },
-        ]
+        []
     ),
     rakshasa: deepCloneAndMap(BLOODLETTER_SORTBYARMOR, [{ label: "Rakshasa" }]),

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1195:66
             { holy: true },
         ]
     ),
-    rakshasa: deepCloneAndMap(BLOODLETTER_SORTBYARMOR, [{ label: "Rakshasa" }]),
+    rakshasa: deepCloneAndMap(BLOODLETTER_SORTBYARMOR, [{ label: "" }]),
     "ralva-the-great-red-bear": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [
         { label: "Ralva the Great Red Bear" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1195:57
             { holy: true },
         ]
     ),
-    rakshasa: deepCloneAndMap(BLOODLETTER_SORTBYARMOR, [{ label: "Rakshasa" }]),
+    rakshasa: deepCloneAndMap(BLOODLETTER_SORTBYARMOR, [{}]),
     "ralva-the-great-red-bear": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [
         { label: "Ralva the Great Red Bear" },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1196:75
         ]
     ),
     rakshasa: deepCloneAndMap(BLOODLETTER_SORTBYARMOR, [{ label: "Rakshasa" }]),
-    "ralva-the-great-red-bear": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [
-        { label: "Ralva the Great Red Bear" },
-    ]),
+    "ralva-the-great-red-bear": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, []),
     "red-bear": deepCloneAndMap(BLOODHOUND_SORTBYARMOR, [
         { label: "Red Bear" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1197:18
     ),
     rakshasa: deepCloneAndMap(BLOODLETTER_SORTBYARMOR, [{ label: "Rakshasa" }]),
     "ralva-the-great-red-bear": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [
-        { label: "Ralva the Great Red Bear" },
+        { label: "" },
     ]),
     "red-bear": deepCloneAndMap(BLOODHOUND_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1200:9
         { label: "Ralva the Great Red Bear" },
     ]),
     "red-bear": deepCloneAndMap(BLOODHOUND_SORTBYARMOR, [
-        { label: "Red Bear" },
+        {},
     ]),
     "red-wolf-of-radagon": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
