[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1203:9
         { label: "Red Bear" },
     ]),
     "red-wolf-of-radagon": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
-        { label: "Red Wolf of Radagon" },
+        {},
     ]),
     "red-wolf-of-the-champion": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1206:9
         { label: "Red Wolf of Radagon" },
     ]),
     "red-wolf-of-the-champion": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
-        { label: "Red Wolf of the Champion" },
+        {},
     ]),
     "regal-ancestor-spirit": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1208:73
     "red-wolf-of-the-champion": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
         { label: "Red Wolf of the Champion" },
     ]),
-    "regal-ancestor-spirit": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
-        { label: "Regal Ancestor Spirit" },
-    ]),
+    "regal-ancestor-spirit": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, []),
     "rellana-twin-moon-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Rellana, Twin Moon Knight" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1209:9
         { label: "Red Wolf of the Champion" },
     ]),
     "regal-ancestor-spirit": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
-        { label: "Regal Ancestor Spirit" },
+        {},
     ]),
     "rellana-twin-moon-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1211:70
     "regal-ancestor-spirit": deepCloneAndMap(PHYSICALMAGIC_SORTBYARMOR, [
         { label: "Regal Ancestor Spirit" },
     ]),
-    "rellana-twin-moon-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Rellana, Twin Moon Knight" },
-        { operation: "sum" },
-        { physical: true },
-        { slash: true },
-        { pierce: true },
-        { magic: true },
-        { fire: true },
-    ]),
+    "rellana-twin-moon-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "rennala-queen-of-the-full-moon": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Rennala, Queen of the Full Moon" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1212:9
         { label: "Regal Ancestor Spirit" },
     ]),
     "rellana-twin-moon-knight": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Rellana, Twin Moon Knight" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1220:76
         { magic: true },
         { fire: true },
     ]),
-    "rennala-queen-of-the-full-moon": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Rennala, Queen of the Full Moon" },
-        { operation: "sum" },
-        { physical: true },
-        { magic: true },
-        { fire: true },
-    ]),
+    "rennala-queen-of-the-full-moon": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "romina-saint-of-the-bud": deepCloneAndMap(
         SORTBYARMOR_MODES["total-standard"],

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1221:18
         { fire: true },
     ]),
     "rennala-queen-of-the-full-moon": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Rennala, Queen of the Full Moon" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1222:9
     ]),
     "rennala-queen-of-the-full-moon": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Rennala, Queen of the Full Moon" },
-        { operation: "sum" },
+        {},
         { physical: true },
         { magic: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1229:66
     ]),
     "romina-saint-of-the-bud": deepCloneAndMap(
         SORTBYARMOR_MODES["total-standard"],
-        [{ label: "Romina, Saint of the Bud" }, { "scarlet-rot": true }]
+        [{ label: "Romina, Saint of the Bud" }, { "scarlet-rot": false }]
     ),
     "royal-knight-loretta": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1229:10
     ]),
     "romina-saint-of-the-bud": deepCloneAndMap(
         SORTBYARMOR_MODES["total-standard"],
-        [{ label: "Romina, Saint of the Bud" }, { "scarlet-rot": true }]
+        [{}, { "scarlet-rot": true }]
     ),
     "royal-knight-loretta": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1231:69
         SORTBYARMOR_MODES["total-standard"],
         [{ label: "Romina, Saint of the Bud" }, { "scarlet-rot": true }]
     ),
-    "royal-knight-loretta": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [
-        { label: "Royal Knight Loretta" },
-    ]),
+    "royal-knight-loretta": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, []),
     "royal-revenant": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Royal Revenant" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1232:9
         [{ label: "Romina, Saint of the Bud" }, { "scarlet-rot": true }]
     ),
     "royal-knight-loretta": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [
-        { label: "Royal Knight Loretta" },
+        {},
     ]),
     "royal-revenant": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1234:60
     "royal-knight-loretta": deepCloneAndMap(SPELLSWORD_SORTBYARMOR, [
         { label: "Royal Knight Loretta" },
     ]),
-    "royal-revenant": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Royal Revenant" },
-        { operation: "sum" },
-        { physical: true },
-        { poison: true },
-    ]),
+    "royal-revenant": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "rugalea-the-great-red-bear": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [
         { label: "Rugalea the Great Red Bear" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1235:18
         { label: "Royal Knight Loretta" },
     ]),
     "royal-revenant": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Royal Revenant" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1235:9
         { label: "Royal Knight Loretta" },
     ]),
     "royal-revenant": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Royal Revenant" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1236:9
     ]),
     "royal-revenant": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Royal Revenant" },
-        { operation: "sum" },
+        {},
         { physical: true },
         { poison: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1238:19
         { label: "Royal Revenant" },
         { operation: "sum" },
         { physical: true },
-        { poison: true },
+        { poison: false },
     ]),
     "rugalea-the-great-red-bear": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1238:9
         { label: "Royal Revenant" },
         { operation: "sum" },
         { physical: true },
-        { poison: true },
+        {},
     ]),
     "rugalea-the-great-red-bear": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1241:9
         { poison: true },
     ]),
     "rugalea-the-great-red-bear": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [
-        { label: "Rugalea the Great Red Bear" },
+        {},
     ]),
     runebear: deepCloneAndMap(BEAST_SORTBYARMOR, [{ label: "Runebear" }]),

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1243:51
     "rugalea-the-great-red-bear": deepCloneAndMap(GREATREDBEAR_SORTBYARMOR, [
         { label: "Rugalea the Great Red Bear" },
     ]),
-    runebear: deepCloneAndMap(BEAST_SORTBYARMOR, [{ label: "Runebear" }]),
+    runebear: deepCloneAndMap(BEAST_SORTBYARMOR, [{}]),
     "rykard-lord-of-blasphemy": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Rykard, Lord of Blasphemy" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1245:18
     ]),
     runebear: deepCloneAndMap(BEAST_SORTBYARMOR, [{ label: "Runebear" }]),
     "rykard-lord-of-blasphemy": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Rykard, Lord of Blasphemy" },
+        { label: "" },
         { operation: "sum" },
         { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1249:19
         { operation: "sum" },
         { physical: true },
         { fire: true },
-        { pierce: true },
+        { pierce: false },
         { poison: true },
     ]),

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1250:19
         { physical: true },
         { fire: true },
         { pierce: true },
-        { poison: true },
+        { poison: false },
     ]),
     "sanguine-noble": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1252:60
         { pierce: true },
         { poison: true },
     ]),
-    "sanguine-noble": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Sanguine Noble" },
-        { operation: "sum" },
-        { physical: true },
-        { pierce: true },
-        { hemorrhage: true },
-    ]),
+    "sanguine-noble": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "scadutree-avatar": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Scadutree Avatar" },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1257:9
         { operation: "sum" },
         { physical: true },
         { pierce: true },
-        { hemorrhage: true },
+        {},
     ]),
     "scadutree-avatar": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1259:62
         { pierce: true },
         { hemorrhage: true },
     ]),
-    "scadutree-avatar": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Scadutree Avatar" },
-        { operation: "sum" },
-        { physical: true },
-        { strike: true },
-        { magic: true },
-        { holy: true },
-        { hemorrhage: true },
-    ]),
+    "scadutree-avatar": deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
     "scaly-misbegotten": deepCloneAndMap(SORTBYARMOR_MODES.physical, [
         { label: "Scaly Misbegotten" },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1268:70
         { holy: true },
         { hemorrhage: true },
     ]),
-    "scaly-misbegotten": deepCloneAndMap(SORTBYARMOR_MODES.physical, [
-        { label: "Scaly Misbegotten" },
-    ]),
+    "scaly-misbegotten": deepCloneAndMap(SORTBYARMOR_MODES.physical, []),
     "sir-gideon-ofnir-the-all-knowing": deepCloneAndMap(GIDEON_SORTBYARMOR, [
         { label: "Sir Gideon Ofnir the All-Knowing" },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1272:18
         { label: "Scaly Misbegotten" },
     ]),
     "sir-gideon-ofnir-the-all-knowing": deepCloneAndMap(GIDEON_SORTBYARMOR, [
-        { label: "Sir Gideon Ofnir the All-Knowing" },
+        { label: "" },
     ]),
     "sir-gideon-ofnir-the-all-knowing-malenia": deepCloneAndMap(

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1272:9
         { label: "Scaly Misbegotten" },
     ]),
     "sir-gideon-ofnir-the-all-knowing": deepCloneAndMap(GIDEON_SORTBYARMOR, [
-        { label: "Sir Gideon Ofnir the All-Knowing" },
+        {},
     ]),
     "sir-gideon-ofnir-the-all-knowing-malenia": deepCloneAndMap(

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1277:22
     "sir-gideon-ofnir-the-all-knowing-malenia": deepCloneAndMap(
         GIDEON_SORTBYARMOR,
         [
-            { label: "Sir Gideon Ofnir the All-Knowing (Malenia Killed)" },
+            { label: "" },
             { "scarlet-rot": true },
         ]

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1278:30
         GIDEON_SORTBYARMOR,
         [
             { label: "Sir Gideon Ofnir the All-Knowing (Malenia Killed)" },
-            { "scarlet-rot": true },
+            { "scarlet-rot": false },
         ]
     ),

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1284:13
     "sir-gideon-ofnir-the-all-knowing-malenia-and-mohg": deepCloneAndMap(
         GIDEON_SORTBYARMOR,
         [
-            {
-                label: "Sir Gideon Ofnir the All-Knowing (Malenia and Mohg Killed)",
-            },
+            {},
             { "scarlet-rot": true },
             { hemorrhage: true },

[Survived] StringLiteral
armor/components/customSortBy/sortingPresets.tsx:1285:24
         GIDEON_SORTBYARMOR,
         [
             {
-                label: "Sir Gideon Ofnir the All-Knowing (Malenia and Mohg Killed)",
+                label: "",
             },
             { "scarlet-rot": true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1287:30
             {
                 label: "Sir Gideon Ofnir the All-Knowing (Malenia and Mohg Killed)",
             },
-            { "scarlet-rot": true },
+            { "scarlet-rot": false },
             { hemorrhage: true },
         ]

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1287:13
             {
                 label: "Sir Gideon Ofnir the All-Knowing (Malenia and Mohg Killed)",
             },
-            { "scarlet-rot": true },
+            {},
             { hemorrhage: true },
         ]

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1294:13
     "sir-gideon-ofnir-the-all-knowing-mohg": deepCloneAndMap(
         GIDEON_SORTBYARMOR,
         [
-            { label: "Sir Gideon Ofnir the All-Knowing (Mohg Killed)" },
+            {},
             { hemorrhage: true },
         ]

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1295:27
         GIDEON_SORTBYARMOR,
         [
             { label: "Sir Gideon Ofnir the All-Knowing (Mohg Killed)" },
-            { hemorrhage: true },
+            { hemorrhage: false },
         ]
     ),

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1295:13
         GIDEON_SORTBYARMOR,
         [
             { label: "Sir Gideon Ofnir the All-Knowing (Mohg Killed)" },
-            { hemorrhage: true },
+            {},
         ]
     ),

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1303:10
     ]),
     "spirit-caller-snail-crucible-knights": deepCloneAndMap(
         HOLYKNIGHT_SORTBYARMOR,
-        [{ label: "Spirit Caller Snail (Crucible Knights)" }]
+        [{}]
     ),
     "spirit-caller-snail-godskin-duo": deepCloneAndMap(

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1307:9
     ),
     "spirit-caller-snail-godskin-duo": deepCloneAndMap(
         PHYSICALSLASHPIERCEFIRE_SORTBYARMOR,
-        [{ label: "Spirit Caller Snail (Godskin Duo)" }]
+        []
     ),
     "starscourge-radahn": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1307:10
     ),
     "spirit-caller-snail-godskin-duo": deepCloneAndMap(
         PHYSICALSLASHPIERCEFIRE_SORTBYARMOR,
-        [{ label: "Spirit Caller Snail (Godskin Duo)" }]
+        [{}]
     ),
     "starscourge-radahn": deepCloneAndMap(DEFAULT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1310:9
         [{ label: "Spirit Caller Snail (Godskin Duo)" }]
     ),
     "starscourge-radahn": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Starscourge Radahn" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1328:25
             { slash: true },
             { pierce: true },
             { hemorrhage: true },
-            { physical: true },
+            { physical: false },
             { strike: true },
             { magic: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1333:9
             { magic: true },
         ]),
     "tibia-mariner": deepCloneAndMap(PHYSICALSLASHPIERCEMAGIC_SORTBYARMOR, [
-        { label: "Tibia Mariner" },
+        {},
     ]),
     "tree-sentinel": deepCloneAndMap(CRUCIBLEKNIGHT_SORTBYARMOR, [

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1343:9
     ]),
     "valiant-gargoyles": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Valiant Gargoyles" },
-        { operation: "sum" },
+        {},
         { physical: true },
         { slash: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1346:9
         { operation: "sum" },
         { physical: true },
         { slash: true },
-        { holy: true },
+        {},
         { pierce: true },
         { poison: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1347:19
         { physical: true },
         { slash: true },
         { holy: true },
-        { pierce: true },
+        { pierce: false },
         { poison: true },
     ]),

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1347:9
         { physical: true },
         { slash: true },
         { holy: true },
-        { pierce: true },
+        {},
         { poison: true },
     ]),

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1351:9
         { poison: true },
     ]),
     "vyke-knight-of-the-roundtable": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Vyke, Knight of the Roundtable" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1352:9
     ]),
     "vyke-knight-of-the-roundtable": deepCloneAndMap(DEFAULT_SORTBYARMOR, [
         { label: "Vyke, Knight of the Roundtable" },
-        { operation: "sum" },
+        {},
         { physical: true },
         { pierce: true },

[Survived] ArrayDeclaration
armor/components/customSortBy/sortingPresets.tsx:1357:52
         { pierce: true },
         { lightning: true },
     ]),
-    wormface: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Wormface" },
-        { operation: "sum" },
-        { physical: true },
-        { strike: true },
-        { "death-blight": true },
-    ]),
+    wormface: deepCloneAndMap(DEFAULT_SORTBYARMOR, []),
 };
 

[Survived] ObjectLiteral
armor/components/customSortBy/sortingPresets.tsx:1358:9
         { lightning: true },
     ]),
     wormface: deepCloneAndMap(DEFAULT_SORTBYARMOR, [
-        { label: "Wormface" },
+        {},
         { operation: "sum" },
         { physical: true },

[Survived] BooleanLiteral
armor/components/customSortBy/sortingPresets.tsx:1362:27
         { operation: "sum" },
         { physical: true },
         { strike: true },
-        { "death-blight": true },
+        { "death-blight": false },
     ]),
 };
