[Survived] StringLiteral
armor/components/armorResult/ArmorResultSet.tsx:53:36
                 />
                 <ArmorResultRow
                     name={props.armorNames[2]}
-                    id={props.id + "_" + props.armorIds[2]}
+                    id={props.id + "" + props.armorIds[2]}
                     armorId={props.armorIds[2]}
                     stats={props.itemStats[2]}
