[Killed] ConditionalExpression
armor/components/customSortBy/FormulaField.tsx:18:13
     let tabs: number = 0;
     function mapTokenGroupToLines(tokenGroup: string[]): string {
         // if length is 1, process the token
-        if (tokenGroup.length === 1) {
+        if (true) {
             const token = tokenGroup[0];
             if (token.includes("(")) {
killedBy: FormulaField Renders with child
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 2

  SUM(
      AVG(
-         PHYSICAL

[Timeout] ConditionalExpression
armor/components/customSortBy/FormulaField.tsx:18:13
     let tabs: number = 0;
     function mapTokenGroupToLines(tokenGroup: string[]): string {
         // if length is 1, process the token
-        if (tokenGroup.length === 1) {
+        if (false) {
             const token = tokenGroup[0];
             if (token.includes("(")) {

[Killed] ConditionalExpression
armor/components/customSortBy/FormulaField.tsx:20:17
         // if length is 1, process the token
         if (tokenGroup.length === 1) {
             const token = tokenGroup[0];
-            if (token.includes("(")) {
+            if (false) {
                 const value = TAB.repeat(tabs) + token + "\n";
                 tabs += 1;
killedBy: Armor Page load local storage
statusReason: RangeError: Invalid count value: -1

[Killed] ConditionalExpression
armor/components/customSortBy/FormulaField.tsx:20:17
         // if length is 1, process the token
         if (tokenGroup.length === 1) {
             const token = tokenGroup[0];
-            if (token.includes("(")) {
+            if (true) {
                 const value = TAB.repeat(tabs) + token + "\n";
                 tabs += 1;
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] AssignmentOperator
armor/components/customSortBy/FormulaField.tsx:22:17
             const token = tokenGroup[0];
             if (token.includes("(")) {
                 const value = TAB.repeat(tabs) + token + "\n";
-                tabs += 1;
+                tabs -= 1;
                 return value;
             } else if (token === ")") {
killedBy: Armor Page load local storage
statusReason: RangeError: Invalid count value: -1

[Killed] ConditionalExpression
armor/components/customSortBy/FormulaField.tsx:24:24
                 const value = TAB.repeat(tabs) + token + "\n";
                 tabs += 1;
                 return value;
-            } else if (token === ")") {
+            } else if (false) {
                 tabs -= 1;
                 return TAB.repeat(tabs) + token + "\n";
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] EqualityOperator
armor/components/customSortBy/FormulaField.tsx:24:24
                 const value = TAB.repeat(tabs) + token + "\n";
                 tabs += 1;
                 return value;
-            } else if (token === ")") {
+            } else if (token !== ")") {
                 tabs -= 1;
                 return TAB.repeat(tabs) + token + "\n";
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] AssignmentOperator
armor/components/customSortBy/FormulaField.tsx:25:17
                 tabs += 1;
                 return value;
             } else if (token === ")") {
-                tabs -= 1;
+                tabs += 1;
                 return TAB.repeat(tabs) + token + "\n";
             } else {
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] BlockStatement
armor/components/customSortBy/FormulaField.tsx:43:38
         <textarea
             id="formula"
             defaultValue={marshalledFormula
-                .map((tokenGroup) => {
-                    return mapTokenGroupToLines(tokenGroup);
-                })
+                .map((tokenGroup) => {})
                 .join("")}
             style={{
killedBy: FormulaField Renders
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "(
    PHYSICAL
)
"
Received: ""

[Killed] StringLiteral
armor/components/customSortBy/FormulaField.tsx:46:23
                 .map((tokenGroup) => {
                     return mapTokenGroupToLines(tokenGroup);
                 })
-                .join("")}
+                .join("Stryker was here!")}
             style={{
                 width: "100%",
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Survived] ObjectLiteral
armor/components/customSortBy/FormulaField.tsx:47:20
                     return mapTokenGroupToLines(tokenGroup);
                 })
                 .join("")}
-            style={{
-                width: "100%",
-                backgroundColor: "var(--secondary)",
-                color: "var(--contrast)",
-            }}
+            style={{}}
             rows={20}
         />

[Survived] StringLiteral
armor/components/customSortBy/FormulaField.tsx:49:34
                 .join("")}
             style={{
                 width: "100%",
-                backgroundColor: "var(--secondary)",
+                backgroundColor: "",
                 color: "var(--contrast)",
             }}
