[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:26:15
     label: "Default",
     children: [],
     operation: "value",
-    physical: false,
+    physical: true,
     strike: false,
     slash: false,
killedBy: Armor Page updates sorting mode
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:27:13
     children: [],
     operation: "value",
     physical: false,
-    strike: false,
+    strike: true,
     slash: false,
     pierce: false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:28:12
     operation: "value",
     physical: false,
     strike: false,
-    slash: false,
+    slash: true,
     pierce: false,
     magic: false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:29:13
     physical: false,
     strike: false,
     slash: false,
-    pierce: false,
+    pierce: true,
     magic: false,
     fire: false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:30:12
     strike: false,
     slash: false,
     pierce: false,
-    magic: false,
+    magic: true,
     fire: false,
     lightning: false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:31:11
     slash: false,
     pierce: false,
     magic: false,
-    fire: false,
+    fire: true,
     lightning: false,
     holy: false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:32:16
     pierce: false,
     magic: false,
     fire: false,
-    lightning: false,
+    lightning: true,
     holy: false,
     poison: false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:33:11
     magic: false,
     fire: false,
     lightning: false,
-    holy: false,
+    holy: true,
     poison: false,
     "scarlet-rot": false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:34:13
     fire: false,
     lightning: false,
     holy: false,
-    poison: false,
+    poison: true,
     "scarlet-rot": false,
     hemorrhage: false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:35:20
     lightning: false,
     holy: false,
     poison: false,
-    "scarlet-rot": false,
+    "scarlet-rot": true,
     hemorrhage: false,
     frostbite: false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:36:17
     holy: false,
     poison: false,
     "scarlet-rot": false,
-    hemorrhage: false,
+    hemorrhage: true,
     frostbite: false,
     sleep: false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:37:16
     poison: false,
     "scarlet-rot": false,
     hemorrhage: false,
-    frostbite: false,
+    frostbite: true,
     sleep: false,
     madness: false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:38:12
     "scarlet-rot": false,
     hemorrhage: false,
     frostbite: false,
-    sleep: false,
+    sleep: true,
     madness: false,
     "death-blight": false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:39:14
     hemorrhage: false,
     frostbite: false,
     sleep: false,
-    madness: false,
+    madness: true,
     "death-blight": false,
     poise: false,
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:40:21
     frostbite: false,
     sleep: false,
     madness: false,
-    "death-blight": false,
+    "death-blight": true,
     poise: false,
 });
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:41:12
     sleep: false,
     madness: false,
     "death-blight": false,
-    poise: false,
+    poise: true,
 });
 const SELECTABLE_SORTING_FIELDS_SET = new Set([
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] StringLiteral
armor/components/customSortBy/sorting.tsx:46:5
 const SELECTABLE_SORTING_FIELDS_SET = new Set([
     "physical",
     "strike",
-    "slash",
+    "",
     "pierce",
     "magic",
killedBy: FormulaField Renders with child
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  SUM(
      AVG(
          PHYSICAL

[Survived] StringLiteral
armor/components/customSortBy/sorting.tsx:56:5
     "scarlet-rot",
     "hemorrhage",
     "frostbite",
-    "sleep",
+    "",
     "madness",
     "death-blight",

[Killed] MethodExpression
armor/components/customSortBy/sorting.tsx:64:9
 
 const VALID_TOKENS: string[] = [
     ...Array.from(SELECTABLE_SORTING_FIELDS_SET.values()).map((f) =>
-        f.toUpperCase()
+        f.toLowerCase()
     ),
     "SUM(",
killedBy: Armor Page load local storage
statusReason: Error: Invalid token: PHYSICAL

[Killed] StringLiteral
armor/components/customSortBy/sorting.tsx:66:5
     ...Array.from(SELECTABLE_SORTING_FIELDS_SET.values()).map((f) =>
         f.toUpperCase()
     ),
-    "SUM(",
+    "",
     "AVG(",
     "MULT(",
killedBy: Armor Sorting Script unmarshallSortBy with sum
statusReason: Error: Invalid token: SUM(

[Killed] StringLiteral
armor/components/customSortBy/sorting.tsx:70:5
     "AVG(",
     "MULT(",
     "(",
-    ")",
+    "",
 ];
 
killedBy: Armor Sorting Script unmarshallSortBy
statusReason: Error: Invalid token: )

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:79:31
 
 function countSelectedSortingFields(sortBy: SortByArmor): number {
     let count = 0;
-    for (const key in sortBy) {
-        if (isSelectableSortingField(key) && sortBy[key as SortByArmorKey])
-            count += 1;
-    }
+    for (const key in sortBy) {}
     return count;
 }
killedBy: Armor Sorting Script evaluateSortBy with a value error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot have more than 1 value without average, sum, or multiply"

Received function did not throw

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:80:13
 function countSelectedSortingFields(sortBy: SortByArmor): number {
     let count = 0;
     for (const key in sortBy) {
-        if (isSelectableSortingField(key) && sortBy[key as SortByArmorKey])
+        if (false)
             count += 1;
     }
killedBy: Armor Page Renders
statusReason: Error: Cannot have sum without at least 2 values

[Killed] LogicalOperator
armor/components/customSortBy/sorting.tsx:80:13
 function countSelectedSortingFields(sortBy: SortByArmor): number {
     let count = 0;
     for (const key in sortBy) {
-        if (isSelectableSortingField(key) && sortBy[key as SortByArmorKey])
+        if (isSelectableSortingField(key) || sortBy[key as SortByArmorKey])
             count += 1;
     }
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:81:13
     let count = 0;
     for (const key in sortBy) {
         if (isSelectableSortingField(key) && sortBy[key as SortByArmorKey])
-            count += 1;
+            count -= 1;
     }
     return count;
killedBy: Armor Page Renders
statusReason: Error: Cannot have sum without at least 2 values

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:97:59
 
     // evaluate children
     let childrenValues: number[] = [];
-    for (const child of sortBy.children as SortByArmor[]) {
-        childrenValues.push(evaluateSortBy(child, armor));
-    }
+    for (const child of sortBy.children as SortByArmor[]) {}
 
     // if average is selected
killedBy: Armor Sorting Script evaluateSortBy with average with children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: 0

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:105:57
     // average the children and every selected field
     let result: number = 0;
     if (sortBy.operation === "average") {
-        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {
-            throw new Error("Cannot have average without at least 2 values");
-        }
+        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {}
 
         let denominator = SELECTED_FIELDS_COUNT + CHILDREN_COUNT;
killedBy: Armor Sorting Script evaluateSortBy with an average error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot have average without at least 2 values"

Received function did not throw

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:105:13
     // average the children and every selected field
     let result: number = 0;
     if (sortBy.operation === "average") {
-        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {
+        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT >= 2) {
             throw new Error("Cannot have average without at least 2 values");
         }
killedBy: Armor Sorting Script evaluateSortBy with an average error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot have average without at least 2 values"

Received function did not throw

[Killed] ArithmeticOperator
armor/components/customSortBy/sorting.tsx:109:27
             throw new Error("Cannot have average without at least 2 values");
         }
 
-        let denominator = SELECTED_FIELDS_COUNT + CHILDREN_COUNT;
+        let denominator = SELECTED_FIELDS_COUNT - CHILDREN_COUNT;
         let numerator = 0;
 
killedBy: Armor Sorting Script evaluateSortBy with average with children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: -4.75

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:113:45
         let numerator = 0;
 
         // add children values to the numerator
-        for (const value of childrenValues) {
-            numerator += value;
-        }
+        for (const value of childrenValues) {}
 
         // add selected field values to the numerator
killedBy: Armor Sorting Script evaluateSortBy with average with children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: 0

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:114:13
 
         // add children values to the numerator
         for (const value of childrenValues) {
-            numerator += value;
+            numerator -= value;
         }
 
killedBy: Armor Sorting Script evaluateSortBy with average with children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: -4.75

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:118:35
         }
 
         // add selected field values to the numerator
-        for (const key in sortBy) {
-            if (
-                isSelectableSortingField(key) &&
-                sortBy[key as SortByArmorKey]
-            ) {
-                // if defense
-                if (armor.defenses[key as DefensesMapKey]) {
-                    numerator += armor.defenses[key as DefensesMapKey]!;
-                }
-                // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
-                    numerator += armor.resistances[key as ResistancesMapKey]!;
-                }
-                // if poise
-                if (key === "poise") {
-                    numerator += armor.poise!;
-                }
-            }
-        }
+        for (const key in sortBy) {}
 
         result += numerator / denominator;
killedBy: Armor Sorting Script evaluateSortBy with average
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: 0

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:120:17
         // add selected field values to the numerator
         for (const key in sortBy) {
             if (
-                isSelectableSortingField(key) &&
-                sortBy[key as SortByArmorKey]
+                true
             ) {
                 // if defense
killedBy: Armor Sorting Script evaluateSortBy with average
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: 202

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:120:17
         // add selected field values to the numerator
         for (const key in sortBy) {
             if (
-                isSelectableSortingField(key) &&
-                sortBy[key as SortByArmorKey]
+                false
             ) {
                 // if defense
killedBy: Armor Sorting Script evaluateSortBy with average
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: 0

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:122:15
             if (
                 isSelectableSortingField(key) &&
                 sortBy[key as SortByArmorKey]
-            ) {
-                // if defense
-                if (armor.defenses[key as DefensesMapKey]) {
-                    numerator += armor.defenses[key as DefensesMapKey]!;
-                }
-                // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
-                    numerator += armor.resistances[key as ResistancesMapKey]!;
-                }
-                // if poise
-                if (key === "poise") {
-                    numerator += armor.poise!;
-                }
-            }
+            ) {}
         }
 
killedBy: Armor Sorting Script evaluateSortBy with average
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: 0

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:124:21
                 sortBy[key as SortByArmorKey]
             ) {
                 // if defense
-                if (armor.defenses[key as DefensesMapKey]) {
+                if (false) {
                     numerator += armor.defenses[key as DefensesMapKey]!;
                 }
killedBy: Armor Sorting Script evaluateSortBy with average
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: 0

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:124:60
                 sortBy[key as SortByArmorKey]
             ) {
                 // if defense
-                if (armor.defenses[key as DefensesMapKey]) {
-                    numerator += armor.defenses[key as DefensesMapKey]!;
-                }
+                if (armor.defenses[key as DefensesMapKey]) {}
                 // if resistance
                 if (armor.resistances[key as ResistancesMapKey]) {
killedBy: Armor Sorting Script evaluateSortBy with average
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: 0

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:125:21
             ) {
                 // if defense
                 if (armor.defenses[key as DefensesMapKey]) {
-                    numerator += armor.defenses[key as DefensesMapKey]!;
+                    numerator -= armor.defenses[key as DefensesMapKey]!;
                 }
                 // if resistance
killedBy: Armor Sorting Script evaluateSortBy with average
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: -4.75

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:128:21
                     numerator += armor.defenses[key as DefensesMapKey]!;
                 }
                 // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
+                if (false) {
                     numerator += armor.resistances[key as ResistancesMapKey]!;
                 }
killedBy: Armor Sorting Script evaluateSortBy with average with resistance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 38
Received: 0

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:128:66
                     numerator += armor.defenses[key as DefensesMapKey]!;
                 }
                 // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
-                    numerator += armor.resistances[key as ResistancesMapKey]!;
-                }
+                if (armor.resistances[key as ResistancesMapKey]) {}
                 // if poise
                 if (key === "poise") {
killedBy: Armor Sorting Script evaluateSortBy with average with resistance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 38
Received: 0

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:129:21
                 }
                 // if resistance
                 if (armor.resistances[key as ResistancesMapKey]) {
-                    numerator += armor.resistances[key as ResistancesMapKey]!;
+                    numerator -= armor.resistances[key as ResistancesMapKey]!;
                 }
                 // if poise
killedBy: Armor Sorting Script evaluateSortBy with average with resistance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 38
Received: -38

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:132:21
                     numerator += armor.resistances[key as ResistancesMapKey]!;
                 }
                 // if poise
-                if (key === "poise") {
+                if (true) {
                     numerator += armor.poise!;
                 }
killedBy: Armor Sorting Script evaluateSortBy with average
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: 11.75

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:132:21
                     numerator += armor.resistances[key as ResistancesMapKey]!;
                 }
                 // if poise
-                if (key === "poise") {
+                if (key !== "poise") {
                     numerator += armor.poise!;
                 }
killedBy: Armor Sorting Script evaluateSortBy with average
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: 11.75

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:133:21
                 }
                 // if poise
                 if (key === "poise") {
-                    numerator += armor.poise!;
+                    numerator -= armor.poise!;
                 }
             }
killedBy: Armor Sorting Script evaluateSortBy with average with poise
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22.5
Received: 15.5

[Killed] ArithmeticOperator
armor/components/customSortBy/sorting.tsx:138:19
             }
         }
 
-        result += numerator / denominator;
+        result += numerator * denominator;
     }
 
killedBy: Armor Sorting Script evaluateSortBy with average
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: 19

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:138:9
             }
         }
 
-        result += numerator / denominator;
+        result -= numerator / denominator;
     }
 
killedBy: Armor Sorting Script evaluateSortBy with average
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4.75
Received: -4.75

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:144:13
     // else if sum is selected
     // sum the children and every selected field
     else if (sortBy.operation === "sum") {
-        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {
+        if (false) {
             throw new Error("Cannot have sum without at least 2 values");
         }
killedBy: Armor Sorting Script evaluateSortBy with a sum error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot have sum without at least 2 values"

Received function did not throw

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:144:57
     // else if sum is selected
     // sum the children and every selected field
     else if (sortBy.operation === "sum") {
-        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {
-            throw new Error("Cannot have sum without at least 2 values");
-        }
+        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {}
 
         // add children values
killedBy: Armor Sorting Script evaluateSortBy with a sum error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot have sum without at least 2 values"

Received function did not throw

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:149:45
         }
 
         // add children values
-        for (const value of childrenValues) {
-            result += value;
-        }
+        for (const value of childrenValues) {}
 
         // add selected field values
killedBy: Armor Sorting Script evaluateSortBy with sum with children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9.5
Received: 0

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:150:13
 
         // add children values
         for (const value of childrenValues) {
-            result += value;
+            result -= value;
         }
 
killedBy: Armor Sorting Script evaluateSortBy with sum with children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9.5
Received: -9.5

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:154:35
         }
 
         // add selected field values
-        for (const key in sortBy) {
-            if (
-                isSelectableSortingField(key) &&
-                sortBy[key as SortByArmorKey]
-            ) {
-                // if defense
-                if (armor.defenses[key as DefensesMapKey]) {
-                    result += armor.defenses[key as DefensesMapKey]!;
-                }
-                // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
-                    result += armor.resistances[key as ResistancesMapKey]!;
-                }
-                // if poise
-                if (key === "poise") {
-                    result += armor.poise!;
-                }
-            }
-        }
+        for (const key in sortBy) {}
     }
 
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] LogicalOperator
armor/components/customSortBy/sorting.tsx:156:17
         // add selected field values
         for (const key in sortBy) {
             if (
-                isSelectableSortingField(key) &&
-                sortBy[key as SortByArmorKey]
+                isSelectableSortingField(key) || sortBy[key as SortByArmorKey]
             ) {
                 // if defense
killedBy: Armor Sorting Script evaluateSortBy with sum
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9.5
Received: 404

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:158:15
             if (
                 isSelectableSortingField(key) &&
                 sortBy[key as SortByArmorKey]
-            ) {
-                // if defense
-                if (armor.defenses[key as DefensesMapKey]) {
-                    result += armor.defenses[key as DefensesMapKey]!;
-                }
-                // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
-                    result += armor.resistances[key as ResistancesMapKey]!;
-                }
-                // if poise
-                if (key === "poise") {
-                    result += armor.poise!;
-                }
-            }
+            ) {}
         }
     }
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:160:21
                 sortBy[key as SortByArmorKey]
             ) {
                 // if defense
-                if (armor.defenses[key as DefensesMapKey]) {
+                if (true) {
                     result += armor.defenses[key as DefensesMapKey]!;
                 }
killedBy: Armor Sorting Script evaluateSortBy with sum with resistance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 76
Received: NaN

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:161:21
             ) {
                 // if defense
                 if (armor.defenses[key as DefensesMapKey]) {
-                    result += armor.defenses[key as DefensesMapKey]!;
+                    result -= armor.defenses[key as DefensesMapKey]!;
                 }
                 // if resistance
killedBy: Armor Sorting Script evaluateSortBy with sum
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9.5
Received: -9.5

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:164:66
                     result += armor.defenses[key as DefensesMapKey]!;
                 }
                 // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
-                    result += armor.resistances[key as ResistancesMapKey]!;
-                }
+                if (armor.resistances[key as ResistancesMapKey]) {}
                 // if poise
                 if (key === "poise") {
killedBy: Armor Sorting Script evaluateSortBy with sum with resistance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 76
Received: 0

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:165:21
                 }
                 // if resistance
                 if (armor.resistances[key as ResistancesMapKey]) {
-                    result += armor.resistances[key as ResistancesMapKey]!;
+                    result -= armor.resistances[key as ResistancesMapKey]!;
                 }
                 // if poise
killedBy: Armor Sorting Script evaluateSortBy with sum with resistance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 76
Received: -76

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:168:21
                     result += armor.resistances[key as ResistancesMapKey]!;
                 }
                 // if poise
-                if (key === "poise") {
+                if (false) {
                     result += armor.poise!;
                 }
killedBy: Armor Sorting Script evaluateSortBy with sum with poise
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 45
Received: 38

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:169:21
                 }
                 // if poise
                 if (key === "poise") {
-                    result += armor.poise!;
+                    result -= armor.poise!;
                 }
             }
killedBy: Armor Sorting Script evaluateSortBy with sum with poise
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 45
Received: 31

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:177:14
 
     // else if multiply is selected
     // multiply the children and every selected field
-    else if (sortBy.operation === "multiply") {
+    else if (sortBy.operation !== "multiply") {
         if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {
             throw new Error("Cannot multiply without at least 2 values");
killedBy: Armor Optimizer Script dominated
statusReason: Error: Cannot multiply without at least 2 values
