[Killed] ArithmeticOperator
armor/components/customSortBy/sorting.tsx:178:13
     // else if multiply is selected
     // multiply the children and every selected field
     else if (sortBy.operation === "multiply") {
-        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {
+        if (SELECTED_FIELDS_COUNT - CHILDREN_COUNT < 2) {
             throw new Error("Cannot multiply without at least 2 values");
         }
killedBy: Armor Sorting Script evaluateSortBy with multiply with children
statusReason: Error: Cannot multiply without at least 2 values

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:178:13
     // else if multiply is selected
     // multiply the children and every selected field
     else if (sortBy.operation === "multiply") {
-        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {
+        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT <= 2) {
             throw new Error("Cannot multiply without at least 2 values");
         }
killedBy: Armor Sorting Script evaluateSortBy with multiply
statusReason: Error: Cannot multiply without at least 2 values

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:185:45
         let factor = 1;
 
         // multiply children values
-        for (const value of childrenValues) {
-            factor *= value;
-        }
+        for (const value of childrenValues) {}
 
         // add selected field values
killedBy: Armor Sorting Script evaluateSortBy with multiply with children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22.5
Received: 1

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:186:13
 
         // multiply children values
         for (const value of childrenValues) {
-            factor *= value;
+            factor /= value;
         }
 
killedBy: Armor Sorting Script evaluateSortBy with multiply with children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22.5
Received: 0.044444444444444446

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:190:35
         }
 
         // add selected field values
-        for (const key in sortBy) {
-            if (
-                isSelectableSortingField(key) &&
-                sortBy[key as SortByArmorKey]
-            ) {
-                // if defense
-                if (armor.defenses[key as DefensesMapKey]) {
-                    factor *= armor.defenses[key as DefensesMapKey]!;
-                }
-                // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
-                    factor *= armor.resistances[key as ResistancesMapKey]!;
-                }
-                // if poise
-                if (key === "poise") {
-                    factor *= armor.poise!;
-                }
-            }
-        }
+        for (const key in sortBy) {}
 
         result = factor;
killedBy: Armor Sorting Script evaluateSortBy with multiply
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22.26
Received: 1

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:194:15
             if (
                 isSelectableSortingField(key) &&
                 sortBy[key as SortByArmorKey]
-            ) {
-                // if defense
-                if (armor.defenses[key as DefensesMapKey]) {
-                    factor *= armor.defenses[key as DefensesMapKey]!;
-                }
-                // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
-                    factor *= armor.resistances[key as ResistancesMapKey]!;
-                }
-                // if poise
-                if (key === "poise") {
-                    factor *= armor.poise!;
-                }
-            }
+            ) {}
         }
 
killedBy: Armor Sorting Script evaluateSortBy with multiply
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22.26
Received: 1

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:197:21
             ) {
                 // if defense
                 if (armor.defenses[key as DefensesMapKey]) {
-                    factor *= armor.defenses[key as DefensesMapKey]!;
+                    factor /= armor.defenses[key as DefensesMapKey]!;
                 }
                 // if resistance
killedBy: Armor Sorting Script evaluateSortBy with multiply
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22.26
Received: 0.044923629829290206

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:200:66
                     factor *= armor.defenses[key as DefensesMapKey]!;
                 }
                 // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
-                    factor *= armor.resistances[key as ResistancesMapKey]!;
-                }
+                if (armor.resistances[key as ResistancesMapKey]) {}
                 // if poise
                 if (key === "poise") {
killedBy: Armor Sorting Script evaluateSortBy with multiply with resistance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1444
Received: 1

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:200:21
                     factor *= armor.defenses[key as DefensesMapKey]!;
                 }
                 // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
+                if (true) {
                     factor *= armor.resistances[key as ResistancesMapKey]!;
                 }
killedBy: Armor Sorting Script evaluateSortBy with multiply
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22.26
Received: NaN

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:201:21
                 }
                 // if resistance
                 if (armor.resistances[key as ResistancesMapKey]) {
-                    factor *= armor.resistances[key as ResistancesMapKey]!;
+                    factor /= armor.resistances[key as ResistancesMapKey]!;
                 }
                 // if poise
killedBy: Armor Sorting Script evaluateSortBy with multiply with resistance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1444
Received: 0.0006925207756232687

[Killed] AssignmentOperator
armor/components/customSortBy/sorting.tsx:205:21
                 }
                 // if poise
                 if (key === "poise") {
-                    factor *= armor.poise!;
+                    factor /= armor.poise!;
                 }
             }
killedBy: Armor Sorting Script evaluateSortBy with multiply with poise
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 266
Received: 5.428571428571429

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:216:13
     // if average nor sum nor multiply is selected
     // get the value of the selected field or child
     else {
-        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT > 1) {
+        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT >= 1) {
             throw new Error(
                 "Cannot have more than 1 value without average, sum, or multiply"
killedBy: Armor Sorting Script evaluateSortBy with value
statusReason: Error: Cannot have more than 1 value without average, sum, or multiply

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:216:13
     // if average nor sum nor multiply is selected
     // get the value of the selected field or child
     else {
-        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT > 1) {
+        if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT <= 1) {
             throw new Error(
                 "Cannot have more than 1 value without average, sum, or multiply"
killedBy: Armor Sorting Script evaluateSortBy with a value error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot have more than 1 value without average, sum, or multiply"

Received function did not throw

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:222:35
             );
         }
 
-        for (const key in sortBy) {
-            // add children values
-            for (const value of childrenValues) {
-                result = value;
-            }
-
-            if (
-                isSelectableSortingField(key) &&
-                sortBy[key as SortByArmorKey]
-            ) {
-                // if defense
-                if (armor.defenses[key as DefensesMapKey]) {
-                    result = armor.defenses[key as DefensesMapKey]!;
-                }
-                // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
-                    result = armor.resistances[key as ResistancesMapKey]!;
-                }
-                // if poise
-                if (key === "poise") {
-                    result = armor.poise!;
-                }
-            }
-        }
+        for (const key in sortBy) {}
     }
 
killedBy: Armor Sorting Script evaluateSortBy with value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5.3
Received: 0

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:224:49
 
         for (const key in sortBy) {
             // add children values
-            for (const value of childrenValues) {
-                result = value;
-            }
+            for (const value of childrenValues) {}
 
             if (
killedBy: Armor Sorting Script evaluateSortBy with value with children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:231:15
             if (
                 isSelectableSortingField(key) &&
                 sortBy[key as SortByArmorKey]
-            ) {
-                // if defense
-                if (armor.defenses[key as DefensesMapKey]) {
-                    result = armor.defenses[key as DefensesMapKey]!;
-                }
-                // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
-                    result = armor.resistances[key as ResistancesMapKey]!;
-                }
-                // if poise
-                if (key === "poise") {
-                    result = armor.poise!;
-                }
-            }
+            ) {}
         }
     }
killedBy: Armor Sorting Script evaluateSortBy with value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5.3
Received: 0

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:233:60
                 sortBy[key as SortByArmorKey]
             ) {
                 // if defense
-                if (armor.defenses[key as DefensesMapKey]) {
-                    result = armor.defenses[key as DefensesMapKey]!;
-                }
+                if (armor.defenses[key as DefensesMapKey]) {}
                 // if resistance
                 if (armor.resistances[key as ResistancesMapKey]) {
killedBy: Armor Sorting Script evaluateSortBy with value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5.3
Received: 0

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:237:66
                     result = armor.defenses[key as DefensesMapKey]!;
                 }
                 // if resistance
-                if (armor.resistances[key as ResistancesMapKey]) {
-                    result = armor.resistances[key as ResistancesMapKey]!;
-                }
+                if (armor.resistances[key as ResistancesMapKey]) {}
                 // if poise
                 if (key === "poise") {
killedBy: Armor Sorting Script evaluateSortBy with value with resistance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 38
Received: 0

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:241:38
                     result = armor.resistances[key as ResistancesMapKey]!;
                 }
                 // if poise
-                if (key === "poise") {
-                    result = armor.poise!;
-                }
+                if (key === "poise") {}
             }
         }
killedBy: Armor Sorting Script evaluateSortBy with value with poise
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 0

[Killed] ArrayDeclaration
armor/components/customSortBy/sorting.tsx:261:28
 }
 
 export function marshallSortByToTokens(sortBy: SortByArmor): string[] {
-    let result: string[] = [];
+    let result: string[] = ["Stryker was here"];
 
     switch (sortBy.operation) {
killedBy: Armor Sorting Script marshallSortByToTokens with value
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "Stryker was here",
    "(",

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:264:9
     let result: string[] = [];
 
     switch (sortBy.operation) {
-        case "average":
-            result.push("AVG(");
-            break;
+        case "average":
         case "sum":
             result.push("SUM(");
killedBy: Armor Sorting Script marshallSortByToTokens with average
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "AVG(",
+   "SUM(",

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:267:9
         case "average":
             result.push("AVG(");
             break;
-        case "sum":
-            result.push("SUM(");
-            break;
+        case "sum":
         case "multiply":
             result.push("MULT(");
killedBy: Armor Sorting Script marshallSortByToTokens with sum
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "SUM(",
+   "MULT(",

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:270:9
         case "sum":
             result.push("SUM(");
             break;
-        case "multiply":
-            result.push("MULT(");
-            break;
+        case "multiply":
         case "value":
             result.push("(");
killedBy: Armor Sorting Script marshallSortByToTokens with multiply
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "MULT(",
+   "(",

[Killed] StringLiteral
armor/components/customSortBy/sorting.tsx:271:25
             result.push("SUM(");
             break;
         case "multiply":
-            result.push("MULT(");
+            result.push("");
             break;
         case "value":
killedBy: Armor Sorting Script marshallSortByToTokens with multiply
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "MULT(",
+   "",

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:273:9
         case "multiply":
             result.push("MULT(");
             break;
-        case "value":
-            result.push("(");
-            break;
+        case "value":
     }
 
killedBy: CustomizeSortBy submits formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "setCustomSortBy",
-   "closePopUp",

[Killed] StringLiteral
armor/components/customSortBy/sorting.tsx:274:25
             result.push("MULT(");
             break;
         case "value":
-            result.push("(");
+            result.push("");
             break;
     }
killedBy: Armor Sorting Script marshallSortByToTokens with value
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "(",
+   "",

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:278:70
             break;
     }
 
-    for (const child of sortBy.children as (number | SortByArmor)[]) {
-        if (typeof child === "number") {
-            result.push(child.toString());
-        } else {
-            result.push(...marshallSortByToTokens(child));
-        }
-    }
+    for (const child of sortBy.children as (number | SortByArmor)[]) {}
 
     for (const key in sortBy) {
killedBy: Armor Sorting Script marshallSortByToTokens with number child
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    "(",
-   "5",

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:279:40
     }
 
     for (const child of sortBy.children as (number | SortByArmor)[]) {
-        if (typeof child === "number") {
-            result.push(child.toString());
-        } else {
+        if (typeof child === "number") {} else {
             result.push(...marshallSortByToTokens(child));
         }
killedBy: Armor Sorting Script marshallSortByToTokens with number child
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    "(",
-   "5",

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:281:16
     for (const child of sortBy.children as (number | SortByArmor)[]) {
         if (typeof child === "number") {
             result.push(child.toString());
-        } else {
-            result.push(...marshallSortByToTokens(child));
-        }
+        } else {}
     }
 
killedBy: Armor Sorting Script marshallSortByToTokens with number child
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    "(",
-   "(",

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:286:31
         }
     }
 
-    for (const key in sortBy) {
-        if (isSelectableSortingField(key) && sortBy[key as SortByArmorKey]) {
-            result.push(key.toUpperCase());
-        }
-    }
+    for (const key in sortBy) {}
 
     result.push(")");
killedBy: Armor Sorting Script marshallSortByToTokens with value
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    "(",
-   "PHYSICAL",

[Killed] LogicalOperator
armor/components/customSortBy/sorting.tsx:287:13
     }
 
     for (const key in sortBy) {
-        if (isSelectableSortingField(key) && sortBy[key as SortByArmorKey]) {
+        if (isSelectableSortingField(key) || sortBy[key as SortByArmorKey]) {
             result.push(key.toUpperCase());
         }
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:287:13
     }
 
     for (const key in sortBy) {
-        if (isSelectableSortingField(key) && sortBy[key as SortByArmorKey]) {
+        if (true) {
             result.push(key.toUpperCase());
         }
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] MethodExpression
armor/components/customSortBy/sorting.tsx:288:25
 
     for (const key in sortBy) {
         if (isSelectableSortingField(key) && sortBy[key as SortByArmorKey]) {
-            result.push(key.toUpperCase());
+            result.push(key.toLowerCase());
         }
     }
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:307:9
 
 function parenthesesMatch(tokens: string[]): boolean {
     return (
-        tokens.reduce(
-            (count: number, token: string) =>
-                count + (token.includes("(") ? 1 : 0),
-            0
-        ) ===
-        tokens.reduce(
-            (count: number, token: string) =>
-                count + (token.includes(")") ? 1 : 0),
-            0
-        )
+        tokens.reduce((count: number, token: string) => count + (token.includes("(") ? 1 : 0), 0) !== tokens.reduce((count: number, token: string) => count + (token.includes(")") ? 1 : 0), 0)
     );
 }
killedBy: Armor Sorting Script unmarshallSortBy
statusReason: Error: Parentheses do not match

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:307:9
 
 function parenthesesMatch(tokens: string[]): boolean {
     return (
-        tokens.reduce(
-            (count: number, token: string) =>
-                count + (token.includes("(") ? 1 : 0),
-            0
-        ) ===
-        tokens.reduce(
-            (count: number, token: string) =>
-                count + (token.includes(")") ? 1 : 0),
-            0
-        )
+        false
     );
 }
killedBy: Armor Page load local storage
statusReason: Error: Parentheses do not match

[Killed] ArrowFunction
armor/components/customSortBy/sorting.tsx:308:13
 function parenthesesMatch(tokens: string[]): boolean {
     return (
         tokens.reduce(
-            (count: number, token: string) =>
-                count + (token.includes("(") ? 1 : 0),
+            () => undefined,
             0
         ) ===
killedBy: Armor Page load local storage
statusReason: Error: Parentheses do not match

[Killed] ArithmeticOperator
armor/components/customSortBy/sorting.tsx:309:17
     return (
         tokens.reduce(
             (count: number, token: string) =>
-                count + (token.includes("(") ? 1 : 0),
+                count - (token.includes("(") ? 1 : 0),
             0
         ) ===
killedBy: Armor Page load local storage
statusReason: Error: Parentheses do not match

[Killed] ArrowFunction
armor/components/customSortBy/sorting.tsx:313:13
             0
         ) ===
         tokens.reduce(
-            (count: number, token: string) =>
-                count + (token.includes(")") ? 1 : 0),
+            () => undefined,
             0
         )
killedBy: Armor Page load local storage
statusReason: Error: Parentheses do not match

[Killed] ArithmeticOperator
armor/components/customSortBy/sorting.tsx:314:17
         ) ===
         tokens.reduce(
             (count: number, token: string) =>
-                count + (token.includes(")") ? 1 : 0),
+                count - (token.includes(")") ? 1 : 0),
             0
         )
killedBy: Armor Page load local storage
statusReason: Error: Parentheses do not match

[Killed] LogicalOperator
armor/components/customSortBy/sorting.tsx:321:12
 }
 
 function tokenIsValid(token: string): boolean {
-    return VALID_TOKENS.includes(token) || !isNaN(Number(token));
+    return VALID_TOKENS.includes(token) && !isNaN(Number(token));
 }
 
killedBy: CustomizeSortBy submits formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "setCustomSortBy",
-   "closePopUp",

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:321:12
 }
 
 function tokenIsValid(token: string): boolean {
-    return VALID_TOKENS.includes(token) || !isNaN(Number(token));
+    return true;
 }
 
killedBy: Armor Sorting Script unmarshallSortBy with invalid token
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid token: INVALID"

Received function did not throw

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:334:34
     let currentGroup: string[] = [];
 
     for (const token of tokens) {
-        if (token.includes("(")) {
-            parenthesisDepth++;
-        } else if (token.includes(")")) {
+        if (token.includes("(")) {} else if (token.includes(")")) {
             parenthesisDepth--;
         }
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:334:13
     let currentGroup: string[] = [];
 
     for (const token of tokens) {
-        if (token.includes("(")) {
+        if (true) {
             parenthesisDepth++;
         } else if (token.includes(")")) {
killedBy: CustomizeSortBy submits formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "setCustomSortBy",
-   "closePopUp",

[Killed] UpdateOperator
armor/components/customSortBy/sorting.tsx:335:13
 
     for (const token of tokens) {
         if (token.includes("(")) {
-            parenthesisDepth++;
+            parenthesisDepth--;
         } else if (token.includes(")")) {
             parenthesisDepth--;
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:336:41
     for (const token of tokens) {
         if (token.includes("(")) {
             parenthesisDepth++;
-        } else if (token.includes(")")) {
-            parenthesisDepth--;
-        }
+        } else if (token.includes(")")) {}
 
         if (parenthesisDepth === 0) {
killedBy: FormulaField Renders with child
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

- SUM(
-     AVG(
-         PHYSICAL

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:336:20
     for (const token of tokens) {
         if (token.includes("(")) {
             parenthesisDepth++;
-        } else if (token.includes(")")) {
+        } else if (true) {
             parenthesisDepth--;
         }
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] UpdateOperator
armor/components/customSortBy/sorting.tsx:337:13
         if (token.includes("(")) {
             parenthesisDepth++;
         } else if (token.includes(")")) {
-            parenthesisDepth--;
+            parenthesisDepth++;
         }
 
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:340:37
             parenthesisDepth--;
         }
 
-        if (parenthesisDepth === 0) {
-            tokenTypes.push("string");
-            currentGroup.push(token);
-            childrenTokenGroups.push(currentGroup);
-            currentGroup = [];
-        }
+        if (parenthesisDepth === 0) {}
         if (parenthesisDepth === 1) {
             if (token.includes(")")) {
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:340:13
             parenthesisDepth--;
         }
 
-        if (parenthesisDepth === 0) {
+        if (parenthesisDepth !== 0) {
             tokenTypes.push("string");
             currentGroup.push(token);
killedBy: FormulaField Renders
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 3

  (
-     PHYSICAL
- )

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:346:13
             childrenTokenGroups.push(currentGroup);
             currentGroup = [];
         }
-        if (parenthesisDepth === 1) {
+        if (parenthesisDepth !== 1) {
             if (token.includes(")")) {
                 tokenTypes.push("SortByArmor");
killedBy: Armor Page load local storage
statusReason: RangeError: Invalid count value: -1

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:346:13
             childrenTokenGroups.push(currentGroup);
             currentGroup = [];
         }
-        if (parenthesisDepth === 1) {
+        if (true) {
             if (token.includes(")")) {
                 tokenTypes.push("SortByArmor");
killedBy: Armor Page load local storage
statusReason: RangeError: Invalid count value: -1

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:347:17
             currentGroup = [];
         }
         if (parenthesisDepth === 1) {
-            if (token.includes(")")) {
+            if (false) {
                 tokenTypes.push("SortByArmor");
                 currentGroup.push(token);
killedBy: Armor Sorting Script analyzeTokens
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -20,9 +20,9 @@
      "string",
      "number",

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:347:17
             currentGroup = [];
         }
         if (parenthesisDepth === 1) {
-            if (token.includes(")")) {
+            if (true) {
                 tokenTypes.push("SortByArmor");
                 currentGroup.push(token);
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL
