[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:352:47
                 currentGroup.push(token);
                 childrenTokenGroups.push(currentGroup);
                 currentGroup = [];
-            } else if (!isNaN(Number(token))) {
-                tokenTypes.push("number");
-                currentGroup.push(token);
-                childrenTokenGroups.push(currentGroup);
-                currentGroup = [];
-            } else {
+            } else if (!isNaN(Number(token))) {} else {
                 tokenTypes.push("string");
                 currentGroup.push(token);
killedBy: Armor Sorting Script analyzeTokens
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 0

@@ -2,13 +2,10 @@
    "tempChildrenTokenGroups": Array [
      Array [

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:352:24
                 currentGroup.push(token);
                 childrenTokenGroups.push(currentGroup);
                 currentGroup = [];
-            } else if (!isNaN(Number(token))) {
+            } else if (true) {
                 tokenTypes.push("number");
                 currentGroup.push(token);
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] ArrayDeclaration
armor/components/customSortBy/sorting.tsx:356:32
                 tokenTypes.push("number");
                 currentGroup.push(token);
                 childrenTokenGroups.push(currentGroup);
-                currentGroup = [];
+                currentGroup = ["Stryker was here"];
             } else {
                 tokenTypes.push("string");
killedBy: Armor Sorting Script analyzeTokens
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

@@ -5,10 +5,11 @@
      ],
      Array [

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:357:20
                 currentGroup.push(token);
                 childrenTokenGroups.push(currentGroup);
                 currentGroup = [];
-            } else {
-                tokenTypes.push("string");
-                currentGroup.push(token);
-                childrenTokenGroups.push(currentGroup);
-                currentGroup = [];
-            }
+            } else {}
         } else if (parenthesisDepth > 1) {
             tokenTypes.push("SortByArmor");
killedBy: Armor Page load local storage
statusReason: RangeError: Invalid count value: -1

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:363:20
                 childrenTokenGroups.push(currentGroup);
                 currentGroup = [];
             }
-        } else if (parenthesisDepth > 1) {
+        } else if (true) {
             tokenTypes.push("SortByArmor");
             currentGroup.push(token);
killedBy: Armor Sorting Script analyzeTokens
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

@@ -22,7 +22,8 @@
      "SortByArmor",
      "SortByArmor",

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:363:20
                 childrenTokenGroups.push(currentGroup);
                 currentGroup = [];
             }
-        } else if (parenthesisDepth > 1) {
+        } else if (false) {
             tokenTypes.push("SortByArmor");
             currentGroup.push(token);
killedBy: Armor Sorting Script analyzeTokens
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 0

@@ -5,24 +5,18 @@
      ],
      Array [

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:377:9
 
 function getOperation(token: string): "average" | "sum" | "multiply" | "value" {
     switch (token) {
-        case "AVG(":
-            return "average";
+        case "AVG(":
         case "SUM(":
             return "sum";
killedBy: Armor Sorting Script unmarshallSortBy with average
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,11 +7,11 @@
    "holy": false,
    "label": "Default",

[Killed] StringLiteral
armor/components/customSortBy/sorting.tsx:377:14
 
 function getOperation(token: string): "average" | "sum" | "multiply" | "value" {
     switch (token) {
-        case "AVG(":
+        case "":
             return "average";
         case "SUM(":
killedBy: Armor Sorting Script unmarshallSortBy with average
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,11 +7,11 @@
    "holy": false,
    "label": "Default",

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:379:9
     switch (token) {
         case "AVG(":
             return "average";
-        case "SUM(":
-            return "sum";
+        case "SUM(":
         case "MULT(":
             return "multiply";
killedBy: Armor Sorting Script unmarshallSortBy with sum
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,11 +7,11 @@
    "holy": false,
    "label": "Default",

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:381:9
             return "average";
         case "SUM(":
             return "sum";
-        case "MULT(":
-            return "multiply";
+        case "MULT(":
         default:
             return "value";
killedBy: Armor Sorting Script unmarshallSortBy with multiply
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,11 +7,11 @@
    "holy": false,
    "label": "Default",

[Killed] ArithmeticOperator
armor/components/customSortBy/sorting.tsx:397:25
 } {
     let fields: (DefensesMapKey | ResistancesMapKey | "poise")[] = [];
     let numbers: number[] = [];
-    for (let i = 1; i < tokens.length - 1; i++) {
+    for (let i = 1; i < tokens.length + 1; i++) {
         if (tokenTypes[i] === "number") {
             numbers.push(Number(tokens[i]));
killedBy: Armor Sorting Script unmarshallSortBy
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

@@ -1,6 +1,7 @@
  Object {
+   ")": true,

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:397:21
 } {
     let fields: (DefensesMapKey | ResistancesMapKey | "poise")[] = [];
     let numbers: number[] = [];
-    for (let i = 1; i < tokens.length - 1; i++) {
+    for (let i = 1; false; i++) {
         if (tokenTypes[i] === "number") {
             numbers.push(Number(tokens[i]));
killedBy: Armor Sorting Script unmarshallSortBy
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -8,11 +8,11 @@
    "label": "Default",
    "lightning": false,

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:398:41
     let fields: (DefensesMapKey | ResistancesMapKey | "poise")[] = [];
     let numbers: number[] = [];
     for (let i = 1; i < tokens.length - 1; i++) {
-        if (tokenTypes[i] === "number") {
-            numbers.push(Number(tokens[i]));
-        } else if (tokenTypes[i] === "string") {
+        if (tokenTypes[i] === "number") {} else if (tokenTypes[i] === "string") {
             fields.push(
                 tokens[i].toLowerCase() as
killedBy: Armor Sorting Script unmarshallSortBy with number
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

@@ -1,9 +1,7 @@
  Object {
-   "children": Array [

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:398:13
     let fields: (DefensesMapKey | ResistancesMapKey | "poise")[] = [];
     let numbers: number[] = [];
     for (let i = 1; i < tokens.length - 1; i++) {
-        if (tokenTypes[i] === "number") {
+        if (true) {
             numbers.push(Number(tokens[i]));
         } else if (tokenTypes[i] === "string") {
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:400:20
     for (let i = 1; i < tokens.length - 1; i++) {
         if (tokenTypes[i] === "number") {
             numbers.push(Number(tokens[i]));
-        } else if (tokenTypes[i] === "string") {
+        } else if (tokenTypes[i] !== "string") {
             fields.push(
                 tokens[i].toLowerCase() as
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:400:20
     for (let i = 1; i < tokens.length - 1; i++) {
         if (tokenTypes[i] === "number") {
             numbers.push(Number(tokens[i]));
-        } else if (tokenTypes[i] === "string") {
+        } else if (true) {
             fields.push(
                 tokens[i].toLowerCase() as
killedBy: Armor Sorting Script unmarshallSortBy with child
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 4

@@ -1,6 +1,7 @@
  Object {
+   ")": true,

[Killed] ArithmeticOperator
armor/components/customSortBy/sorting.tsx:419:45
     let result: SortByArmor = structuredClone(DEFAULT_SORTBYARMOR);
 
     // if the first token is not an opening parenthesis, or the last token is not a closing parenthesis, throw an error
-    if (!tokens[0].includes("(") || !tokens[tokens.length - 1].includes(")")) {
+    if (!tokens[0].includes("(") || !tokens[tokens.length + 1].includes(")")) {
         throw new Error("Missing opening and/or closing parenthesis");
     }
killedBy: Armor Sorting Script unmarshallSortBy
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:419:9
     let result: SortByArmor = structuredClone(DEFAULT_SORTBYARMOR);
 
     // if the first token is not an opening parenthesis, or the last token is not a closing parenthesis, throw an error
-    if (!tokens[0].includes("(") || !tokens[tokens.length - 1].includes(")")) {
+    if (tokens[0].includes("(") || !tokens[tokens.length - 1].includes(")")) {
         throw new Error("Missing opening and/or closing parenthesis");
     }
killedBy: Armor Page load local storage
statusReason: Error: Missing opening and/or closing parenthesis

[Killed] StringLiteral
armor/components/customSortBy/sorting.tsx:420:25
 
     // if the first token is not an opening parenthesis, or the last token is not a closing parenthesis, throw an error
     if (!tokens[0].includes("(") || !tokens[tokens.length - 1].includes(")")) {
-        throw new Error("Missing opening and/or closing parenthesis");
+        throw new Error("");
     }
 
killedBy: Armor Sorting Script unmarshallSortBy with invalid opening parenthesis
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Missing opening and/or closing parenthesis"
Received message:   ""

      702 |       } else {
      703 |         stryCov_9fa48("401");
    > 704 |         throw new Error(stryMutAct_9fa48("402") ? "" : (stryCov_9fa48("402"), "Missing opening and/or closing parenthesis"));

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:424:9
     }
 
     // if the number of opening and closing parentheses do not match, throw an error
-    if (!parenthesesMatch(tokens)) {
+    if (false) {
         throw new Error("Parentheses do not match");
     }
killedBy: Armor Sorting Script unmarshallSortBy with invalid closing parenthesis
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Parentheses do not match"
Received message:   "Invalid token: INVALID"

      727 |           } else {
      728 |             stryCov_9fa48("412");
    > 729 |             throw new Error((stryMutAct_9fa48("413") ? "" : (stryCov_9fa48("413"), "Invalid token: ")) + token);

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:424:9
     }
 
     // if the number of opening and closing parentheses do not match, throw an error
-    if (!parenthesesMatch(tokens)) {
+    if (true) {
         throw new Error("Parentheses do not match");
     }
killedBy: Armor Sorting Script unmarshallSortBy
statusReason: Error: Parentheses do not match

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:429:33
     }
 
     // if any token is not valid, throw an error
-    for (const token of tokens) {
-        if (!tokenIsValid(token)) {
-            throw new Error("Invalid token: " + token);
-        }
-    }
+    for (const token of tokens) {}
 
     // map each token to its type (number, selectable field, or SortByArmor object)
killedBy: Armor Sorting Script unmarshallSortBy with invalid token
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid token: INVALID"

Received function did not throw

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:430:35
 
     // if any token is not valid, throw an error
     for (const token of tokens) {
-        if (!tokenIsValid(token)) {
-            throw new Error("Invalid token: " + token);
-        }
+        if (!tokenIsValid(token)) {}
     }
 
killedBy: Armor Sorting Script unmarshallSortBy with invalid token
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid token: INVALID"

Received function did not throw

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:430:13
 
     // if any token is not valid, throw an error
     for (const token of tokens) {
-        if (!tokenIsValid(token)) {
+        if (tokenIsValid(token)) {
             throw new Error("Invalid token: " + token);
         }
killedBy: Armor Page load local storage
statusReason: Error: Invalid token: (

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:447:33
 
     // determine which fields are selected
     const { fields, numbers } = getSelectedFields(tokens, tokenTypes);
-    for (const field of fields) {
-        result[field] = true;
-    }
+    for (const field of fields) {}
     result.children.push(...numbers);
 
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:448:25
     // determine which fields are selected
     const { fields, numbers } = getSelectedFields(tokens, tokenTypes);
     for (const field of fields) {
-        result[field] = true;
+        result[field] = false;
     }
     result.children.push(...numbers);
killedBy: Armor Sorting Script unmarshallSortBy
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -8,11 +8,11 @@
    "label": "Default",
    "lightning": false,

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:453:43
     result.children.push(...numbers);
 
     // if there are children, process them recursively
-    for (const group of childTokenGroups) {
-        if (group.length > 1) {
-            const child = processUnmarshallTokens(group);
-            result.children.push(child);
-        }
-    }
+    for (const group of childTokenGroups) {}
 
     return result;
killedBy: Armor Sorting Script unmarshallSortBy with child
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 21
+ Received  +  0

@@ -1,29 +1,8 @@
  Object {
    "children": Array [

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:454:13
 
     // if there are children, process them recursively
     for (const group of childTokenGroups) {
-        if (group.length > 1) {
+        if (group.length <= 1) {
             const child = processUnmarshallTokens(group);
             result.children.push(child);
killedBy: Armor Page load local storage
statusReason: Error: Missing opening and/or closing parenthesis

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:454:31
 
     // if there are children, process them recursively
     for (const group of childTokenGroups) {
-        if (group.length > 1) {
-            const child = processUnmarshallTokens(group);
-            result.children.push(child);
-        }
+        if (group.length > 1) {}
     }
 
killedBy: Armor Sorting Script unmarshallSortBy with child
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 21
+ Received  +  0

@@ -1,29 +1,8 @@
  Object {
    "children": Array [

[Killed] MethodExpression
armor/components/customSortBy/sorting.tsx:467:35
     const tokenGroups: string[][] = getChildTokenGroups(tokens);
 
     // errors
-    const SELECTED_FIELDS_COUNT = tokenGroups.filter(
-        (group) =>
-            group.length === 1 &&
-            !group[0].includes("(") &&
-            !group[0].includes(")")
-    ).length;
+    const SELECTED_FIELDS_COUNT = tokenGroups.length;
     const CHILDREN_COUNT = tokenGroups.filter(
         (group) => group.length > 1
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average or sum

[Killed] ArrowFunction
armor/components/customSortBy/sorting.tsx:468:9
 
     // errors
     const SELECTED_FIELDS_COUNT = tokenGroups.filter(
-        (group) =>
-            group.length === 1 &&
-            !group[0].includes("(") &&
-            !group[0].includes(")")
+        () => undefined
     ).length;
     const CHILDREN_COUNT = tokenGroups.filter(
killedBy: Armor Sorting Script unmarshallSortBy with average
statusReason: Error: Cannot have average without at least 2 values

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:469:13
     // errors
     const SELECTED_FIELDS_COUNT = tokenGroups.filter(
         (group) =>
-            group.length === 1 &&
+            group.length !== 1 &&
             !group[0].includes("(") &&
             !group[0].includes(")")
killedBy: Armor Sorting Script unmarshallSortBy with average
statusReason: Error: Cannot have average without at least 2 values

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:469:13
     // errors
     const SELECTED_FIELDS_COUNT = tokenGroups.filter(
         (group) =>
-            group.length === 1 &&
-            !group[0].includes("(") &&
-            !group[0].includes(")")
+            true
     ).length;
     const CHILDREN_COUNT = tokenGroups.filter(
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average or sum

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:470:13
     const SELECTED_FIELDS_COUNT = tokenGroups.filter(
         (group) =>
             group.length === 1 &&
-            !group[0].includes("(") &&
+            group[0].includes("(") &&
             !group[0].includes(")")
     ).length;
killedBy: Armor Sorting Script unmarshallSortBy with average
statusReason: Error: Cannot have average without at least 2 values

[Killed] StringLiteral
armor/components/customSortBy/sorting.tsx:470:32
     const SELECTED_FIELDS_COUNT = tokenGroups.filter(
         (group) =>
             group.length === 1 &&
-            !group[0].includes("(") &&
+            !group[0].includes("") &&
             !group[0].includes(")")
     ).length;
killedBy: Armor Sorting Script unmarshallSortBy with average
statusReason: Error: Cannot have average without at least 2 values

[Killed] BooleanLiteral
armor/components/customSortBy/sorting.tsx:471:13
         (group) =>
             group.length === 1 &&
             !group[0].includes("(") &&
-            !group[0].includes(")")
+            group[0].includes(")")
     ).length;
     const CHILDREN_COUNT = tokenGroups.filter(
killedBy: Armor Sorting Script unmarshallSortBy with average
statusReason: Error: Cannot have average without at least 2 values

[Killed] MethodExpression
armor/components/customSortBy/sorting.tsx:473:28
             !group[0].includes("(") &&
             !group[0].includes(")")
     ).length;
-    const CHILDREN_COUNT = tokenGroups.filter(
-        (group) => group.length > 1
-    ).length;
+    const CHILDREN_COUNT = tokenGroups.length;
 
     // if sum, average, or multiply is true, assert at least 2 values
killedBy: Armor Sorting Script unmarshallSortBy
statusReason: Error: Cannot have more than 1 value without average or sum

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:474:20
             !group[0].includes(")")
     ).length;
     const CHILDREN_COUNT = tokenGroups.filter(
-        (group) => group.length > 1
+        (group) => true
     ).length;
 
killedBy: Armor Sorting Script unmarshallSortBy
statusReason: Error: Cannot have more than 1 value without average or sum

[Killed] ArrowFunction
armor/components/customSortBy/sorting.tsx:474:9
             !group[0].includes(")")
     ).length;
     const CHILDREN_COUNT = tokenGroups.filter(
-        (group) => group.length > 1
+        () => undefined
     ).length;
 
killedBy: Armor Sorting Script unmarshallSortBy with child
statusReason: Error: Cannot multiply without at least 2 values

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:478:53
     ).length;
 
     // if sum, average, or multiply is true, assert at least 2 values
-    if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {
-        if (tokens[0].includes("SUM")) {
-            throw new Error("Cannot have sum without at least 2 values");
-        }
-        if (tokens[0].includes("AVG")) {
-            throw new Error("Cannot have average without at least 2 values");
-        }
-        if (tokens[0].includes("MULT")) {
-            throw new Error("Cannot multiply without at least 2 values");
-        }
-    }
+    if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {}
 
     // if operation is value, assert at most 1 value
killedBy: Armor Sorting Script unmarshallSortBy with sum error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot have sum without at least 2 values"

Received function did not throw

[Killed] ArithmeticOperator
armor/components/customSortBy/sorting.tsx:478:9
     ).length;
 
     // if sum, average, or multiply is true, assert at least 2 values
-    if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {
+    if (SELECTED_FIELDS_COUNT - CHILDREN_COUNT < 2) {
         if (tokens[0].includes("SUM")) {
             throw new Error("Cannot have sum without at least 2 values");
killedBy: Armor Sorting Script unmarshallSortBy with child
statusReason: Error: Cannot multiply without at least 2 values

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:479:13
 
     // if sum, average, or multiply is true, assert at least 2 values
     if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {
-        if (tokens[0].includes("SUM")) {
+        if (false) {
             throw new Error("Cannot have sum without at least 2 values");
         }
killedBy: Armor Sorting Script unmarshallSortBy with sum error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot have sum without at least 2 values"

Received function did not throw

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:479:40
 
     // if sum, average, or multiply is true, assert at least 2 values
     if (SELECTED_FIELDS_COUNT + CHILDREN_COUNT < 2) {
-        if (tokens[0].includes("SUM")) {
-            throw new Error("Cannot have sum without at least 2 values");
-        }
+        if (tokens[0].includes("SUM")) {}
         if (tokens[0].includes("AVG")) {
             throw new Error("Cannot have average without at least 2 values");
killedBy: Armor Sorting Script unmarshallSortBy with sum error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot have sum without at least 2 values"

Received function did not throw

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:482:40
         if (tokens[0].includes("SUM")) {
             throw new Error("Cannot have sum without at least 2 values");
         }
-        if (tokens[0].includes("AVG")) {
-            throw new Error("Cannot have average without at least 2 values");
-        }
+        if (tokens[0].includes("AVG")) {}
         if (tokens[0].includes("MULT")) {
             throw new Error("Cannot multiply without at least 2 values");
killedBy: Armor Sorting Script unmarshallSortBy with average error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot have average without at least 2 values"

Received function did not throw

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:482:13
         if (tokens[0].includes("SUM")) {
             throw new Error("Cannot have sum without at least 2 values");
         }
-        if (tokens[0].includes("AVG")) {
+        if (true) {
             throw new Error("Cannot have average without at least 2 values");
         }
killedBy: Armor Sorting Script unmarshallSortBy
statusReason: Error: Cannot have average without at least 2 values

[Killed] BlockStatement
armor/components/customSortBy/sorting.tsx:485:41
         if (tokens[0].includes("AVG")) {
             throw new Error("Cannot have average without at least 2 values");
         }
-        if (tokens[0].includes("MULT")) {
-            throw new Error("Cannot multiply without at least 2 values");
-        }
+        if (tokens[0].includes("MULT")) {}
     }
 
killedBy: Armor Sorting Script unmarshallSortBy with multiply error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot multiply without at least 2 values"

Received function did not throw

[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:485:13
         if (tokens[0].includes("AVG")) {
             throw new Error("Cannot have average without at least 2 values");
         }
-        if (tokens[0].includes("MULT")) {
+        if (true) {
             throw new Error("Cannot multiply without at least 2 values");
         }
killedBy: Armor Page load local storage
statusReason: Error: Cannot multiply without at least 2 values

[Killed] StringLiteral
armor/components/customSortBy/sorting.tsx:486:29
             throw new Error("Cannot have average without at least 2 values");
         }
         if (tokens[0].includes("MULT")) {
-            throw new Error("Cannot multiply without at least 2 values");
+            throw new Error("");
         }
     }
killedBy: Armor Sorting Script unmarshallSortBy with multiply error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot multiply without at least 2 values"
Received message:   ""

      816 |           } else {
      817 |             stryCov_9fa48("461");
    > 818 |             throw new Error(stryMutAct_9fa48("462") ? "" : (stryCov_9fa48("462"), "Cannot multiply without at least 2 values"));

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:491:30
     }
 
     // if operation is value, assert at most 1 value
-    if (tokens[0] === "(" && SELECTED_FIELDS_COUNT + CHILDREN_COUNT > 1) {
+    if (tokens[0] === "(" && SELECTED_FIELDS_COUNT + CHILDREN_COUNT <= 1) {
         throw new Error("Cannot have more than 1 value without average or sum");
     }
killedBy: Armor Sorting Script unmarshallSortBy
statusReason: Error: Cannot have more than 1 value without average or sum

[Killed] LogicalOperator
armor/components/customSortBy/sorting.tsx:491:9
     }
 
     // if operation is value, assert at most 1 value
-    if (tokens[0] === "(" && SELECTED_FIELDS_COUNT + CHILDREN_COUNT > 1) {
+    if (tokens[0] === "(" || SELECTED_FIELDS_COUNT + CHILDREN_COUNT > 1) {
         throw new Error("Cannot have more than 1 value without average or sum");
     }
killedBy: Armor Page load local storage
statusReason: Error: Cannot have more than 1 value without average or sum

[Survived] BlockStatement
armor/components/customSortBy/sorting.tsx:495:38
         throw new Error("Cannot have more than 1 value without average or sum");
     }
 
-    for (const group of tokenGroups) {
-        if (group.length > 1) {
-            validateTokens(group);
-        }
-    }
+    for (const group of tokenGroups) {}
 }
 

[Timeout] EqualityOperator
armor/components/customSortBy/sorting.tsx:496:13
     }
 
     for (const group of tokenGroups) {
-        if (group.length > 1) {
+        if (group.length <= 1) {
             validateTokens(group);
         }

[Timeout] ConditionalExpression
armor/components/customSortBy/sorting.tsx:496:13
     }
 
     for (const group of tokenGroups) {
-        if (group.length > 1) {
+        if (true) {
             validateTokens(group);
         }

[Killed] MethodExpression
armor/components/customSortBy/sorting.tsx:504:30
 
 export function unmarshallSortBy(sortBy: string): SortByArmor {
     // tokenize the string
-    const tokens: string[] = sortBy
-        .split(RegExp("[\n\r ]"))
-        .filter((token) => token !== "");
+    const tokens: string[] = sortBy.split(RegExp("[\n\r ]"));
 
     // remove any returns and tabs
killedBy: CustomizeSortBy submits formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "setCustomSortBy",
-   "closePopUp",
