[Killed] ConditionalExpression
armor/components/customSortBy/sorting.tsx:506:28
     // tokenize the string
     const tokens: string[] = sortBy
         .split(RegExp("[\n\r ]"))
-        .filter((token) => token !== "");
+        .filter((token) => true);
 
     // remove any returns and tabs
killedBy: CustomizeSortBy submits formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "setCustomSortBy",
-   "closePopUp",

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:506:28
     // tokenize the string
     const tokens: string[] = sortBy
         .split(RegExp("[\n\r ]"))
-        .filter((token) => token !== "");
+        .filter((token) => token === "");
 
     // remove any returns and tabs
killedBy: Armor Page load local storage
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

[Killed] UpdateOperator
armor/components/customSortBy/sorting.tsx:509:40
         .filter((token) => token !== "");
 
     // remove any returns and tabs
-    for (let i = 0; i < tokens.length; i++) {
+    for (let i = 0; i < tokens.length; i--) {
         tokens[i] = tokens[i]
             .replace(/\n/g, "")
killedBy: CustomizeSortBy submits formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "setCustomSortBy",
-   "closePopUp",

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:509:21
         .filter((token) => token !== "");
 
     // remove any returns and tabs
-    for (let i = 0; i < tokens.length; i++) {
+    for (let i = 0; i <= tokens.length; i++) {
         tokens[i] = tokens[i]
             .replace(/\n/g, "")
killedBy: CustomizeSortBy submits formula
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "setCustomSortBy",
-   "closePopUp",

[Survived] MethodExpression
armor/components/customSortBy/sorting.tsx:510:21
 
     // remove any returns and tabs
     for (let i = 0; i < tokens.length; i++) {
-        tokens[i] = tokens[i]
-            .replace(/\n/g, "")
-            .replace(/\r/g, "")
-            .replace(/\t/g, "")
-            .trim();
+        tokens[i] = tokens[i].replace(/\n/g, "").replace(/\r/g, "").replace(/\t/g, "");
     }
 

[Survived] StringLiteral
armor/components/customSortBy/sorting.tsx:512:29
     for (let i = 0; i < tokens.length; i++) {
         tokens[i] = tokens[i]
             .replace(/\n/g, "")
-            .replace(/\r/g, "")
+            .replace(/\r/g, "Stryker was here!")
             .replace(/\t/g, "")
             .trim();

[Survived] StringLiteral
armor/components/customSortBy/sorting.tsx:513:29
         tokens[i] = tokens[i]
             .replace(/\n/g, "")
             .replace(/\r/g, "")
-            .replace(/\t/g, "")
+            .replace(/\t/g, "Stryker was here!")
             .trim();
     }

[Killed] UpdateOperator
armor/components/customSortBy/sorting.tsx:518:40
     }
 
     // remove any commas
-    for (let i = 0; i < tokens.length; i++) {
+    for (let i = 0; i < tokens.length; i--) {
         tokens[i] = tokens[i].replace(",", "");
     }
killedBy: Armor Page load local storage
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] EqualityOperator
armor/components/customSortBy/sorting.tsx:518:21
     }
 
     // remove any commas
-    for (let i = 0; i < tokens.length; i++) {
+    for (let i = 0; i <= tokens.length; i++) {
         tokens[i] = tokens[i].replace(",", "");
     }
killedBy: Armor Page load local storage
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')
