[Killed] StringLiteral
src/app/armor/page.tsx:46:42
     const [currentEquipLoad, setCurrentEquipLoad] = useState(0);
     const [equipLoadBudget, setEquipLoadBudget] = useState(21);
     const [breakpoint, setBreakpoint] = useState(0.7);
-    const [sortBy, setSortBy] = useState("total-standard");
+    const [sortBy, setSortBy] = useState("");
     const [lockedItems, setLockedItems] = useState<ArmorSet>({
         helmet: undefined,
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'children')

[Killed] BooleanLiteral
src/app/armor/page.tsx:59:60
     const [gauntlets, setGauntlets] = useState(Array<Armor>());
     const [leggings, setLeggings] = useState(Array<Armor>());
     const [pressedKeys, setPressedKeys] = useState(new Set());
-    const [customizeSortBy, setCustomizeSortBy] = useState(false);
+    const [customizeSortBy, setCustomizeSortBy] = useState(true);
     const [customSortBy, setCustomSortBy] = useState<SortByArmor>(
         deepCloneAndMap(DEFAULT_SORTBYARMOR, [{ label: "Custom" }])
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Survived] StringLiteral
src/app/armor/page.tsx:61:56
     const [pressedKeys, setPressedKeys] = useState(new Set());
     const [customizeSortBy, setCustomizeSortBy] = useState(false);
     const [customSortBy, setCustomSortBy] = useState<SortByArmor>(
-        deepCloneAndMap(DEFAULT_SORTBYARMOR, [{ label: "Custom" }])
+        deepCloneAndMap(DEFAULT_SORTBYARMOR, [{ label: "" }])
     );
     const [bossSortBy, setBossSortBy] =

[Killed] StringLiteral
src/app/armor/page.tsx:64:33
         deepCloneAndMap(DEFAULT_SORTBYARMOR, [{ label: "Custom" }])
     );
     const [bossSortBy, setBossSortBy] =
-        useState<SortByBossKey>("abductor-virgins");
+        useState<SortByBossKey>("");
 
     const hotkeyGroups = useMemo(
killedBy: Armor Page gets SortByArmor
statusReason: TypeError: Cannot read properties of undefined (reading 'children')

[Killed] ArrayDeclaration
src/app/armor/page.tsx:67:15
         useState<SortByBossKey>("abductor-virgins");
 
     const hotkeyGroups = useMemo(
-        () => [
-            ["`", "1", "2", "3"],
-            ["4", "5", "6", "7"],
-            ["8", "9", "0", "-"],
-        ],
+        () => [],
         []
     );
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
src/app/armor/page.tsx:68:19
 
     const hotkeyGroups = useMemo(
         () => [
-            ["`", "1", "2", "3"],
+            ["`", "", "2", "3"],
             ["4", "5", "6", "7"],
             ["8", "9", "0", "-"],
killedBy: Armor Page ignores single armor using keyboard
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] StringLiteral
src/app/armor/page.tsx:69:14
     const hotkeyGroups = useMemo(
         () => [
             ["`", "1", "2", "3"],
-            ["4", "5", "6", "7"],
+            ["", "5", "6", "7"],
             ["8", "9", "0", "-"],
         ],
killedBy: Armor Page ignores single armor using keyboard
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4

[Killed] ArrayDeclaration
src/app/armor/page.tsx:69:13
     const hotkeyGroups = useMemo(
         () => [
             ["`", "1", "2", "3"],
-            ["4", "5", "6", "7"],
+            [],
             ["8", "9", "0", "-"],
         ],
killedBy: Armor Page ignores single armor using keyboard
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4

[Killed] ArrayDeclaration
src/app/armor/page.tsx:70:13
         () => [
             ["`", "1", "2", "3"],
             ["4", "5", "6", "7"],
-            ["8", "9", "0", "-"],
+            [],
         ],
         []
killedBy: Armor Page ignores single armor using keyboard
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 8

[Killed] BlockStatement
src/app/armor/page.tsx:76:35
     );
 
     // HELPER FUNCTIONS
-    const ignoreAll = (): void => {
-        // filter out No Helmet, No Chestpiece, No Gauntlets, No Leggings
-        var completeList = [
-            ...HELMETS.slice(1),
-            ...CHESTPIECES.slice(1),
-            ...GAUNTLETS.slice(1),
-            ...LEGGINGS.slice(1),
-        ];
-        setIgnoredItems(completeList);
-    };
+    const ignoreAll = (): void => {};
 
     const restoreAll = (): void => {
killedBy: Armor Page ignores/restores all armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 706
Received: 0

[Killed] MethodExpression
src/app/armor/page.tsx:79:16
     const ignoreAll = (): void => {
         // filter out No Helmet, No Chestpiece, No Gauntlets, No Leggings
         var completeList = [
-            ...HELMETS.slice(1),
+            ...HELMETS,
             ...CHESTPIECES.slice(1),
             ...GAUNTLETS.slice(1),
killedBy: Armor Page ignores/restores all armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 706
Received: 707

[Killed] MethodExpression
src/app/armor/page.tsx:80:16
         // filter out No Helmet, No Chestpiece, No Gauntlets, No Leggings
         var completeList = [
             ...HELMETS.slice(1),
-            ...CHESTPIECES.slice(1),
+            ...CHESTPIECES,
             ...GAUNTLETS.slice(1),
             ...LEGGINGS.slice(1),
killedBy: Armor Page ignores/restores all armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 706
Received: 707

[Killed] MethodExpression
src/app/armor/page.tsx:81:16
         var completeList = [
             ...HELMETS.slice(1),
             ...CHESTPIECES.slice(1),
-            ...GAUNTLETS.slice(1),
+            ...GAUNTLETS,
             ...LEGGINGS.slice(1),
         ];
killedBy: Armor Page ignores/restores all armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 706
Received: 707

[Killed] MethodExpression
src/app/armor/page.tsx:82:16
             ...HELMETS.slice(1),
             ...CHESTPIECES.slice(1),
             ...GAUNTLETS.slice(1),
-            ...LEGGINGS.slice(1),
+            ...LEGGINGS,
         ];
         setIgnoredItems(completeList);
killedBy: Armor Page ignores/restores all armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 706
Received: 707

[Killed] BlockStatement
src/app/armor/page.tsx:87:36
         setIgnoredItems(completeList);
     };
 
-    const restoreAll = (): void => {
-        setIgnoredItems([]);
-    };
+    const restoreAll = (): void => {};
 
     // CALLBACKS
killedBy: Armor Page ignores/restores all armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 706

[Killed] ConditionalExpression
src/app/armor/page.tsx:96:17
         (event: KeyboardEvent): void => {
             setPressedKeys((prevKeys) => new Set(prevKeys).add(event.key));
 
-            if (pressedKeys.has("Control") && pressedKeys.has("i")) {
+            if (false) {
                 event.preventDefault();
                 switch (event.key) {
killedBy: Armor Page ignores single armor using keyboard
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] ConditionalExpression
src/app/armor/page.tsx:96:17
         (event: KeyboardEvent): void => {
             setPressedKeys((prevKeys) => new Set(prevKeys).add(event.key));
 
-            if (pressedKeys.has("Control") && pressedKeys.has("i")) {
+            if (true) {
                 event.preventDefault();
                 switch (event.key) {

[Survived] ConditionalExpression
src/app/armor/page.tsx:99:21
             if (pressedKeys.has("Control") && pressedKeys.has("i")) {
                 event.preventDefault();
                 switch (event.key) {
-                    case hotkeyGroups[0][0]:
-                        setIgnoredItems([...ignoredItems, best[0].helmet!]);
-                        break;
+                    case hotkeyGroups[0][0]:
                     case hotkeyGroups[0][1]:
                         setIgnoredItems([...ignoredItems, best[0].chestpiece!]);

[Survived] ConditionalExpression
src/app/armor/page.tsx:102:21
                     case hotkeyGroups[0][0]:
                         setIgnoredItems([...ignoredItems, best[0].helmet!]);
                         break;
-                    case hotkeyGroups[0][1]:
-                        setIgnoredItems([...ignoredItems, best[0].chestpiece!]);
-                        break;
+                    case hotkeyGroups[0][1]:
                     case hotkeyGroups[0][2]:
                         setIgnoredItems([...ignoredItems, best[0].gauntlets!]);

[Survived] ConditionalExpression
src/app/armor/page.tsx:105:21
                     case hotkeyGroups[0][1]:
                         setIgnoredItems([...ignoredItems, best[0].chestpiece!]);
                         break;
-                    case hotkeyGroups[0][2]:
-                        setIgnoredItems([...ignoredItems, best[0].gauntlets!]);
-                        break;
+                    case hotkeyGroups[0][2]:
                     case hotkeyGroups[0][3]:
                         setIgnoredItems([...ignoredItems, best[0].leggings!]);

[Survived] ConditionalExpression
src/app/armor/page.tsx:108:21
                     case hotkeyGroups[0][2]:
                         setIgnoredItems([...ignoredItems, best[0].gauntlets!]);
                         break;
-                    case hotkeyGroups[0][3]:
-                        setIgnoredItems([...ignoredItems, best[0].leggings!]);
-                        break;
+                    case hotkeyGroups[0][3]:
                     case hotkeyGroups[1][0]:
                         setIgnoredItems([...ignoredItems, best[1].helmet!]);

[Survived] ConditionalExpression
src/app/armor/page.tsx:111:21
                     case hotkeyGroups[0][3]:
                         setIgnoredItems([...ignoredItems, best[0].leggings!]);
                         break;
-                    case hotkeyGroups[1][0]:
-                        setIgnoredItems([...ignoredItems, best[1].helmet!]);
-                        break;
+                    case hotkeyGroups[1][0]:
                     case hotkeyGroups[1][1]:
                         setIgnoredItems([...ignoredItems, best[1].chestpiece!]);

[Survived] ConditionalExpression
src/app/armor/page.tsx:114:21
                     case hotkeyGroups[1][0]:
                         setIgnoredItems([...ignoredItems, best[1].helmet!]);
                         break;
-                    case hotkeyGroups[1][1]:
-                        setIgnoredItems([...ignoredItems, best[1].chestpiece!]);
-                        break;
+                    case hotkeyGroups[1][1]:
                     case hotkeyGroups[1][2]:
                         setIgnoredItems([...ignoredItems, best[1].gauntlets!]);

[Killed] ArrayDeclaration
src/app/armor/page.tsx:115:41
                         setIgnoredItems([...ignoredItems, best[1].helmet!]);
                         break;
                     case hotkeyGroups[1][1]:
-                        setIgnoredItems([...ignoredItems, best[1].chestpiece!]);
+                        setIgnoredItems([]);
                         break;
                     case hotkeyGroups[1][2]:
killedBy: Armor Page ignores single armor using keyboard
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Survived] ConditionalExpression
src/app/armor/page.tsx:117:21
                     case hotkeyGroups[1][1]:
                         setIgnoredItems([...ignoredItems, best[1].chestpiece!]);
                         break;
-                    case hotkeyGroups[1][2]:
-                        setIgnoredItems([...ignoredItems, best[1].gauntlets!]);
-                        break;
+                    case hotkeyGroups[1][2]:
                     case hotkeyGroups[1][3]:
                         setIgnoredItems([...ignoredItems, best[1].leggings!]);

[Survived] ConditionalExpression
src/app/armor/page.tsx:120:21
                     case hotkeyGroups[1][2]:
                         setIgnoredItems([...ignoredItems, best[1].gauntlets!]);
                         break;
-                    case hotkeyGroups[1][3]:
-                        setIgnoredItems([...ignoredItems, best[1].leggings!]);
-                        break;
+                    case hotkeyGroups[1][3]:
                     case hotkeyGroups[2][0]:
                         setIgnoredItems([...ignoredItems, best[2].helmet!]);

[Survived] ConditionalExpression
src/app/armor/page.tsx:123:21
                     case hotkeyGroups[1][3]:
                         setIgnoredItems([...ignoredItems, best[1].leggings!]);
                         break;
-                    case hotkeyGroups[2][0]:
-                        setIgnoredItems([...ignoredItems, best[2].helmet!]);
-                        break;
+                    case hotkeyGroups[2][0]:
                     case hotkeyGroups[2][1]:
                         setIgnoredItems([...ignoredItems, best[2].chestpiece!]);

[Survived] ConditionalExpression
src/app/armor/page.tsx:126:21
                     case hotkeyGroups[2][0]:
                         setIgnoredItems([...ignoredItems, best[2].helmet!]);
                         break;
-                    case hotkeyGroups[2][1]:
-                        setIgnoredItems([...ignoredItems, best[2].chestpiece!]);
-                        break;
+                    case hotkeyGroups[2][1]:
                     case hotkeyGroups[2][2]:
                         setIgnoredItems([...ignoredItems, best[2].gauntlets!]);

[Survived] ConditionalExpression
src/app/armor/page.tsx:129:21
                     case hotkeyGroups[2][1]:
                         setIgnoredItems([...ignoredItems, best[2].chestpiece!]);
                         break;
-                    case hotkeyGroups[2][2]:
-                        setIgnoredItems([...ignoredItems, best[2].gauntlets!]);
-                        break;
+                    case hotkeyGroups[2][2]:
                     case hotkeyGroups[2][3]:
                         setIgnoredItems([...ignoredItems, best[2].leggings!]);

[Killed] ConditionalExpression
src/app/armor/page.tsx:132:21
                     case hotkeyGroups[2][2]:
                         setIgnoredItems([...ignoredItems, best[2].gauntlets!]);
                         break;
-                    case hotkeyGroups[2][3]:
-                        setIgnoredItems([...ignoredItems, best[2].leggings!]);
-                        break;
+                    case hotkeyGroups[2][3]:
                     default:
                         break;
killedBy: Armor Page ignores single armor using keyboard
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 11

[Killed] ArrayDeclaration
src/app/armor/page.tsx:133:41
                         setIgnoredItems([...ignoredItems, best[2].gauntlets!]);
                         break;
                     case hotkeyGroups[2][3]:
-                        setIgnoredItems([...ignoredItems, best[2].leggings!]);
+                        setIgnoredItems([]);
                         break;
                     default:
killedBy: Armor Page ignores single armor using keyboard
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 0

[Survived] BlockStatement
src/app/armor/page.tsx:143:69
         [ignoredItems, best, pressedKeys, hotkeyGroups]
     );
 
-    const handleKeyUp = useCallback((event: KeyboardEvent): void => {
-        setPressedKeys((prevKeys) => {
-            const newKeys = new Set(prevKeys);
-            newKeys.delete(event.key);
-            return newKeys;
-        });
-    }, []);
+    const handleKeyUp = useCallback((event: KeyboardEvent): void => {}, []);
 
     const getSortByArmor = useCallback((): SortByArmor => {

[Killed] ConditionalExpression
src/app/armor/page.tsx:152:16
     }, []);
 
     const getSortByArmor = useCallback((): SortByArmor => {
-        return sortBy == "custom"
+        return false
             ? customSortBy
             : sortBy == "boss"
killedBy: Armor Page load local storage
statusReason: TypeError: Cannot read properties of undefined (reading 'children')

[Killed] ConditionalExpression
src/app/armor/page.tsx:152:16
     }, []);
 
     const getSortByArmor = useCallback((): SortByArmor => {
-        return sortBy == "custom"
+        return true
             ? customSortBy
             : sortBy == "boss"
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] ConditionalExpression
src/app/armor/page.tsx:154:15
     const getSortByArmor = useCallback((): SortByArmor => {
         return sortBy == "custom"
             ? customSortBy
-            : sortBy == "boss"
+            : false
             ? SORTBYBOSS_MODES[bossSortBy as SortByBossKey]
             : SORTBYARMOR_MODES[sortBy as keyof typeof SORTBYARMOR_MODES];
killedBy: Armor Page gets SortByArmor
statusReason: TypeError: Cannot read properties of undefined (reading 'children')

[Killed] EqualityOperator
src/app/armor/page.tsx:154:15
     const getSortByArmor = useCallback((): SortByArmor => {
         return sortBy == "custom"
             ? customSortBy
-            : sortBy == "boss"
+            : sortBy != "boss"
             ? SORTBYBOSS_MODES[bossSortBy as SortByBossKey]
             : SORTBYARMOR_MODES[sortBy as keyof typeof SORTBYARMOR_MODES];
killedBy: Armor Page gets SortByArmor
statusReason: TypeError: Cannot read properties of undefined (reading 'children')

[Killed] StringLiteral
src/app/armor/page.tsx:162:56
     // EFFECTS
     useEffect(() => {
         // Load data from localStorage on component mount
-        const localMaxEquipLoad = localStorage.getItem("localMaxEquipLoad");
+        const localMaxEquipLoad = localStorage.getItem("");
         if (localMaxEquipLoad) {
             setMaxEquipLoad(JSON.parse(localMaxEquipLoad));
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  30

[Killed] BlockStatement
src/app/armor/page.tsx:163:32
     useEffect(() => {
         // Load data from localStorage on component mount
         const localMaxEquipLoad = localStorage.getItem("localMaxEquipLoad");
-        if (localMaxEquipLoad) {
-            setMaxEquipLoad(JSON.parse(localMaxEquipLoad));
-        }
+        if (localMaxEquipLoad) {}
 
         const localCurrentEquipLoad = localStorage.getItem(
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  30

[Killed] StringLiteral
src/app/armor/page.tsx:168:13
         }
 
         const localCurrentEquipLoad = localStorage.getItem(
-            "localCurrentEquipLoad"
+            ""
         );
         if (localCurrentEquipLoad) {
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue(10)

Expected the element to have value:
  10
Received:
  0

[Killed] BlockStatement
src/app/armor/page.tsx:170:36
         const localCurrentEquipLoad = localStorage.getItem(
             "localCurrentEquipLoad"
         );
-        if (localCurrentEquipLoad) {
-            setCurrentEquipLoad(JSON.parse(localCurrentEquipLoad));
-        }
+        if (localCurrentEquipLoad) {}
 
         const localBreakpoint = localStorage.getItem("localBreakpoint");
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue(10)

Expected the element to have value:
  10
Received:
  0

[Survived] BlockStatement
src/app/armor/page.tsx:175:30
         }
 
         const localBreakpoint = localStorage.getItem("localBreakpoint");
-        if (localBreakpoint) {
-            setBreakpoint(JSON.parse(localBreakpoint));
-        }
+        if (localBreakpoint) {}
 
         const localCustomSortBy = localStorage.getItem("localCustomSortBy");

[Killed] BlockStatement
src/app/armor/page.tsx:180:32
         }
 
         const localCustomSortBy = localStorage.getItem("localCustomSortBy");
-        if (localCustomSortBy) {
-            setCustomSortBy(
-                deepCloneAndMap(unmarshallSortBy(localCustomSortBy), [
-                    { label: "Custom" },
-                ])
-            );
-        }
+        if (localCustomSortBy) {}
 
         const localSortBy = localStorage.getItem("localSortBy");
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Survived] ArrayDeclaration
src/app/armor/page.tsx:182:70
         const localCustomSortBy = localStorage.getItem("localCustomSortBy");
         if (localCustomSortBy) {
             setCustomSortBy(
-                deepCloneAndMap(unmarshallSortBy(localCustomSortBy), [
-                    { label: "Custom" },
-                ])
+                deepCloneAndMap(unmarshallSortBy(localCustomSortBy), [])
             );
         }

[Survived] BlockStatement
src/app/armor/page.tsx:189:26
         }
 
         const localSortBy = localStorage.getItem("localSortBy");
-        if (localSortBy) {
-            setSortBy(JSON.parse(localSortBy));
-        }
+        if (localSortBy) {}
 
         const localLockedItems = localStorage.getItem("localLockedItems");

[Killed] BlockStatement
src/app/armor/page.tsx:194:31
         }
 
         const localLockedItems = localStorage.getItem("localLockedItems");
-        if (localLockedItems) {
-            setLockedItems(JSON.parse(localLockedItems));
-        }
+        if (localLockedItems) {}
 
         const localIgnoredItems = localStorage.getItem("localIgnoredItems");
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue(no-helmet)

Expected the element to have value:
  no-helmet
Received:
  none

[Killed] StringLiteral
src/app/armor/page.tsx:198:56
             setLockedItems(JSON.parse(localLockedItems));
         }
 
-        const localIgnoredItems = localStorage.getItem("localIgnoredItems");
+        const localIgnoredItems = localStorage.getItem("");
         if (localIgnoredItems) {
             setIgnoredItems(JSON.parse(localIgnoredItems));
killedBy: Armor Page load local storage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] BlockStatement
src/app/armor/page.tsx:199:32
         }
 
         const localIgnoredItems = localStorage.getItem("localIgnoredItems");
-        if (localIgnoredItems) {
-            setIgnoredItems(JSON.parse(localIgnoredItems));
-        }
+        if (localIgnoredItems) {}
     }, []);
 
killedBy: Armor Page load local storage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] BlockStatement
src/app/armor/page.tsx:204:21
         }
     }, []);
 
-    useEffect(() => {
-        // Add event listeners for hotkeys
-        document.addEventListener("keydown", handleKeyDown);
-        document.addEventListener("keyup", handleKeyUp);
-
-        return () => {
-            document.removeEventListener("keydown", handleKeyDown);
-            document.removeEventListener("keyup", handleKeyUp);
-        };
-    }, [pressedKeys, handleKeyDown, handleKeyUp]);
+    useEffect(() => {}, [pressedKeys, handleKeyDown, handleKeyUp]);
 
     useEffect(() => {
killedBy: Armor Page ignores single armor using keyboard
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] BlockStatement
src/app/armor/page.tsx:209:22
         document.addEventListener("keydown", handleKeyDown);
         document.addEventListener("keyup", handleKeyUp);
 
-        return () => {
-            document.removeEventListener("keydown", handleKeyDown);
-            document.removeEventListener("keyup", handleKeyUp);
-        };
+        return () => {};
     }, [pressedKeys, handleKeyDown, handleKeyUp]);
 

[Killed] ArrayDeclaration
src/app/armor/page.tsx:213:8
             document.removeEventListener("keydown", handleKeyDown);
             document.removeEventListener("keyup", handleKeyUp);
         };
-    }, [pressedKeys, handleKeyDown, handleKeyUp]);
+    }, []);
 
     useEffect(() => {
killedBy: Armor Page ignores single armor using keyboard
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] BlockStatement
src/app/armor/page.tsx:215:21
         };
     }, [pressedKeys, handleKeyDown, handleKeyUp]);
 
-    useEffect(() => {
-        localStorage.setItem("localMaxEquipLoad", JSON.stringify(maxEquipLoad));
-    }, [maxEquipLoad]);
+    useEffect(() => {}, [maxEquipLoad]);
 
     useEffect(() => {

[Survived] BlockStatement
src/app/armor/page.tsx:219:21
         localStorage.setItem("localMaxEquipLoad", JSON.stringify(maxEquipLoad));
     }, [maxEquipLoad]);
 
-    useEffect(() => {
-        localStorage.setItem(
-            "localCurrentEquipLoad",
-            JSON.stringify(currentEquipLoad)
-        );
-    }, [currentEquipLoad]);
+    useEffect(() => {}, [currentEquipLoad]);
 
     useEffect(() => {

[Survived] BlockStatement
src/app/armor/page.tsx:226:21
         );
     }, [currentEquipLoad]);
 
-    useEffect(() => {
-        localStorage.setItem("localBreakpoint", JSON.stringify(breakpoint));
-    }, [breakpoint]);
+    useEffect(() => {}, [breakpoint]);
 
     useEffect(() => {

[Survived] BlockStatement
src/app/armor/page.tsx:230:21
         localStorage.setItem("localBreakpoint", JSON.stringify(breakpoint));
     }, [breakpoint]);
 
-    useEffect(() => {
-        localStorage.setItem("localSortBy", JSON.stringify(sortBy));
-    }, [sortBy]);
+    useEffect(() => {}, [sortBy]);
 
     useEffect(() => {

[Survived] StringLiteral
src/app/armor/page.tsx:231:30
     }, [breakpoint]);
 
     useEffect(() => {
-        localStorage.setItem("localSortBy", JSON.stringify(sortBy));
+        localStorage.setItem("", JSON.stringify(sortBy));
     }, [sortBy]);
 

[Survived] BlockStatement
src/app/armor/page.tsx:234:21
         localStorage.setItem("localSortBy", JSON.stringify(sortBy));
     }, [sortBy]);
 
-    useEffect(() => {
-        localStorage.setItem(
-            "localCustomSortBy",
-            marshallSortByToString(customSortBy)
-        );
-    }, [customSortBy]);
+    useEffect(() => {}, [customSortBy]);
 
     useEffect(() => {

[Survived] StringLiteral
src/app/armor/page.tsx:236:13
 
     useEffect(() => {
         localStorage.setItem(
-            "localCustomSortBy",
+            "",
             marshallSortByToString(customSortBy)
         );

[Survived] BlockStatement
src/app/armor/page.tsx:241:21
         );
     }, [customSortBy]);
 
-    useEffect(() => {
-        localStorage.setItem("localLockedItems", JSON.stringify(lockedItems));
-    }, [lockedItems]);
+    useEffect(() => {}, [lockedItems]);
 
     useEffect(() => {

[Survived] StringLiteral
src/app/armor/page.tsx:242:30
     }, [customSortBy]);
 
     useEffect(() => {
-        localStorage.setItem("localLockedItems", JSON.stringify(lockedItems));
+        localStorage.setItem("", JSON.stringify(lockedItems));
     }, [lockedItems]);
 

[Survived] BlockStatement
src/app/armor/page.tsx:245:21
         localStorage.setItem("localLockedItems", JSON.stringify(lockedItems));
     }, [lockedItems]);
 
-    useEffect(() => {
-        localStorage.setItem("localIgnoredItems", JSON.stringify(ignoredItems));
-    }, [ignoredItems]);
+    useEffect(() => {}, [ignoredItems]);
 
     useEffect(() => {

[Survived] ArrayDeclaration
src/app/armor/page.tsx:247:8
 
     useEffect(() => {
         localStorage.setItem("localIgnoredItems", JSON.stringify(ignoredItems));
-    }, [ignoredItems]);
+    }, []);
 
     useEffect(() => {

[Killed] BlockStatement
src/app/armor/page.tsx:249:21
         localStorage.setItem("localIgnoredItems", JSON.stringify(ignoredItems));
     }, [ignoredItems]);
 
-    useEffect(() => {
-        setBest(
-            knapSack(
-                equipLoadBudget,
-                helmets,
-                chestpieces,
-                gauntlets,
-                leggings,
-                getSortByArmor()
-            )
-        );
-    }, [
+    useEffect(() => {}, [
         equipLoadBudget,
         helmets,
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Killed] BlockStatement
src/app/armor/page.tsx:269:21
         getSortByArmor,
     ]);
 
-    useEffect(() => {
-        setHelmets(
-            dominated(HELMETS, lockedItems, ignoredItems, getSortByArmor())
-        );
-        setChestpieces(
-            dominated(CHESTPIECES, lockedItems, ignoredItems, getSortByArmor())
-        );
-        setGauntlets(
-            dominated(GAUNTLETS, lockedItems, ignoredItems, getSortByArmor())
-        );
-        setLeggings(
-            dominated(LEGGINGS, lockedItems, ignoredItems, getSortByArmor())
-        );
-    }, [lockedItems, ignoredItems, getSortByArmor]);
+    useEffect(() => {}, [lockedItems, ignoredItems, getSortByArmor]);
 
     useEffect(() => {
killedBy: Armor Page ignores/restores single armor
statusReason: TypeError: Cannot read properties of undefined (reading 'click')
