[Killed] BlockStatement
src/app/armor/page.tsx:284:21
         );
     }, [lockedItems, ignoredItems, getSortByArmor]);
 
-    useEffect(() => {
-        setEquipLoadBudget(
-            Math.max(maxEquipLoad * breakpoint - currentEquipLoad, 0.0)
-        );
-    }, [maxEquipLoad, currentEquipLoad, breakpoint]);
+    useEffect(() => {}, [maxEquipLoad, currentEquipLoad, breakpoint]);
 
     // RENDER
killedBy: Armor Page updates equip load budget
statusReason: Error: expect(element).toHaveValue(0)

Expected the element to have value:
  0
Received:
  21

[Killed] ArithmeticOperator
src/app/armor/page.tsx:286:22
 
     useEffect(() => {
         setEquipLoadBudget(
-            Math.max(maxEquipLoad * breakpoint - currentEquipLoad, 0.0)
+            Math.max(maxEquipLoad * breakpoint + currentEquipLoad, 0.0)
         );
     }, [maxEquipLoad, currentEquipLoad, breakpoint]);
killedBy: Armor Page updates equip load budget
statusReason: Error: expect(element).toHaveValue(60)

Expected the element to have value:
  60
Received:
  80

[Killed] MethodExpression
src/app/armor/page.tsx:286:13
 
     useEffect(() => {
         setEquipLoadBudget(
-            Math.max(maxEquipLoad * breakpoint - currentEquipLoad, 0.0)
+            Math.min(maxEquipLoad * breakpoint - currentEquipLoad, 0.0)
         );
     }, [maxEquipLoad, currentEquipLoad, breakpoint]);
killedBy: Armor Page updates equip load budget
statusReason: Error: expect(element).toHaveValue(70)

Expected the element to have value:
  70
Received:
  0

[Killed] ArrayDeclaration
src/app/armor/page.tsx:288:8
         setEquipLoadBudget(
             Math.max(maxEquipLoad * breakpoint - currentEquipLoad, 0.0)
         );
-    }, [maxEquipLoad, currentEquipLoad, breakpoint]);
+    }, []);
 
     // RENDER
killedBy: Armor Page updates equip load budget
statusReason: Error: expect(element).toHaveValue(0)

Expected the element to have value:
  0
Received:
  21

[Killed] ConditionalExpression
src/app/armor/page.tsx:293:14
     // RENDER
     return (
         <div>
-            {customizeSortBy && (
-                <CustomizeSortBy
-                    closePopUp={() => {
-                        setCustomizeSortBy(false);
-                    }}
-                    setCustomSortBy={setCustomSortBy}
-                    sortBy={getSortByArmor()}
-                />
-            )}
+            {true}
             <header>
                 <h1>Armor Optimizer</h1>
killedBy: Armor Page load local storage
statusReason: Error: expect(received).toHaveValue()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
src/app/armor/page.tsx:293:14
     // RENDER
     return (
         <div>
-            {customizeSortBy && (
-                <CustomizeSortBy
-                    closePopUp={() => {
-                        setCustomizeSortBy(false);
-                    }}
-                    setCustomSortBy={setCustomSortBy}
-                    sortBy={getSortByArmor()}
-                />
-            )}
+            {false}
             <header>
                 <h1>Armor Optimizer</h1>
killedBy: Armor Page load local storage
statusReason: Error: expect(received).toHaveValue()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
src/app/armor/page.tsx:295:39
         <div>
             {customizeSortBy && (
                 <CustomizeSortBy
-                    closePopUp={() => {
-                        setCustomizeSortBy(false);
-                    }}
+                    closePopUp={() => {}}
                     setCustomSortBy={setCustomSortBy}
                     sortBy={getSortByArmor()}
killedBy: Armor Page opens and closes the customize sort modal
statusReason: Error: expect(received).toBeNull()

Received: <h2>Custom Sort</h2>

[Killed] BooleanLiteral
src/app/armor/page.tsx:296:44
             {customizeSortBy && (
                 <CustomizeSortBy
                     closePopUp={() => {
-                        setCustomizeSortBy(false);
+                        setCustomizeSortBy(true);
                     }}
                     setCustomSortBy={setCustomSortBy}
killedBy: Armor Page opens and closes the customize sort modal
statusReason: Error: expect(received).toBeNull()

Received: <h2>Custom Sort</h2>

[Killed] BlockStatement
src/app/armor/page.tsx:315:50
                             label="Max. Equip Load"
                             className="stat"
                             id="max-equip-load"
-                            onChange={(event) => {
-                                if (event.target.value == "") {
-                                    event.target.value = "0";
-                                }
-                                setMaxEquipLoad(parseFloat(event.target.value));
-                            }}
+                            onChange={(event) => {}}
                             value={maxEquipLoad}
                             name="equip-load"
killedBy: Armor Page updates equip load budget
statusReason: Error: expect(element).toHaveValue(0)

Expected the element to have value:
  0
Received:
  21

[Killed] EqualityOperator
src/app/armor/page.tsx:316:37
                             className="stat"
                             id="max-equip-load"
                             onChange={(event) => {
-                                if (event.target.value == "") {
+                                if (event.target.value != "") {
                                     event.target.value = "0";
                                 }
killedBy: Armor Page updates equip load budget
statusReason: RangeError: Invalid array length

[Killed] ConditionalExpression
src/app/armor/page.tsx:316:37
                             className="stat"
                             id="max-equip-load"
                             onChange={(event) => {
-                                if (event.target.value == "") {
+                                if (false) {
                                     event.target.value = "0";
                                 }
killedBy: Armor Page updates equip load budget
statusReason: RangeError: Invalid array length

[Killed] BlockStatement
src/app/armor/page.tsx:328:50
                             label="Current Equip Load"
                             className="stat"
                             id="current-equip-load"
-                            onChange={(event) => {
-                                if (event.target.value == "") {
-                                    event.target.value = "0";
-                                }
-                                setCurrentEquipLoad(
-                                    parseFloat(event.target.value)
-                                );
-                            }}
+                            onChange={(event) => {}}
                             value={currentEquipLoad}
                             name="equip-load"
killedBy: Armor Page updates equip load budget
statusReason: Error: expect(element).toHaveValue(60)

Expected the element to have value:
  60
Received:
  70

[Killed] BlockStatement
src/app/armor/page.tsx:329:63
                             className="stat"
                             id="current-equip-load"
                             onChange={(event) => {
-                                if (event.target.value == "") {
-                                    event.target.value = "0";
-                                }
+                                if (event.target.value == "") {}
                                 setCurrentEquipLoad(
                                     parseFloat(event.target.value)
killedBy: Armor Page updates equip load budget
statusReason: RangeError: Invalid array length

[Killed] ArrowFunction
src/app/armor/page.tsx:352:38
                         <InputRadio
                             label="Fast Roll (up to 30% equip load)"
                             id="fast-roll"
-                            onClick={() => setBreakpoint(0.3)}
+                            onClick={() => undefined}
                             name="roll-type"
                             checked={breakpoint === 0.3}
killedBy: Armor Page updates equip load budget
statusReason: Error: expect(element).toHaveValue(30)

Expected the element to have value:
  30
Received:
  70

[Killed] EqualityOperator
src/app/armor/page.tsx:354:38
                             id="fast-roll"
                             onClick={() => setBreakpoint(0.3)}
                             name="roll-type"
-                            checked={breakpoint === 0.3}
+                            checked={breakpoint !== 0.3}
                         />
                         <InputRadio
killedBy: Armor Page updates equip load budget
statusReason: Error: expect(element).toHaveValue(30)

Expected the element to have value:
  30
Received:
  70

[Killed] ConditionalExpression
src/app/armor/page.tsx:354:38
                             id="fast-roll"
                             onClick={() => setBreakpoint(0.3)}
                             name="roll-type"
-                            checked={breakpoint === 0.3}
+                            checked={true}
                         />
                         <InputRadio
killedBy: Armor Page updates equip load budget
statusReason: Error: expect(element).toHaveValue(30)

Expected the element to have value:
  30
Received:
  70

[Killed] ArrowFunction
src/app/armor/page.tsx:359:38
                         <InputRadio
                             label="Normal Roll (up to 70% equip load)"
                             id="normal-roll"
-                            onClick={() => setBreakpoint(0.7)}
+                            onClick={() => undefined}
                             name="roll-type"
                             checked={breakpoint === 0.7}
killedBy: Armor Page updates equip load budget
statusReason: Error: expect(element).toHaveValue(70)

Expected the element to have value:
  70
Received:
  30

[Killed] ConditionalExpression
src/app/armor/page.tsx:361:38
                             id="normal-roll"
                             onClick={() => setBreakpoint(0.7)}
                             name="roll-type"
-                            checked={breakpoint === 0.7}
+                            checked={true}
                         />
                         <InputRadio
killedBy: Armor Page updates equip load budget
statusReason: Error: expect(element).toHaveValue(70)

Expected the element to have value:
  70
Received:
  30

[Killed] ConditionalExpression
src/app/armor/page.tsx:361:38
                             id="normal-roll"
                             onClick={() => setBreakpoint(0.7)}
                             name="roll-type"
-                            checked={breakpoint === 0.7}
+                            checked={false}
                         />
                         <InputRadio
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toBeChecked()

Received element is not checked:
  <input id="normal-roll" name="roll-type" type="radio" value="" />

[Killed] ArrowFunction
src/app/armor/page.tsx:366:38
                         <InputRadio
                             label="Fat Roll (up to 100% equip load)"
                             id="fat-roll"
-                            onClick={() => setBreakpoint(1.0)}
+                            onClick={() => undefined}
                             name="roll-type"
                             checked={breakpoint === 1.0}
killedBy: Armor Page updates equip load budget
statusReason: Error: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  70

[Killed] ConditionalExpression
src/app/armor/page.tsx:368:38
                             id="fat-roll"
                             onClick={() => setBreakpoint(1.0)}
                             name="roll-type"
-                            checked={breakpoint === 1.0}
+                            checked={true}
                         />
                         <hr />
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toBeChecked()

Received element is not checked:
  <input checked="" id="normal-roll" name="roll-type" type="radio" value="" />

[Killed] EqualityOperator
src/app/armor/page.tsx:368:38
                             id="fat-roll"
                             onClick={() => setBreakpoint(1.0)}
                             name="roll-type"
-                            checked={breakpoint === 1.0}
+                            checked={breakpoint !== 1.0}
                         />
                         <hr />
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toBeChecked()

Received element is not checked:
  <input checked="" id="normal-roll" name="roll-type" type="radio" value="" />

[Killed] ArrowFunction
src/app/armor/page.tsx:379:50
                                         key={key}
                                         label={value.label}
                                         id={key}
-                                        onClick={() => setSortBy(key)}
+                                        onClick={() => undefined}
                                         name="sorting-order"
                                         checked={sortBy === key}
killedBy: Armor Page updates sorting mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/app/armor/page.tsx:381:50
                                         id={key}
                                         onClick={() => setSortBy(key)}
                                         name="sorting-order"
-                                        checked={sortBy === key}
+                                        checked={sortBy !== key}
                                     />
                                 );
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toBeChecked()

Received element is not checked:
  <input id="total-standard" name="sorting-order" type="radio" value="" />

[Killed] ConditionalExpression
src/app/armor/page.tsx:381:50
                                         id={key}
                                         onClick={() => setSortBy(key)}
                                         name="sorting-order"
-                                        checked={sortBy === key}
+                                        checked={false}
                                     />
                                 );
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toBeChecked()

Received element is not checked:
  <input id="total-standard" name="sorting-order" type="radio" value="" />

[Killed] ArrowFunction
src/app/armor/page.tsx:391:47
                                 <input
                                     type="radio"
                                     id="boss"
-                                    onChange={() => setSortBy("boss")}
+                                    onChange={() => undefined}
                                     name={"sorting-order"}
                                     value={"boss"}
killedBy: Armor Page gets SortByArmor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
src/app/armor/page.tsx:392:43
                                     type="radio"
                                     id="boss"
                                     onChange={() => setSortBy("boss")}
-                                    name={"sorting-order"}
+                                    name={""}
                                     value={"boss"}
                                     checked={sortBy === "boss"}

[Killed] ConditionalExpression
src/app/armor/page.tsx:394:46
                                     onChange={() => setSortBy("boss")}
                                     name={"sorting-order"}
                                     value={"boss"}
-                                    checked={sortBy === "boss"}
+                                    checked={true}
                                 />
                                 <label
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toBeChecked()

Received element is not checked:
  <input checked="" id="total-standard" name="sorting-order" type="radio" value="" />

[Killed] EqualityOperator
src/app/armor/page.tsx:394:46
                                     onChange={() => setSortBy("boss")}
                                     name={"sorting-order"}
                                     value={"boss"}
-                                    checked={sortBy === "boss"}
+                                    checked={sortBy !== "boss"}
                                 />
                                 <label
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toBeChecked()

Received element is not checked:
  <input checked="" id="total-standard" name="sorting-order" type="radio" value="" />

[Survived] EqualityOperator
src/app/armor/page.tsx:400:45
                                     htmlFor={"boss"}
                                     style={{
                                         color:
-                                            sortBy === "boss"
+                                            sortBy !== "boss"
                                                 ? "var(--accent)"
                                                 : "var(--contrast)",

[Survived] ConditionalExpression
src/app/armor/page.tsx:400:45
                                     htmlFor={"boss"}
                                     style={{
                                         color:
-                                            sortBy === "boss"
+                                            true
                                                 ? "var(--accent)"
                                                 : "var(--contrast)",

[Survived] StringLiteral
src/app/armor/page.tsx:401:51
                                     style={{
                                         color:
                                             sortBy === "boss"
-                                                ? "var(--accent)"
+                                                ? ""
                                                 : "var(--contrast)",
                                     }}

[Survived] StringLiteral
src/app/armor/page.tsx:402:51
                                         color:
                                             sortBy === "boss"
                                                 ? "var(--accent)"
-                                                : "var(--contrast)",
+                                                : "",
                                     }}
                                 >

[Survived] StringLiteral
src/app/armor/page.tsx:406:42
                                     }}
                                 >
                                     Boss
-                                </label>{" "}
+                                </label>{""}
                                 <select
                                     id="boss-select"

[Survived] ArrowFunction
src/app/armor/page.tsx:410:47
                                 <select
                                     id="boss-select"
                                     itemType="text"
-                                    onChange={(e) =>
-                                        setBossSortBy(e.target.value)
+                                    onChange={() => undefined
                                     }
                                     aria-label="boss select"

[Survived] ObjectLiteral
src/app/armor/page.tsx:414:44
                                         setBossSortBy(e.target.value)
                                     }
                                     aria-label="boss select"
-                                    style={{
-                                        minHeight: "24px",
-                                        minWidth: "24px",
-                                    }}
+                                    style={{}}
                                 >
                                     {SORTBYBOSS_KEYS.map((item: string) => {

[Survived] StringLiteral
src/app/armor/page.tsx:416:51
                                     aria-label="boss select"
                                     style={{
                                         minHeight: "24px",
-                                        minWidth: "24px",
+                                        minWidth: "",
                                     }}
                                 >

[Killed] ArrowFunction
src/app/armor/page.tsx:434:47
                                 <input
                                     type="radio"
                                     id="custom"
-                                    onChange={() => setSortBy("custom")}
+                                    onChange={() => undefined}
                                     name={"sorting-order"}
                                     value={"custom"}
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toHaveValue((
    PHYSICAL
)
)

Expected the element to have value:
  (
      PHYSICAL

[Killed] StringLiteral
src/app/armor/page.tsx:434:63
                                 <input
                                     type="radio"
                                     id="custom"
-                                    onChange={() => setSortBy("custom")}
+                                    onChange={() => setSortBy("")}
                                     name={"sorting-order"}
                                     value={"custom"}
killedBy: Armor Page load local storage
statusReason: TypeError: Cannot read properties of undefined (reading 'children')

[Killed] ConditionalExpression
src/app/armor/page.tsx:437:46
                                     onChange={() => setSortBy("custom")}
                                     name={"sorting-order"}
                                     value={"custom"}
-                                    checked={sortBy === "custom"}
+                                    checked={true}
                                 />
                                 <label
killedBy: Armor Page load local storage
statusReason: Error: expect(element).toBeChecked()

Received element is not checked:
  <input checked="" id="total-standard" name="sorting-order" type="radio" value="" />

[Killed] ConditionalExpression
src/app/armor/page.tsx:437:46
                                     onChange={() => setSortBy("custom")}
                                     name={"sorting-order"}
                                     value={"custom"}
-                                    checked={sortBy === "custom"}
+                                    checked={false}
                                 />
                                 <label
killedBy: Armor Page gets SortByArmor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ObjectLiteral
src/app/armor/page.tsx:441:44
                                 />
                                 <label
                                     htmlFor={"custom"}
-                                    style={{
-                                        color:
-                                            sortBy === "custom"
-                                                ? "var(--accent)"
-                                                : "var(--contrast)",
-                                    }}
+                                    style={{}}
                                 >
                                     Custom

[Survived] ConditionalExpression
src/app/armor/page.tsx:443:45
                                     htmlFor={"custom"}
                                     style={{
                                         color:
-                                            sortBy === "custom"
+                                            false
                                                 ? "var(--accent)"
                                                 : "var(--contrast)",

[Survived] ConditionalExpression
src/app/armor/page.tsx:443:45
                                     htmlFor={"custom"}
                                     style={{
                                         color:
-                                            sortBy === "custom"
+                                            true
                                                 ? "var(--accent)"
                                                 : "var(--contrast)",

[Killed] ArrowFunction
src/app/armor/page.tsx:451:46
                                     Custom
                                 </label>{" "}
                                 <button
-                                    onClick={() => setCustomizeSortBy(true)}
+                                    onClick={() => undefined}
                                     style={{
                                         minHeight: "24px",
killedBy: Armor Page load local storage
statusReason: Error: expect(received).toHaveValue()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Timeout] BooleanLiteral
src/app/armor/page.tsx:451:71
                                     Custom
                                 </label>{" "}
                                 <button
-                                    onClick={() => setCustomizeSortBy(true)}
+                                    onClick={() => setCustomizeSortBy(false)}
                                     style={{
                                         minHeight: "24px",

[Survived] ObjectLiteral
src/app/armor/page.tsx:452:44
                                 </label>{" "}
                                 <button
                                     onClick={() => setCustomizeSortBy(true)}
-                                    style={{
-                                        minHeight: "24px",
-                                        minWidth: "24px",
-                                    }}
+                                    style={{}}
                                 >
                                     Customize

[Killed] ArrowFunction
src/app/armor/page.tsx:466:42
                             <b>Locked Armor</b>
                             <button
                                 id="clear-equipment"
-                                onClick={() =>
-                                    setLockedItems({
-                                        helmet: undefined,
-                                        chestpiece: undefined,
-                                        gauntlets: undefined,
-                                        leggings: undefined,
-                                    })
+                                onClick={() => undefined
                                 }
                                 style={{ minHeight: "24px", minWidth: "24px" }}
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: "no-helmet"

[Survived] ObjectLiteral
src/app/armor/page.tsx:467:52
                             <button
                                 id="clear-equipment"
                                 onClick={() =>
-                                    setLockedItems({
-                                        helmet: undefined,
-                                        chestpiece: undefined,
-                                        gauntlets: undefined,
-                                        leggings: undefined,
-                                    })
+                                    setLockedItems({})
                                 }
                                 style={{ minHeight: "24px", minWidth: "24px" }}

[Killed] BlockStatement
src/app/armor/page.tsx:483:50
                             label="Helmet"
                             id="locked-helmet"
                             name={LOCKED_ARMOR_SELECT_NAME}
-                            onChange={(event) => {
-                                setLockedItems({
-                                    ...lockedItems,
-                                    helmet: HELMETS.find(
-                                        (item) => item.id === event.target.value
-                                    )!,
-                                });
-                            }}
+                            onChange={(event) => {}}
                             options={HELMETS}
                             value={lockedItems.helmet?.id}
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-helmet"
Received: "none"

[Killed] ArrowFunction
src/app/armor/page.tsx:487:41
                                 setLockedItems({
                                     ...lockedItems,
                                     helmet: HELMETS.find(
-                                        (item) => item.id === event.target.value
+                                        () => undefined
                                     )!,
                                 });
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-helmet"
Received: "none"
