[Killed] EqualityOperator
src/app/armor/page.tsx:487:51
                                 setLockedItems({
                                     ...lockedItems,
                                     helmet: HELMETS.find(
-                                        (item) => item.id === event.target.value
+                                        (item) => item.id !== event.target.value
                                     )!,
                                 });
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-helmet"
Received: "alberichs-pointed-hat"

[Killed] BlockStatement
src/app/armor/page.tsx:498:50
                             label="Chestpiece"
                             id="locked-chestpiece"
                             name={LOCKED_ARMOR_SELECT_NAME}
-                            onChange={(event) => {
-                                setLockedItems({
-                                    ...lockedItems,
-                                    chestpiece: CHESTPIECES.find(
-                                        (item) => item.id === event.target.value
-                                    )!,
-                                });
-                            }}
+                            onChange={(event) => {}}
                             options={CHESTPIECES}
                             value={lockedItems.chestpiece?.id}
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-chestpiece"
Received: "none"

[Killed] ObjectLiteral
src/app/armor/page.tsx:499:48
                             id="locked-chestpiece"
                             name={LOCKED_ARMOR_SELECT_NAME}
                             onChange={(event) => {
-                                setLockedItems({
-                                    ...lockedItems,
-                                    chestpiece: CHESTPIECES.find(
-                                        (item) => item.id === event.target.value
-                                    )!,
-                                });
+                                setLockedItems({});
                             }}
                             options={CHESTPIECES}
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-chestpiece"
Received: "none"

[Killed] EqualityOperator
src/app/armor/page.tsx:502:51
                                 setLockedItems({
                                     ...lockedItems,
                                     chestpiece: CHESTPIECES.find(
-                                        (item) => item.id === event.target.value
+                                        (item) => item.id !== event.target.value
                                     )!,
                                 });
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-chestpiece"
Received: "alberichs-robe"

[Killed] ArrowFunction
src/app/armor/page.tsx:502:41
                                 setLockedItems({
                                     ...lockedItems,
                                     chestpiece: CHESTPIECES.find(
-                                        (item) => item.id === event.target.value
+                                        () => undefined
                                     )!,
                                 });
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-chestpiece"
Received: "none"

[Killed] BlockStatement
src/app/armor/page.tsx:513:50
                             label="Gauntlets"
                             id="locked-gauntlets"
                             name={LOCKED_ARMOR_SELECT_NAME}
-                            onChange={(event) => {
-                                setLockedItems({
-                                    ...lockedItems,
-                                    gauntlets: GAUNTLETS.find(
-                                        (item) => item.id === event.target.value
-                                    )!,
-                                });
-                            }}
+                            onChange={(event) => {}}
                             options={GAUNTLETS}
                             value={lockedItems.gauntlets?.id}
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-gauntlets"
Received: "none"

[Killed] EqualityOperator
src/app/armor/page.tsx:517:51
                                 setLockedItems({
                                     ...lockedItems,
                                     gauntlets: GAUNTLETS.find(
-                                        (item) => item.id === event.target.value
+                                        (item) => item.id !== event.target.value
                                     )!,
                                 });
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-gauntlets"
Received: "alberichs-bracers"

[Killed] ArrowFunction
src/app/armor/page.tsx:517:41
                                 setLockedItems({
                                     ...lockedItems,
                                     gauntlets: GAUNTLETS.find(
-                                        (item) => item.id === event.target.value
+                                        () => undefined
                                     )!,
                                 });
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-gauntlets"
Received: "none"

[Killed] BlockStatement
src/app/armor/page.tsx:528:50
                             label="Leggings"
                             id="locked-leggings"
                             name={LOCKED_ARMOR_SELECT_NAME}
-                            onChange={(event) => {
-                                setLockedItems({
-                                    ...lockedItems,
-                                    leggings: LEGGINGS.find(
-                                        (item) => item.id === event.target.value
-                                    )!,
-                                });
-                            }}
+                            onChange={(event) => {}}
                             options={LEGGINGS}
                             value={lockedItems.leggings?.id}
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-leggings"
Received: "none"

[Killed] ArrowFunction
src/app/armor/page.tsx:532:41
                                 setLockedItems({
                                     ...lockedItems,
                                     leggings: LEGGINGS.find(
-                                        (item) => item.id === event.target.value
+                                        () => undefined
                                     )!,
                                 });
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-leggings"
Received: "none"

[Killed] EqualityOperator
src/app/armor/page.tsx:532:51
                                 setLockedItems({
                                     ...lockedItems,
                                     leggings: LEGGINGS.find(
-                                        (item) => item.id === event.target.value
+                                        (item) => item.id !== event.target.value
                                     )!,
                                 });
killedBy: Armor Page updates locked armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "no-leggings"
Received: "alberichs-trousers"

[Survived] StringLiteral
src/app/armor/page.tsx:545:53
                             <button
                                 id="ignore-all"
                                 onClick={ignoreAll}
-                                style={{ minHeight: "24px", minWidth: "24px" }}
+                                style={{ minHeight: "", minWidth: "24px" }}
                             >
                                 Ignore All

[Survived] ObjectLiteral
src/app/armor/page.tsx:545:40
                             <button
                                 id="ignore-all"
                                 onClick={ignoreAll}
-                                style={{ minHeight: "24px", minWidth: "24px" }}
+                                style={{}}
                             >
                                 Ignore All

[Survived] StringLiteral
src/app/armor/page.tsx:552:53
                             <button
                                 id="restore-all"
                                 onClick={restoreAll}
-                                style={{ minHeight: "24px", minWidth: "24px" }}
+                                style={{ minHeight: "", minWidth: "24px" }}
                             >
                                 Restore All

[Survived] ObjectLiteral
src/app/armor/page.tsx:565:48
                                 {ignoredItems.map((item: Armor) => (
                                     <li
                                         key={item.id}
-                                        style={{ display: "flex" }}
+                                        style={{}}
                                     >
                                         {item.name}

[Survived] StringLiteral
src/app/armor/page.tsx:565:59
                                 {ignoredItems.map((item: Armor) => (
                                     <li
                                         key={item.id}
-                                        style={{ display: "flex" }}
+                                        style={{ display: "" }}
                                     >
                                         {item.name}

[Killed] ArrowFunction
src/app/armor/page.tsx:569:54
                                     >
                                         {item.name}
                                         <button
-                                            onClick={() =>
-                                                setIgnoredItems([
-                                                    ...ignoredItems.filter(
-                                                        (ignoredItem) =>
-                                                            ignoredItem !==
-                                                            ignoredItems.find(
-                                                                (oldItem) =>
-                                                                    oldItem ==
-                                                                    item
-                                                            )!
-                                                    ),
-                                                ])
+                                            onClick={() => undefined
                                             }
                                             style={{
killedBy: Armor Page ignores/restores single armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] MethodExpression
src/app/armor/page.tsx:571:56
                                         <button
                                             onClick={() =>
                                                 setIgnoredItems([
-                                                    ...ignoredItems.filter(
-                                                        (ignoredItem) =>
-                                                            ignoredItem !==
-                                                            ignoredItems.find(
-                                                                (oldItem) =>
-                                                                    oldItem ==
-                                                                    item
-                                                            )!
-                                                    ),
+                                                    ...ignoredItems,
                                                 ])
                                             }
killedBy: Armor Page ignores/restores single armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Survived] ArrowFunction
src/app/armor/page.tsx:572:57
                                             onClick={() =>
                                                 setIgnoredItems([
                                                     ...ignoredItems.filter(
-                                                        (ignoredItem) =>
-                                                            ignoredItem !==
-                                                            ignoredItems.find(
-                                                                (oldItem) =>
-                                                                    oldItem ==
-                                                                    item
-                                                            )!
+                                                        () => undefined
                                                     ),
                                                 ])

[Killed] ConditionalExpression
src/app/armor/page.tsx:573:61
                                                 setIgnoredItems([
                                                     ...ignoredItems.filter(
                                                         (ignoredItem) =>
-                                                            ignoredItem !==
-                                                            ignoredItems.find(
-                                                                (oldItem) =>
-                                                                    oldItem ==
-                                                                    item
-                                                            )!
+                                                            true
                                                     ),
                                                 ])
killedBy: Armor Page ignores/restores single armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/app/armor/page.tsx:573:61
                                                 setIgnoredItems([
                                                     ...ignoredItems.filter(
                                                         (ignoredItem) =>
-                                                            ignoredItem !==
-                                                            ignoredItems.find(
-                                                                (oldItem) =>
-                                                                    oldItem ==
-                                                                    item
-                                                            )!
+                                                            ignoredItem === ignoredItems.find(oldItem => oldItem == item)!
                                                     ),
                                                 ])
killedBy: Armor Page ignores/restores single armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ArrowFunction
src/app/armor/page.tsx:575:65
                                                         (ignoredItem) =>
                                                             ignoredItem !==
                                                             ignoredItems.find(
-                                                                (oldItem) =>
-                                                                    oldItem ==
-                                                                    item
+                                                                () => undefined
                                                             )!
                                                     ),
killedBy: Armor Page ignores/restores single armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/app/armor/page.tsx:576:69
                                                             ignoredItem !==
                                                             ignoredItems.find(
                                                                 (oldItem) =>
-                                                                    oldItem ==
-                                                                    item
+                                                                    oldItem != item
                                                             )!
                                                     ),
killedBy: Armor Page ignores/restores single armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/app/armor/page.tsx:576:69
                                                             ignoredItem !==
                                                             ignoredItems.find(
                                                                 (oldItem) =>
-                                                                    oldItem ==
-                                                                    item
+                                                                    false
                                                             )!
                                                     ),
killedBy: Armor Page ignores/restores single armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] StringLiteral
src/app/armor/page.tsx:588:46
                                                 minHeight: "24px",
                                             }}
                                         >
-                                            {" 🗑"}
+                                            {""
                                         </button>
                                     </li>
killedBy: Armor Page ignores/restores single armor
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name "🗑"

Here are the accessible roles:

  banner:

  Name "":
  <header />

[Survived] StringLiteral
src/app/armor/page.tsx:596:67
                         </div>
                     </article>
                     {/* <!-- sort --> */}
-                    <article style={{ flexBasis: "60%", minWidth: "320px" }}>
+                    <article style={{ flexBasis: "60%", minWidth: "" }}>
                         <b>Results</b>
                         <div>

[Survived] ObjectLiteral
src/app/armor/page.tsx:596:37
                         </div>
                     </article>
                     {/* <!-- sort --> */}
-                    <article style={{ flexBasis: "60%", minWidth: "320px" }}>
+                    <article style={{}}>
                         <b>Results</b>
                         <div>

[Killed] ArrayDeclaration
src/app/armor/page.tsx:614:57
                                                 set.gauntlets?.id!,
                                                 set.leggings?.id!,
                                             ]}
-                                            armorNames={[
-                                                set.helmet?.name!,
-                                                set.chestpiece?.name!,
-                                                set.gauntlets?.name!,
-                                                set.leggings?.name!,
-                                            ]}
+                                            armorNames={[]}
                                             itemStats={[
                                                 itemStatsToString(set.helmet!),
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading 'replaceAll')

[Killed] ArrayDeclaration
src/app/armor/page.tsx:620:56
                                                 set.gauntlets?.name!,
                                                 set.leggings?.name!,
                                             ]}
-                                            itemStats={[
-                                                itemStatsToString(set.helmet!),
-                                                itemStatsToString(
-                                                    set.chestpiece!
-                                                ),
-                                                itemStatsToString(
-                                                    set.gauntlets!
-                                                ),
-                                                itemStatsToString(
-                                                    set.leggings!
-                                                ),
-                                            ]}
+                                            itemStats={[]}
                                             setStats={setStatsToString(set)}
                                             addIgnoredItem={[
killedBy: Armor Page Renders
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
src/app/armor/page.tsx:634:49
                                             ]}
                                             setStats={setStatsToString(set)}
                                             addIgnoredItem={[
-                                                () =>
-                                                    setIgnoredItems([
-                                                        ...ignoredItems,
-                                                        set.helmet!,
-                                                    ]),
+                                                () => undefined,
                                                 () =>
                                                     setIgnoredItems([
killedBy: Armor Page ignores/restores single armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
src/app/armor/page.tsx:639:49
                                                         ...ignoredItems,
                                                         set.helmet!,
                                                     ]),
-                                                () =>
-                                                    setIgnoredItems([
-                                                        ...ignoredItems,
-                                                        set.chestpiece!,
-                                                    ]),
+                                                () => undefined,
                                                 () =>
                                                     setIgnoredItems([
killedBy: Armor Page ignores/restores single armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
src/app/armor/page.tsx:644:49
                                                         ...ignoredItems,
                                                         set.chestpiece!,
                                                     ]),
-                                                () =>
-                                                    setIgnoredItems([
-                                                        ...ignoredItems,
-                                                        set.gauntlets!,
-                                                    ]),
+                                                () => undefined,
                                                 () =>
                                                     setIgnoredItems([
killedBy: Armor Page ignores/restores single armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
src/app/armor/page.tsx:649:49
                                                         ...ignoredItems,
                                                         set.gauntlets!,
                                                     ]),
-                                                () =>
-                                                    setIgnoredItems([
-                                                        ...ignoredItems,
-                                                        set.leggings!,
-                                                    ]),
+                                                () => undefined,
                                             ]}
                                             hotkeys={hotkeyGroups[i]}
killedBy: Armor Page ignores/restores single armor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] ObjectLiteral
src/app/armor/page.tsx:690:36
                             button to save your new custom sorting algorithm to
                             the &quot;Custom&quot; sorting mode.
                         </p>
-                        <h2 style={{ textAlign: "center" }}>Ignoring Armor</h2>
+                        <h2 style={{}}>Ignoring Armor</h2>
                         <p>
                             Click the &quot;❌&quot; next to any armor piece to
